#ifndef UE4SS_SDK_Icarus_HPP
#define UE4SS_SDK_Icarus_HPP

#include "Icarus_enums.hpp"

struct FAIAudioData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFMODEvent> FootstepSound;                                         // 0x0018 (size: 0x28)
    FName FrontFootSocket;                                                            // 0x0040 (size: 0x8)
    FName RearFootSocket;                                                             // 0x0048 (size: 0x8)
    FName JumpSocket;                                                                 // 0x0050 (size: 0x8)
    TSoftObjectPtr<UFMODEvent> MovementSound;                                         // 0x0058 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> DeathCollisionSound;                                   // 0x0080 (size: 0x28)
    FName DeathCollisionSocket;                                                       // 0x00A8 (size: 0x8)
    TSoftObjectPtr<UFMODEvent> WaterDeathSound;                                       // 0x00B0 (size: 0x28)
    FName VocalisationSocket;                                                         // 0x00D8 (size: 0x8)
    FVocalisationsRowHandle AttackVocalisation;                                       // 0x00E0 (size: 0x18)
    FVocalisationsRowHandle FlinchVocalisation;                                       // 0x00F8 (size: 0x18)
    FVocalisationsRowHandle DeathVocalisation;                                        // 0x0110 (size: 0x18)
    TMap<class EAIAudioState, class FAIStateVocalisation> StateVocalisations;         // 0x0128 (size: 0x50)
    TSoftClassPtr<UCreatureAudioThreatComponent> ThreatComponentClass;                // 0x0178 (size: 0x28)
    int32 ThreatLevel;                                                                // 0x01A0 (size: 0x4)
    FCreatureAudioThreatDataRowHandle ThreatConfig;                                   // 0x01A4 (size: 0x18)
    EMusicConditionCombatState CombatMusicConditionOverride;                          // 0x01BC (size: 0x1)
    int32 MusicConditionOverrideMinThreatLevel;                                       // 0x01C0 (size: 0x4)
    float FootstepMaxDistance;                                                        // 0x01C4 (size: 0x4)
    float FoliageCheckMaxDistance;                                                    // 0x01C8 (size: 0x4)
    bool bUsesShelter;                                                                // 0x01CC (size: 0x1)

}; // Size: 0x1D0

struct FAIAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FAIAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAICreatureType : public FIcarusTableRowBase
{
    FText CreatureName;                                                               // 0x0018 (size: 0x18)
    FGameplayTag Tag;                                                                 // 0x0030 (size: 0x8)
    FVirtualStatsEnum SpawnStat;                                                      // 0x0038 (size: 0x10)
    FVirtualStatsEnum AdditionalDamageStat;                                           // 0x0048 (size: 0x10)
    FVirtualStatsEnum AdditionalResistanceStat;                                       // 0x0058 (size: 0x10)
    FExperienceEventsRowHandle SkinningXPEvent;                                       // 0x0068 (size: 0x18)
    FGameplayTag ParentCreatureTag;                                                   // 0x0080 (size: 0x8)

}; // Size: 0x88

struct FAICreatureTypeEnum : public FRowEnum
{
}; // Size: 0x10

struct FAICreatureTypeRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAIDescriptor : public FIcarusTableRowBase
{
    FGameplayTagContainer Tags;                                                       // 0x0018 (size: 0x20)
    TArray<FStatsEnum> DescriptorStats;                                               // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FAIDescriptorsEnum : public FRowEnum
{
}; // Size: 0x10

struct FAIDescriptorsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAIEventData : public FIcarusTableRowBase
{
    TSoftClassPtr<AAIEvent> AIEventBehaviourClass;                                    // 0x0018 (size: 0x28)
    int32 MaxSimultaneousEvents;                                                      // 0x0040 (size: 0x4)
    int32 CooldownDuration;                                                           // 0x0044 (size: 0x4)
    int32 CooldownRandomDeviation;                                                    // 0x0048 (size: 0x4)
    bool bStartOnCooldown;                                                            // 0x004C (size: 0x1)

}; // Size: 0x50

struct FAIEventsEnum : public FRowEnum
{
}; // Size: 0x10

struct FAIEventsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAIGrowth : public FIcarusTableRowBase
{
    TMap<FBaseStatsEnum, int32> Base;                                                 // 0x0018 (size: 0x50)
    class UCurveFloat* Health;                                                        // 0x0068 (size: 0x8)
    class UCurveFloat* MeleeDamage;                                                   // 0x0070 (size: 0x8)
    class UCurveFloat* MovementSpeed;                                                 // 0x0078 (size: 0x8)
    TArray<FCustomScaledStat> CustomStats;                                            // 0x0080 (size: 0x10)
    class UCurveFloat* ExperienceMultiplier;                                          // 0x0090 (size: 0x8)
    class UCurveFloat* ProtectiveThreatOverDistance;                                  // 0x0098 (size: 0x8)

}; // Size: 0xA0

struct FAIGrowthEnum : public FRowEnum
{
}; // Size: 0x10

struct FAIGrowthRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAIRelationshipData : public FIcarusTableRowBase
{
    TArray<FAIRelationshipsRowHandle> HostileRelationships;                           // 0x0018 (size: 0x10)
    TArray<FAIRelationshipsRowHandle> NeutralRelationships;                           // 0x0028 (size: 0x10)
    TArray<FAIRelationshipsRowHandle> FriendlyRelationships;                          // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FAIRelationshipsEnum : public FRowEnum
{
}; // Size: 0x10

struct FAIRelationshipsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAISetup : public FIcarusTableRowBase
{
    TSoftClassPtr<AActor> ActorClass;                                                 // 0x0018 (size: 0x28)
    TSoftClassPtr<AController> ControllerClass;                                       // 0x0040 (size: 0x28)
    FAICreatureTypeRowHandle CreatureType;                                            // 0x0068 (size: 0x18)
    TArray<FAIDescriptorsRowHandle> Descriptors;                                      // 0x0080 (size: 0x10)
    FItemsStaticRowHandle DeadItem;                                                   // 0x0090 (size: 0x18)
    FGOAPSetupRowHandle GOAPSetup;                                                    // 0x00A8 (size: 0x18)
    TSubclassOf<class UNavigationQueryFilter> DefaultNavigationFilter;                // 0x00C0 (size: 0x8)
    FAIRelationshipsRowHandle Relationships;                                          // 0x00C8 (size: 0x18)
    TArray<FTagQueriesRowHandle> NotifiedNPCTypes;                                    // 0x00E0 (size: 0x10)
    bool bNotifySelfType;                                                             // 0x00F0 (size: 0x1)
    FAIGrowthRowHandle AIGrowth;                                                      // 0x00F4 (size: 0x18)
    TMap<class EMovementState, class FMovementStateData> MovementMapping;             // 0x0110 (size: 0x50)
    FHuntingSetupRowHandle HuntingSetup;                                              // 0x0160 (size: 0x18)
    TArray<FCriticalHitLocation> CriticalHitBones;                                    // 0x0178 (size: 0x10)
    FAIAudioDataRowHandle Audio;                                                      // 0x0188 (size: 0x18)
    TArray<FName> CollisionHitEventBones;                                             // 0x01A0 (size: 0x10)
    int32 LatentDeathDuration;                                                        // 0x01B0 (size: 0x4)
    FGameplayTagQuery ValidBaitTagQuery;                                              // 0x01B8 (size: 0x48)
    FItemRewardsRowHandle Trophy;                                                     // 0x0200 (size: 0x18)
    FItemRewardsRowHandle Loot;                                                       // 0x0218 (size: 0x18)
    FItemRewardsRowHandle Hitable;                                                    // 0x0230 (size: 0x18)
    FExperienceRowHandle Experience;                                                  // 0x0248 (size: 0x18)
    bool bUseSurvivalCharacterState;                                                  // 0x0260 (size: 0x1)
    bool bStartWithSurvivalTickDisabled;                                              // 0x0261 (size: 0x1)
    FBestiaryDataRowHandle BestiaryGroup;                                             // 0x0264 (size: 0x18)
    TArray<FCriticalHitLocation> BlacklistBones;                                      // 0x0280 (size: 0x10)
    int32 PercentChanceToSpawn;                                                       // 0x0290 (size: 0x4)
    TArray<FAISetupRowHandle> AdditionalAIToSpawn;                                    // 0x0298 (size: 0x10)

}; // Size: 0x2A8

struct FAISetupEnum : public FRowEnum
{
}; // Size: 0x10

struct FAISetupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAISpawnConfigData : public FIcarusTableRowBase
{
    TMap<class FAISetupEnum, class FAISpawnRulesList> AISpawnRules;                   // 0x0018 (size: 0x50)
    TSoftObjectPtr<UGameplayTexture> SpawnMap;                                        // 0x0068 (size: 0x28)
    TArray<FAISpawnZoneSetup> SpawnZones;                                             // 0x0090 (size: 0x10)
    TArray<FAutonomousSpawnsRowHandle> TerrainAutonomousSpawners;                     // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FAISpawnConfigEnum : public FRowEnum
{
}; // Size: 0x10

struct FAISpawnConfigRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAISpawnListItemData
{
    FAISetupEnum AISetup;                                                             // 0x0000 (size: 0x10)
    int32 SpawnWeight;                                                                // 0x0010 (size: 0x4)
    FEpicCreaturesEnum EpicCreature;                                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FAISpawnRuleData : public FIcarusTableRowBase
{
    TSoftClassPtr<UIcarusAISpawnFilter> SpawnFilter;                                  // 0x0018 (size: 0x28)
    bool InverseCondition;                                                            // 0x0040 (size: 0x1)
    TMap<FString, int32> FilterParams;                                                // 0x0048 (size: 0x50)

}; // Size: 0x98

struct FAISpawnRulesEnum : public FRowEnum
{
}; // Size: 0x10

struct FAISpawnRulesList
{
    TArray<FAISpawnRulesEnum> SpawnRules;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAISpawnRulesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAISpawnZoneSetup
{
    FColor Color;                                                                     // 0x0000 (size: 0x4)
    FAISpawnZonesRowHandle SpawnZone;                                                 // 0x0004 (size: 0x18)

}; // Size: 0x1C

struct FAISpawnZones : public FIcarusTableRowBase
{
    FBiomeAISpawnData Creatures;                                                      // 0x0018 (size: 0x78)
    int32 MinLevel;                                                                   // 0x0090 (size: 0x4)
    int32 MedianLevel;                                                                // 0x0094 (size: 0x4)
    int32 MaxLevel;                                                                   // 0x0098 (size: 0x4)

}; // Size: 0xA0

struct FAISpawnZonesEnum : public FRowEnum
{
}; // Size: 0x10

struct FAISpawnZonesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAIStateVocalisation
{
    FVocalisationsRowHandle StateEnteredVocalisation;                                 // 0x0000 (size: 0x18)
    FVocalisationsRowHandle StatePersistentVocalisation;                              // 0x0018 (size: 0x18)
    FVocalisationsRowHandle StateExitedVocalisation;                                  // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FAccoladeCompletedState
{
    FAccoladesRowHandle Accolade;                                                     // 0x0000 (size: 0x18)
    FDateTime TimeCompleted;                                                          // 0x0018 (size: 0x8)
    FString ProspectID;                                                               // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAccoladeData : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0048 (size: 0x28)
    TSoftClassPtr<UAccoladeImpl> AccoladeImpl;                                        // 0x0070 (size: 0x28)
    FPlayerAccoladeCategoriesEnum Category;                                           // 0x0098 (size: 0x10)
    FPlayerTrackersRowHandle Tracker;                                                 // 0x00A8 (size: 0x18)
    FGameplayTagContainer Tags;                                                       // 0x00C0 (size: 0x20)
    TArray<FRowHandle> ExtraDatas;                                                    // 0x00E0 (size: 0x10)
    int32 GoalCount;                                                                  // 0x00F0 (size: 0x4)
    FName SteamAchievementId;                                                         // 0x00F4 (size: 0x8)

}; // Size: 0x100

struct FAccoladeSaveData
{
    TArray<FAccoladeCompletedState> CompletedAccolades;                               // 0x0000 (size: 0x10)
    TMap<FPlayerTrackersRowHandle, int32> PlayerTrackers;                             // 0x0010 (size: 0x50)
    TMap<class FPlayerTrackersRowHandle, class FTrackerTaskListProgress> PlayerTaskListTrackers; // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FAccoladeTaskState
{
    FText TaskName;                                                                   // 0x0000 (size: 0x18)
    bool bComplete;                                                                   // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FAccoladesEnum : public FRowEnum
{
}; // Size: 0x10

struct FAccoladesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAccountFlag : public FIcarusTableRowBase
{
    TArray<FItemTemplateRowHandle> BlueprintUnlocks;                                  // 0x0018 (size: 0x10)
    TArray<FWorkshopItemsRowHandle> WorkshopUnlocks;                                  // 0x0028 (size: 0x10)
    TArray<FPlayerTalentModifiersRowHandle> TalentModifierUnlocks;                    // 0x0038 (size: 0x10)
    TArray<FLivingItemShopItemsRowHandle> LegendaryRewards;                           // 0x0048 (size: 0x10)
    TArray<FProspectListRowHandle> RewardedFromMissions;                              // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FAccountFlagsEnum : public FRowEnum
{
}; // Size: 0x10

struct FAccountFlagsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FActionAnimData
{
    TSoftObjectPtr<UAnimMontage> ActionMontage;                                       // 0x0000 (size: 0x28)
    TMap<FName, float> PossibleMontageSections;                                       // 0x0028 (size: 0x50)
    FName ActionNotify;                                                               // 0x0078 (size: 0x8)

}; // Size: 0x80

struct FActionData : public FIcarusTableRowBase
{
    TSubclassOf<class UActionableBehaviour> Behaviour;                                // 0x0018 (size: 0x8)
    TSoftObjectPtr<UAnimMontage> TP_ActionMontage;                                    // 0x0020 (size: 0x28)
    TArray<FSuccessAnimSet> TP_SuccessAnimations;                                     // 0x0048 (size: 0x10)
    TArray<FName> TP_ActionFailMontageVariations;                                     // 0x0058 (size: 0x10)
    TArray<FName> TP_ActionMissMontageVariations;                                     // 0x0068 (size: 0x10)
    TSoftObjectPtr<UAnimMontage> FP_ActionMontage;                                    // 0x0078 (size: 0x28)
    TArray<FSuccessAnimSet> FP_SuccessAnimations;                                     // 0x00A0 (size: 0x10)
    TArray<FName> FP_ActionFailMontageVariations;                                     // 0x00B0 (size: 0x10)
    TArray<FName> FP_ActionMissMontageVariations;                                     // 0x00C0 (size: 0x10)
    FName BeginStaminaActionNotify;                                                   // 0x00D0 (size: 0x8)
    bool WaitForActionComplete;                                                       // 0x00D8 (size: 0x1)
    float ActionCooldown;                                                             // 0x00DC (size: 0x4)
    TArray<FStatsEnum> CooldownMultipliers;                                           // 0x00E0 (size: 0x10)
    FStatsEnum RequiredStat;                                                          // 0x00F0 (size: 0x10)

}; // Size: 0x100

struct FActionList
{
    TMap<class EActionableEventType, class FStaminaActionCostsRowHandle> InputTypes;  // 0x0000 (size: 0x50)
    FModifierStatesRowHandle ModifierState;                                           // 0x0050 (size: 0x18)

}; // Size: 0x68

struct FActionStaminaCostEventPairing
{
    EActionableEventType Event;                                                       // 0x0000 (size: 0x1)
    FStaminaActionCostsRowHandle StaminaCost;                                         // 0x0004 (size: 0x18)

}; // Size: 0x1C

struct FActionableData : public FIcarusTableRowBase
{
    TMap<class FActionsRowHandle, class FActionList> ActionMapping;                   // 0x0018 (size: 0x50)
    bool bUseClientPrediction;                                                        // 0x0068 (size: 0x1)
    TArray<FRowHandle> GenericData;                                                   // 0x0070 (size: 0x10)
    bool bSimultaneousActionExecution;                                                // 0x0080 (size: 0x1)

}; // Size: 0x88

struct FActionableEnum : public FRowEnum
{
}; // Size: 0x10

struct FActionableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FActionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FActionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FActiveEvent
{
    class AAIEvent* Event;                                                            // 0x0000 (size: 0x8)
    class AActor* InstigatorActor;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FActiveWeatherInfo
{
    FWeatherEventsRowHandle WeatherEvent;                                             // 0x0000 (size: 0x18)
    FBiomesRowHandle Biome;                                                           // 0x0018 (size: 0x18)
    TArray<class UIcarusWeatherAction*> Actions;                                      // 0x0030 (size: 0x10)
    int32 StartTime;                                                                  // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FActorBoolVariableRecord
{
    FName VariableName;                                                               // 0x0000 (size: 0x8)
    bool bVariable;                                                                   // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FActorCollection
{
    TArray<class AIcarusActor*> Actors;                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FActorIntVariableRecord
{
    FName VariableName;                                                               // 0x0000 (size: 0x8)
    int32 iVariable;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FActorNameVariableRecord
{
    FName VariableName;                                                               // 0x0000 (size: 0x8)
    FName Variable;                                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FActorTextVariableRecord
{
    FName VariableName;                                                               // 0x0000 (size: 0x8)
    FText Variable;                                                                   // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FAfflictionChance : public FIcarusTableRowBase
{
    TArray<FModifierStatesRowHandle> Afflictions;                                     // 0x0018 (size: 0x10)
    FStatsEnum ChanceStat;                                                            // 0x0028 (size: 0x10)
    int32 ChanceInPercent;                                                            // 0x0038 (size: 0x4)
    int32 DurationInSeconds;                                                          // 0x003C (size: 0x4)

}; // Size: 0x40

struct FAfflictionChanceEnum : public FRowEnum
{
}; // Size: 0x10

struct FAfflictionChanceRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAlteration : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)
    FText Description;                                                                // 0x0058 (size: 0x18)
    TSoftObjectPtr<UTexture2D> RankIcon;                                              // 0x0070 (size: 0x28)
    TMap<FStatsEnum, int32> Stats;                                                    // 0x0098 (size: 0x50)

}; // Size: 0xE8

struct FAlterationModifiers : public FIcarusTableRowBase
{
    FAlterationsEnum Alteration;                                                      // 0x0018 (size: 0x10)
    float ModifierDuration;                                                           // 0x0028 (size: 0x4)
    FModifierStatesRowHandle Modifier;                                                // 0x002C (size: 0x18)
    int32 Priority;                                                                   // 0x0044 (size: 0x4)
    bool bIsCrafted;                                                                  // 0x0048 (size: 0x1)
    bool bCannotBeFurtherAltered;                                                     // 0x0049 (size: 0x1)
    int32 ModifierEffectiveness;                                                      // 0x004C (size: 0x4)

}; // Size: 0x50

struct FAlterationModifiersEnum : public FRowEnum
{
}; // Size: 0x10

struct FAlterationModifiersRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAlterationsEnum : public FRowEnum
{
}; // Size: 0x10

struct FAlterationsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAmmoTypeData : public FIcarusTableRowBase
{
    int32 ProjectileCount;                                                            // 0x0018 (size: 0x4)
    int32 ProjectileDamage;                                                           // 0x001C (size: 0x4)
    FVector2D ProjectileAccuracy;                                                     // 0x0020 (size: 0x8)
    TMap<FStatsEnum, int32> Stats;                                                    // 0x0028 (size: 0x50)

}; // Size: 0x78

struct FAmmoTypesEnum : public FRowEnum
{
}; // Size: 0x10

struct FAmmoTypesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAnimNode_ExtensionLimit : public FAnimNode_SkeletalControlBase
{
    TArray<FExtensionLimitLimbDefinition> LimbDefinitions;                            // 0x00C8 (size: 0x10)

}; // Size: 0xD8

struct FAnimNode_SpeedWarping3D : public FAnimNode_SkeletalControlBase
{
    TArray<FSpeedWarping3DLimbDefinition> LimbDefinitions;                            // 0x00C8 (size: 0x10)
    TEnumAsByte<EBoneControlSpace> Space;                                             // 0x00D8 (size: 0x1)
    TEnumAsByte<ECollisionChannel> TraceProfile;                                      // 0x00D9 (size: 0x1)
    FVector Direction;                                                                // 0x00DC (size: 0xC)
    float SpeedScaling;                                                               // 0x00E8 (size: 0x4)

}; // Size: 0xF0

struct FArmourComponentData
{
    TArray<FArmourRowHandle> AssociatedRowHandles;                                    // 0x0010 (size: 0x10)
    TArray<class USkeletalMeshComponent*> ArmourComponents;                           // 0x0020 (size: 0x10)
    TArray<class USkeletalMeshComponent*> SimpleTPArmourComponents;                   // 0x0030 (size: 0x10)
    TArray<class USkeletalMeshComponent*> FPArmourComponents;                         // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FArmourData : public FIcarusTableRowBase
{
    TSoftObjectPtr<USkeletalMesh> ArmourMesh;                                         // 0x0018 (size: 0x28)
    TSoftObjectPtr<USkeletalMesh> HabArmourMesh;                                      // 0x0040 (size: 0x28)
    TSoftObjectPtr<USkeletalMesh> FemaleMeshVariant;                                  // 0x0068 (size: 0x28)
    TSoftObjectPtr<USkeletalMesh> FirstPersonMeshVariant;                             // 0x0090 (size: 0x28)
    bool bHideFirstPersonUndersuit;                                                   // 0x00B8 (size: 0x1)
    TSoftClassPtr<UAnimInstance> AnimBlueprintClass;                                  // 0x00C0 (size: 0x28)
    TSoftClassPtr<UAnimInstance> FemaleAnimBlueprintClass;                            // 0x00E8 (size: 0x28)
    TSoftClassPtr<UAnimInstance> FirstPersonAnimBlueprintClass;                       // 0x0110 (size: 0x28)
    TSoftClassPtr<UGFurComponent> TPFurClass;                                         // 0x0138 (size: 0x28)
    TSoftClassPtr<UGFurComponent> FPFurClass;                                         // 0x0160 (size: 0x28)
    TMap<FBaseStatsEnum, int32> ArmourStats;                                          // 0x0188 (size: 0x50)
    EArmourType ArmourType;                                                           // 0x01D8 (size: 0x1)
    FArmourSetsRowHandle ArmourSet;                                                   // 0x01DC (size: 0x18)
    TArray<FArmourRowHandle> ImplicitDefaultArmour;                                   // 0x01F8 (size: 0x10)
    bool bOverrideDefaultMaterials;                                                   // 0x0208 (size: 0x1)
    TMap<int32, TSoftObjectPtr<UMaterialInterface>> ArmourMeshMaterialOverrides;      // 0x0210 (size: 0x50)
    TMap<int32, TSoftObjectPtr<UMaterialInterface>> FemaleArmourMeshMaterialOverrides; // 0x0260 (size: 0x50)
    TMap<int32, TSoftObjectPtr<UMaterialInterface>> FPArmourMeshMaterialOverrides;    // 0x02B0 (size: 0x50)

}; // Size: 0x300

struct FArmourEnum : public FRowEnum
{
}; // Size: 0x10

struct FArmourRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FArmourSet : public FIcarusTableRowBase
{
    TArray<FArmourSetBonusRowHandle> SetBonus;                                        // 0x0018 (size: 0x10)
    EPlayerArmourTypeFMODParam FMODParam;                                             // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FArmourSetBonus : public FIcarusTableRowBase
{
    int32 RequiredGear;                                                               // 0x0018 (size: 0x4)
    FText Description;                                                                // 0x0020 (size: 0x18)
    TMap<FBaseStatsEnum, int32> StatsGranted;                                         // 0x0038 (size: 0x50)

}; // Size: 0x88

struct FArmourSetBonusEnum : public FRowEnum
{
}; // Size: 0x10

struct FArmourSetBonusRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FArmourSetsEnum : public FRowEnum
{
}; // Size: 0x10

struct FArmourSetsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAssetReferenceData : public FIcarusTableRowBase
{
    EAssetType AssetType;                                                             // 0x0018 (size: 0x1)
    TSoftClassPtr<UObject> SoftClassPtr;                                              // 0x0020 (size: 0x28)
    TSoftObjectPtr<UObject> SoftObjectPtr;                                            // 0x0048 (size: 0x28)
    UClass* HardClassPtr;                                                             // 0x0070 (size: 0x8)
    class UObject* HardObjectPtr;                                                     // 0x0078 (size: 0x8)
    bool bHardReference;                                                              // 0x0080 (size: 0x1)
    bool bPreload;                                                                    // 0x0081 (size: 0x1)

}; // Size: 0x88

struct FAssetReferencesEnum : public FRowEnum
{
}; // Size: 0x10

struct FAssetReferencesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAssociatedProspectInfo
{
    FProspectInfo AssociatedProspect;                                                 // 0x0000 (size: 0xA0)
    FLastProspectHostInfo HostedBy;                                                   // 0x00A0 (size: 0x38)

}; // Size: 0xD8

struct FAtmospheresEnum : public FRowEnum
{
}; // Size: 0x10

struct FAtmospheresRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAttachmentIcon : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FAttachmentIconsEnum : public FRowEnum
{
}; // Size: 0x10

struct FAttachmentIconsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FAudioContextCaveColliderSet
{
    TSet<UPrimitiveComponent*> Colliders;                                             // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FAudioContextSubscriber
{
    class UFMODAudioComponent* AudioComponent;                                        // 0x0000 (size: 0x8)

}; // Size: 0x20

struct FAudioOcclusionSocketTracePoint
{
    FName TraceName;                                                                  // 0x0000 (size: 0x8)
    FName TargetSocket;                                                               // 0x0008 (size: 0x8)
    class USceneComponent* Target;                                                    // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAudioOcclusionTracePoint
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0xC)

}; // Size: 0x14

struct FAudioOcclusionTraceResult
{
}; // Size: 0x8

struct FAuraActor
{
    class AActor* Actor;                                                              // 0x0000 (size: 0x8)
    int32 ModifierUID;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FAuraFlags
{
    bool EffectsSelf;                                                                 // 0x0000 (size: 0x1)
    bool EffectsPlayers;                                                              // 0x0001 (size: 0x1)
    bool EffectsNPCs;                                                                 // 0x0002 (size: 0x1)
    bool EffectsDeployables;                                                          // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FAuraInfo : public FIcarusTableRowBase
{
    FModifierStatesRowHandle Modifier;                                                // 0x0018 (size: 0x18)
    FStatsEnum Stat;                                                                  // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FAuraInstance
{
    FModifierStateData AuraModifier;                                                  // 0x0000 (size: 0x268)
    FModifierStatesRowHandle ModifierRow;                                             // 0x0268 (size: 0x18)
    class UModifierStateComponent* OwningStateComp;                                   // 0x0280 (size: 0x8)
    TMap<AActor*, int32> CurrentAffectedActors;                                       // 0x0288 (size: 0x50)
    int32 AuraRange;                                                                  // 0x02D8 (size: 0x4)

}; // Size: 0x2E0

struct FAuraInstances
{
    TArray<FAuraInstance> Instances;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAutonomousSpawnData : public FIcarusTableRowBase
{
    FAISetupEnum AISetup;                                                             // 0x0018 (size: 0x10)
    TSoftClassPtr<AIcarusActor> IcarusActorClass;                                     // 0x0028 (size: 0x28)
    TSoftClassPtr<UObject> AISpawnBehaviour;                                          // 0x0050 (size: 0x28)
    int32 MaxNumAroundPlayers;                                                        // 0x0078 (size: 0x4)
    int32 MaxSpawnCount;                                                              // 0x007C (size: 0x4)
    int32 MaxDistanceToPlayers;                                                       // 0x0080 (size: 0x4)
    FGameplayTagContainer GameplayTagsToApply;                                        // 0x0088 (size: 0x20)
    FWorldStatsEnum RequiredStat;                                                     // 0x00A8 (size: 0x10)

}; // Size: 0xB8

struct FAutonomousSpawnsEnum : public FRowEnum
{
}; // Size: 0x10

struct FAutonomousSpawnsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBackingStatContainer
{
}; // Size: 0x20

struct FBagPriorityData : public FIcarusTableRowBase
{
    FTagQueriesRowHandle ItemQuery;                                                   // 0x0018 (size: 0x18)
    TArray<FItemsStaticRowHandle> BagItems;                                           // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FBagPriorityEnum : public FRowEnum
{
}; // Size: 0x10

struct FBagPriorityRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBallisticAudioData
{
    TSoftObjectPtr<UFMODEvent> FlySound;                                              // 0x0000 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> ImpactSound;                                           // 0x0028 (size: 0x28)
    bool bPlayImpactSoundOnPayload;                                                   // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FBallisticData : public FIcarusTableRowBase
{
    TSoftClassPtr<UBallisticComponent> Behaviour;                                     // 0x0018 (size: 0x28)
    float Damage;                                                                     // 0x0040 (size: 0x4)
    int32 DamageVariationPercentage;                                                  // 0x0044 (size: 0x4)
    bool bCanStealthAttack;                                                           // 0x0048 (size: 0x1)
    bool bHomingProjectile;                                                           // 0x0049 (size: 0x1)
    bool bCanKillCam;                                                                 // 0x004A (size: 0x1)
    bool bUnbreakableDuringKillCam;                                                   // 0x004B (size: 0x1)
    float Weight;                                                                     // 0x004C (size: 0x4)
    float GravityScale;                                                               // 0x0050 (size: 0x4)
    bool AllowPickupAfterSettle;                                                      // 0x0054 (size: 0x1)
    TSoftClassPtr<AIcarusPayload> PayloadClass;                                       // 0x0058 (size: 0x28)
    EPayloadDeploymentType PayloadDeploymentType;                                     // 0x0080 (size: 0x1)
    float PayloadDeploymentTimerDelay;                                                // 0x0084 (size: 0x4)
    TSoftObjectPtr<UFXSystemAsset> TrailParticle;                                     // 0x0088 (size: 0x28)
    bool bPlayHitEffects;                                                             // 0x00B0 (size: 0x1)
    float BreakChance;                                                                // 0x00B4 (size: 0x4)
    int32 DurabilityDamage;                                                           // 0x00B8 (size: 0x4)
    float PostDeployLifetime;                                                         // 0x00BC (size: 0x4)
    int32 CullDistanceSquared;                                                        // 0x00C0 (size: 0x4)
    bool AttachOnHit;                                                                 // 0x00C4 (size: 0x1)
    FBounceSettings ProjectileBounceSettings;                                         // 0x00C8 (size: 0x18)
    TSoftObjectPtr<UStaticMesh> OverrideStaticMesh;                                   // 0x00E0 (size: 0x28)
    TSoftObjectPtr<USkeletalMesh> OverrideSkeletalMesh;                               // 0x0108 (size: 0x28)
    TSoftObjectPtr<UPhysicsAsset> OverridePhysicsAsset;                               // 0x0130 (size: 0x28)
    bool RotationFollowsVelocity;                                                     // 0x0158 (size: 0x1)
    FRotator VelocityRotationOffset;                                                  // 0x015C (size: 0xC)
    FRotator AngularRotation;                                                         // 0x0168 (size: 0xC)
    FVector SpawnPositionOffset;                                                      // 0x0174 (size: 0xC)
    FBallisticAudioData AudioData;                                                    // 0x0180 (size: 0x58)
    bool bUseActorPooling;                                                            // 0x01D8 (size: 0x1)
    bool bDisableRecorderComponent;                                                   // 0x01D9 (size: 0x1)
    float OnHitAINoiseEventRange;                                                     // 0x01DC (size: 0x4)

}; // Size: 0x1E0

struct FBallisticEnum : public FRowEnum
{
}; // Size: 0x10

struct FBallisticRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBanInfo
{
    FString AccountId;                                                                // 0x0000 (size: 0x10)
    FString AccountJson;                                                              // 0x0010 (size: 0x10)
    FText BanReason;                                                                  // 0x0020 (size: 0x18)
    FString PlayerNameDuringBan;                                                      // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FBarSegment
{
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0000 (size: 0x28)
    int32 SegmentSize;                                                                // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FBaseLevelTeleportRepInfo
{
    FTransform BaseMeshTransform;                                                     // 0x0000 (size: 0x30)
    FTransform PlacementMeshTransform;                                                // 0x0030 (size: 0x30)
    class UStaticMesh* BaseMeshRef;                                                   // 0x0060 (size: 0x8)
    TArray<class UMaterialInterface*> BaseMeshMaterials;                              // 0x0068 (size: 0x10)

}; // Size: 0x80

struct FBaseStatsEnum : public FStatsEnum
{
}; // Size: 0x10

struct FBestiaryBiome
{
    TArray<FBestiaryDataRowHandle> Creatures;                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBestiaryCategory
{
    TMap<class FAtmospheresRowHandle, class FBestiaryBiome> Biomes;                   // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FBestiaryData : public FIcarusTableRowBase
{
    FText CreatureName;                                                               // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Image;                                                 // 0x0030 (size: 0x28)
    float PopupImageScale;                                                            // 0x0058 (size: 0x4)
    FVector2D PopupImageOffset;                                                       // 0x005C (size: 0x8)
    EBiomeImageType BiomeImageType;                                                   // 0x0064 (size: 0x1)
    TSoftObjectPtr<UFMODEvent> CreatureSound;                                         // 0x0068 (size: 0x28)
    TArray<FAISetupRowHandle> SpecificCreatures;                                      // 0x0090 (size: 0x10)
    TArray<FAtmospheresRowHandle> Biomes;                                             // 0x00A0 (size: 0x10)
    TArray<FTerrainsRowHandle> Maps;                                                  // 0x00B0 (size: 0x10)
    int32 TotalPointsRequired;                                                        // 0x00C0 (size: 0x4)
    FText Lore1;                                                                      // 0x00C8 (size: 0x18)
    FText Lore2;                                                                      // 0x00E0 (size: 0x18)
    FText Lore3;                                                                      // 0x00F8 (size: 0x18)
    TArray<FBestiaryTraitsRowHandle> Traits;                                          // 0x0110 (size: 0x10)
    TMap<FBaseStatsEnum, int32> StatsUnlock1;                                         // 0x0120 (size: 0x50)
    TMap<FBaseStatsEnum, int32> StatsUnlock2;                                         // 0x0170 (size: 0x50)
    TArray<FBaseStatsEnum> ProgressiveStat;                                           // 0x01C0 (size: 0x10)
    bool bIsBoss;                                                                     // 0x01D0 (size: 0x1)

}; // Size: 0x1D8

struct FBestiaryDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FBestiaryDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBestiaryFastArray : public FFastArraySerializer
{
    TArray<FBestiaryFastArrayItem> BestiaryEntries;                                   // 0x0108 (size: 0x10)

}; // Size: 0x158

struct FBestiaryFastArrayItem : public FFastArraySerializerItem
{
    FBestiaryDataRowHandle BestiaryRowHandle;                                         // 0x000C (size: 0x18)
    int32 PointScore;                                                                 // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FBestiaryGroupTracking
{
    FBestiaryDataRowHandle BestiaryGroup;                                             // 0x0000 (size: 0x18)
    int32 NumPoints;                                                                  // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FBestiaryPoints : public FIcarusTableRowBase
{
    int32 PointsAwarded;                                                              // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FBestiaryPointsEnum : public FRowEnum
{
}; // Size: 0x10

struct FBestiaryPointsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBestiaryTraitData : public FIcarusTableRowBase
{
    FText TraitName;                                                                  // 0x0018 (size: 0x18)
    FBestiaryTraitTypesRowHandle Type;                                                // 0x0030 (size: 0x18)
    FLinearColor OverrideColor;                                                       // 0x0048 (size: 0x10)
    TSoftObjectPtr<UTexture2D> OverrideIcon;                                          // 0x0058 (size: 0x28)

}; // Size: 0x80

struct FBestiaryTraitType : public FIcarusTableRowBase
{
    FLinearColor Color;                                                               // 0x0018 (size: 0x10)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FBestiaryTraitTypesEnum : public FRowEnum
{
}; // Size: 0x10

struct FBestiaryTraitTypesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBestiaryTraitsEnum : public FRowEnum
{
}; // Size: 0x10

struct FBestiaryTraitsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBiomeAISpawnData
{
    TArray<FAISpawnListItemData> AISpawnList;                                         // 0x0000 (size: 0x10)
    TMap<class FWorldStatsEnum, class FAISpawnListItemData> WorldStatInjection;       // 0x0010 (size: 0x50)
    int32 BiomeSpawnDensity;                                                          // 0x0060 (size: 0x4)
    TArray<FAutonomousSpawnsRowHandle> RelevantAutonomousSpawners;                    // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FBiomeAudioData : public FIcarusTableRowBase
{
    EGlobalEnvironmentBiomeFMODParam BiomeFMODParam;                                  // 0x0018 (size: 0x1)
    FMusicLocationConditionsRowHandle MusicLocationCondition;                         // 0x001C (size: 0x18)
    TSoftObjectPtr<UFMODEvent> AudioAmbienceBase;                                     // 0x0038 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> AudioAmbienceTransitional;                             // 0x0060 (size: 0x28)

}; // Size: 0x88

struct FBiomeAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FBiomeAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBiomeGroupForecast
{
    FWeatherBiomeGroupsEnum BiomeGroup;                                               // 0x0000 (size: 0x10)
    TArray<FWeatherBlockEvent> Events;                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBiomesEnum : public FRowEnum
{
}; // Size: 0x10

struct FBiomesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBlueprintUnlock : public FIcarusTableRowBase
{
    FItemableRowHandle Itemable;                                                      // 0x0018 (size: 0x18)
    TArray<FCharacterFlagsRowHandle> Requirements;                                    // 0x0030 (size: 0x10)
    TArray<FCharacterFlagsRowHandle> Unlocks;                                         // 0x0040 (size: 0x10)
    int32 RequiredPointsToUnlock;                                                     // 0x0050 (size: 0x4)
    int32 RequiredLevel;                                                              // 0x0054 (size: 0x4)

}; // Size: 0x58

struct FBlueprintUnlocksEnum : public FRowEnum
{
}; // Size: 0x10

struct FBlueprintUnlocksRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBounceSettings
{
    bool bBounceAngleAffectsFriction;                                                 // 0x0000 (size: 0x1)
    float Bounciness;                                                                 // 0x0004 (size: 0x4)
    float Friction;                                                                   // 0x0008 (size: 0x4)
    float BounceVelocityStopSimulatingThreshold;                                      // 0x000C (size: 0x4)
    float MinFrictionFraction;                                                        // 0x0010 (size: 0x4)
    float MinTimeBetweenBounces;                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FBreakableRockData : public FIcarusTableRowBase
{
    FItemRewardsRowHandle ItemReward;                                                 // 0x0018 (size: 0x18)
    FItemTemplateRowHandle PyriticCrustItemType;                                      // 0x0030 (size: 0x18)
    FDurableRowHandle Durable;                                                        // 0x0048 (size: 0x18)
    FStatsEnum RewardStat;                                                            // 0x0060 (size: 0x10)
    FGameplayTagContainer Tags;                                                       // 0x0070 (size: 0x20)
    TSoftObjectPtr<UFMODEvent> BreakSound;                                            // 0x0090 (size: 0x28)

}; // Size: 0xB8

struct FBreakableRockDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FBreakableRockDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildableAudioData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFMODEvent> BuildingPlacedSound;                                   // 0x0018 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingStressDamageSound;                             // 0x0040 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingDestroyedSound;                                // 0x0068 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingDamagedSound;                                  // 0x0090 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingDestructibleDamagedSound;                      // 0x00B8 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingWeatherDamageSound;                            // 0x00E0 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingWeatherDamageStrippedSound;                    // 0x0108 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingWeatherUnzippingSound;                         // 0x0130 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BuildingRepairedSound;                                 // 0x0158 (size: 0x28)
    float BuildingOcclusionValue;                                                     // 0x0180 (size: 0x4)

}; // Size: 0x188

struct FBuildableAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FBuildableAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildableData : public FIcarusTableRowBase
{
    TSubclassOf<class UBuildableComponent> Behaviour;                                 // 0x0018 (size: 0x8)
    FBuildingStabilityRowHandle Stability;                                            // 0x0020 (size: 0x18)
    FBuildingTypesRowHandle Type;                                                     // 0x0038 (size: 0x18)
    EBuildingPieceType PieceType;                                                     // 0x0050 (size: 0x1)
    TArray<FBuildingVariation> Variations;                                            // 0x0058 (size: 0x10)
    TMap<FStatsEnum, int32> Stats;                                                    // 0x0068 (size: 0x50)

}; // Size: 0xB8

struct FBuildableEnum : public FRowEnum
{
}; // Size: 0x10

struct FBuildableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildingGridSaveData
{
    FTransform GridTransform;                                                         // 0x0010 (size: 0x30)
    TArray<FDatabaseBuildingData> BuildingTypes;                                      // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FBuildingInfo
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)
    int32 Variation;                                                                  // 0x0030 (size: 0x4)
    int32 IcarusUID;                                                                  // 0x0034 (size: 0x4)
    float BurnTimeRemaining;                                                          // 0x0038 (size: 0x4)
    int32 HealthPercentage;                                                           // 0x003C (size: 0x4)
    TArray<FBuildingRecordStatData> AdditionalStats;                                  // 0x0040 (size: 0x10)
    TArray<FBuildingRecordAlterationData> Alterations;                                // 0x0050 (size: 0x10)
    bool bIsInCave;                                                                   // 0x0060 (size: 0x1)
    bool bSupportedByGround;                                                          // 0x0061 (size: 0x1)
    float AnchorStrength;                                                             // 0x0064 (size: 0x4)
    TArray<FModifierStateSaveData> Modifiers;                                         // 0x0068 (size: 0x10)

}; // Size: 0x80

struct FBuildingInstance
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)
    int32 Variation;                                                                  // 0x0030 (size: 0x4)
    int32 IcarusUID;                                                                  // 0x0034 (size: 0x4)
    float BurnTimeRemaining;                                                          // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FBuildingList
{
    TArray<class ABuildingBase*> Buildings;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBuildingLookup : public FIcarusTableRowBase
{
    FText PieceName;                                                                  // 0x0018 (size: 0x18)
    bool AccumulationEnabled;                                                         // 0x0030 (size: 0x1)
    FBuildingPiecesRowHandle Thatch;                                                  // 0x0034 (size: 0x18)
    FBuildingPiecesRowHandle Wood;                                                    // 0x004C (size: 0x18)
    FBuildingPiecesRowHandle Refined_Wood;                                            // 0x0064 (size: 0x18)
    FBuildingPiecesRowHandle Stone;                                                   // 0x007C (size: 0x18)
    FBuildingPiecesRowHandle Concrete;                                                // 0x0094 (size: 0x18)
    FBuildingPiecesRowHandle Aluminium;                                               // 0x00AC (size: 0x18)
    FBuildingPiecesRowHandle Glass;                                                   // 0x00C4 (size: 0x18)
    FBuildingPiecesRowHandle ClayBrick;                                               // 0x00DC (size: 0x18)
    FBuildingPiecesRowHandle Scoria;                                                  // 0x00F4 (size: 0x18)
    FBuildingPiecesRowHandle ScoriaBrick;                                             // 0x010C (size: 0x18)
    FBuildingPiecesRowHandle Ice;                                                     // 0x0124 (size: 0x18)
    FBuildingPiecesRowHandle Dirt;                                                    // 0x013C (size: 0x18)
    FBuildingPiecesRowHandle Steel;                                                   // 0x0154 (size: 0x18)
    FBuildingPiecesRowHandle StoneBrick;                                              // 0x016C (size: 0x18)
    FBuildingPiecesRowHandle Limestone;                                               // 0x0184 (size: 0x18)
    FBuildingPiecesRowHandle BeeswaxWood;                                             // 0x019C (size: 0x18)
    FBuildingPiecesRowHandle GlassTempered;                                           // 0x01B4 (size: 0x18)

}; // Size: 0x1D0

struct FBuildingLookupEnum : public FRowEnum
{
}; // Size: 0x10

struct FBuildingLookupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildingPiece : public FIcarusTableRowBase
{
    FBuildingLookupRowHandle Type;                                                    // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)
    TSoftClassPtr<ABuildingBase> Blueprint;                                           // 0x0058 (size: 0x28)
    FBuildableAudioDataRowHandle Audio;                                               // 0x0080 (size: 0x18)
    FBuildingSkinsRowHandle Skin;                                                     // 0x0098 (size: 0x18)

}; // Size: 0xB0

struct FBuildingPiecesEnum : public FRowEnum
{
}; // Size: 0x10

struct FBuildingPiecesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildingRecordAlterationData
{
    FName Alteration;                                                                 // 0x0000 (size: 0x8)
    int32 Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FBuildingRecordStatData
{
    FName Stat;                                                                       // 0x0000 (size: 0x8)
    int32 Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FBuildingSkin : public FIcarusTableRowBase
{
    TMap<int32, TSoftObjectPtr<UMaterialInterface>> BaseMeshMaterialSlotOverrides;    // 0x0018 (size: 0x50)
    TMap<int32, TSoftObjectPtr<UMaterialInterface>> FrameMaterialSlotOverrides;       // 0x0068 (size: 0x50)

}; // Size: 0xB8

struct FBuildingSkinsEnum : public FRowEnum
{
}; // Size: 0x10

struct FBuildingSkinsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildingStability : public FIcarusTableRowBase
{
    float BuildingTier;                                                               // 0x0018 (size: 0x4)
    float MaxHardStability;                                                           // 0x001C (size: 0x4)
    int32 HardStabilityMaxRange;                                                      // 0x0020 (size: 0x4)
    float MinimumUnstableStability;                                                   // 0x0024 (size: 0x4)
    float StabilityPassMultiplier;                                                    // 0x0028 (size: 0x4)
    float MaxAnchoredStability;                                                       // 0x002C (size: 0x4)
    float LowestGreenStability;                                                       // 0x0030 (size: 0x4)
    float YellowStability;                                                            // 0x0034 (size: 0x4)
    float HighestRedStability;                                                        // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FBuildingStabilityEnum : public FRowEnum
{
}; // Size: 0x10

struct FBuildingStabilityRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildingTypesEnum : public FRowEnum
{
}; // Size: 0x10

struct FBuildingTypesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FBuildingVariation
{
    FTalentsRowHandle Requirement;                                                    // 0x0000 (size: 0x18)
    FBuildingPiecesRowHandle Piece;                                                   // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FCachedItemStatContainer
{
    FStatContainer StatContainer;                                                     // 0x0000 (size: 0x108)
    bool bHasBuilt;                                                                   // 0x0108 (size: 0x1)
    bool bIsHeldItem;                                                                 // 0x0109 (size: 0x1)
    bool bIncludesAlterations;                                                        // 0x010A (size: 0x1)

}; // Size: 0x110

struct FCargoLandingPadRecord
{
    int32 LeftSlotUID;                                                                // 0x0000 (size: 0x4)
    int32 RightSlotUID;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCaveActorSpawnTimeStamp
{
    FString CaveActorClassName;                                                       // 0x0000 (size: 0x10)
    TArray<float> SpawnTimestamps;                                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCaveLocation
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    TSoftObjectPtr<UCavePrefabAsset> Prefab;                                          // 0x0010 (size: 0x28)

}; // Size: 0x38

struct FCaveSpawnConfig
{
    int32 MinSpawnNumber;                                                             // 0x0000 (size: 0x4)
    int32 MaxSpawnNumber;                                                             // 0x0004 (size: 0x4)
    TArray<FTransform> SpawnPoints;                                                   // 0x0008 (size: 0x10)
    TArray<class AActor*> SpawnedActors;                                              // 0x0018 (size: 0x10)
    TArray<float> DeathTimestamps;                                                    // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FCaveSpawnLoadedData
{
    FString CaveActorClassName;                                                       // 0x0000 (size: 0x10)
    TArray<float> TimeStamps;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FChallenge : public FIcarusTableRowBase
{
    FText ChallengeName;                                                              // 0x0018 (size: 0x18)
    FText ChallengeDescription;                                                       // 0x0030 (size: 0x18)
    EChallengeTypes Type;                                                             // 0x0048 (size: 0x1)
    int32 RequiredCount;                                                              // 0x004C (size: 0x4)
    FGameplayTagContainer OptionalRequiredTags;                                       // 0x0050 (size: 0x20)

}; // Size: 0x70

struct FChallengesEnum : public FRowEnum
{
}; // Size: 0x10

struct FChallengesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCharacterCosmeticsRecorder
{
    FString Customization_Head;                                                       // 0x0000 (size: 0x10)
    FString Customization_Hair;                                                       // 0x0010 (size: 0x10)
    FString Customization_HairColor;                                                  // 0x0020 (size: 0x10)
    FString Customization_Body;                                                       // 0x0030 (size: 0x10)
    FString Customization_BodyColor;                                                  // 0x0040 (size: 0x10)
    FString Customization_SkinTone;                                                   // 0x0050 (size: 0x10)
    FString Customization_HeadTattoo;                                                 // 0x0060 (size: 0x10)
    FString Customization_HeadScar;                                                   // 0x0070 (size: 0x10)
    FString Customization_HeadFacialHair;                                             // 0x0080 (size: 0x10)
    FString Customization_CapLogo;                                                    // 0x0090 (size: 0x10)
    bool IsMale;                                                                      // 0x00A0 (size: 0x1)
    FString Customization_Voice;                                                      // 0x00A8 (size: 0x10)
    FString Customization_EyeColor;                                                   // 0x00B8 (size: 0x10)

}; // Size: 0xC8

struct FCharacterCreationData : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    ECharacterOptionCategory Category;                                                // 0x0030 (size: 0x1)
    ECharacterBodyType BodyType;                                                      // 0x0031 (size: 0x1)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0038 (size: 0x28)
    FItemTemplateRowHandle Item;                                                      // 0x0060 (size: 0x18)
    TArray<FColor> Color;                                                             // 0x0078 (size: 0x10)
    float ScalarParamValue;                                                           // 0x0088 (size: 0x4)
    TSoftObjectPtr<UTexture2D> TextureParamValue;                                     // 0x0090 (size: 0x28)
    TMap<class TSoftObjectPtr<UMaterialInterface>, class TSoftObjectPtr<UMaterialInterface>> MaterialOverrides; // 0x00B8 (size: 0x50)
    bool bEnabled;                                                                    // 0x0108 (size: 0x1)
    FDLCPackageDataRowHandle RequiredPackageID;                                       // 0x010C (size: 0x18)

}; // Size: 0x128

struct FCharacterCreationDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FCharacterCreationDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCharacterFlag : public FIcarusTableRowBase
{
    FText Description;                                                                // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FCharacterFlagsEnum : public FRowEnum
{
}; // Size: 0x10

struct FCharacterFlagsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCharacterGrowth : public FIcarusTableRowBase
{
    class UCurveFloat* ExperienceCurve;                                               // 0x0018 (size: 0x8)
    class UCurveFloat* AttributeCurve;                                                // 0x0020 (size: 0x8)
    class UCurveFloat* BlueprintPointsPerLevel;                                       // 0x0028 (size: 0x8)
    class UCurveFloat* TalentPointsPerLevel;                                          // 0x0030 (size: 0x8)
    class UCurveFloat* SoloPointsPerLevel;                                            // 0x0038 (size: 0x8)
    int32 MaxDisplayLevel;                                                            // 0x0040 (size: 0x4)
    int32 MaxLevel;                                                                   // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FCharacterGrowthEnum : public FRowEnum
{
}; // Size: 0x10

struct FCharacterGrowthRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCharacterPerk : public FIcarusTableRowBase
{
    FText Name;                                                                       // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0048 (size: 0x28)
    ECharacterAttribute Attribute;                                                    // 0x0070 (size: 0x1)
    int32 RequiredAttributeLevel;                                                     // 0x0074 (size: 0x4)
    TMap<FStatsEnum, int32> StatsGranted;                                             // 0x0078 (size: 0x50)

}; // Size: 0xC8

struct FCharacterPerksEnum : public FRowEnum
{
}; // Size: 0x10

struct FCharacterPerksRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCharacterStartingStatsEnum : public FRowEnum
{
}; // Size: 0x10

struct FCharacterStartingStatsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCharacterTimeline : public FIcarusTableRowBase
{
    int32 Level;                                                                      // 0x0018 (size: 0x4)
    TSoftObjectPtr<UTexture2D> Image;                                                 // 0x0020 (size: 0x28)
    TArray<FTimelineRanksRowHandle> TimelineRanks;                                    // 0x0048 (size: 0x10)
    bool FeatureLocked;                                                               // 0x0058 (size: 0x1)

}; // Size: 0x60

struct FCharacterTimelineEnum : public FRowEnum
{
}; // Size: 0x10

struct FCharacterTimelineRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCharacterVoiceData : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    EGlobalPlayerCharacterVoiceFMODParam VoiceFMODParam;                              // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FCharacterVoicesEnum : public FRowEnum
{
}; // Size: 0x10

struct FCharacterVoicesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FChargedModifiers : public FIcarusTableRowBase
{
    FModifierStatesRowHandle Modifier;                                                // 0x0018 (size: 0x18)
    FIcarusResourcesEnum Resource;                                                    // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FChargedModifiersEnum : public FRowEnum
{
}; // Size: 0x10

struct FChargedModifiersRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FChildDNA
{
    TArray<FCreatureGenetics> Genetics;                                               // 0x0000 (size: 0x10)
    ECreatureSex Sex;                                                                 // 0x0010 (size: 0x1)
    FGeneticLineagesRowHandle Lineage;                                                // 0x0014 (size: 0x18)
    int32 UniqueVariation;                                                            // 0x002C (size: 0x4)
    FString Mother;                                                                   // 0x0030 (size: 0x10)
    FString Father;                                                                   // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FChildDNASaveData
{
    TArray<FMountGeneticsSaveData> Genetics;                                          // 0x0000 (size: 0x10)
    int32 Sex;                                                                        // 0x0010 (size: 0x4)
    int32 UniqueVariation;                                                            // 0x0014 (size: 0x4)
    FName LineageName;                                                                // 0x0018 (size: 0x8)
    FString MotherName;                                                               // 0x0020 (size: 0x10)
    FString FatherName;                                                               // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FClientResourceComponentValues
{
    int32 StorageFlowRate;                                                            // 0x0000 (size: 0x4)
    uint32 ConnectionPriorityMask;                                                    // 0x0004 (size: 0x4)
    TArray<FClientResourceNetworkComponentValues> ResourceValues;                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FClientResourceNetworkComponentValues
{
    FIcarusResourcesEnum ResourceType;                                                // 0x0000 (size: 0x10)
    int32 CurrentFlowRate;                                                            // 0x0010 (size: 0x4)
    int32 DesiredFlowRate;                                                            // 0x0014 (size: 0x4)
    int32 BrownOutStrength;                                                           // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FCollectableNote : public FIcarusTableRowBase
{
    FItemableRowHandle Item;                                                          // 0x0018 (size: 0x18)
    FText Text;                                                                       // 0x0030 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Image;                                                 // 0x0048 (size: 0x28)
    FDialogueRowHandle Dialogue;                                                      // 0x0070 (size: 0x18)

}; // Size: 0x88

struct FCollectableNotesEnum : public FRowEnum
{
}; // Size: 0x10

struct FCollectableNotesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCombustibleData : public FIcarusTableRowBase
{
    int32 MillijoulesProvided;                                                        // 0x0018 (size: 0x4)
    FItemTemplateRowHandle ProducesItem;                                              // 0x001C (size: 0x18)
    FName DescriptionText;                                                            // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FCombustibleEnum : public FRowEnum
{
}; // Size: 0x10

struct FCombustibleRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCompactNetworkDeviceData
{
    FName DeviceNameRowName;                                                          // 0x0000 (size: 0x8)
    int32 NumPriority;                                                                // 0x0008 (size: 0x4)
    int32 NumOn;                                                                      // 0x000C (size: 0x4)
    int32 NumIdle;                                                                    // 0x0010 (size: 0x4)
    int32 NumOff;                                                                     // 0x0014 (size: 0x4)
    int32 TotalCurrentFlow;                                                           // 0x0018 (size: 0x4)
    int32 TotalMaxFlow;                                                               // 0x001C (size: 0x4)
    TArray<FNetworkDeviceInstanceData> InstanceData;                                  // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCompactNetworkStorageDeviceData
{
    class AIcarusActor* IcarusActor;                                                  // 0x0000 (size: 0x8)
    EDeviceState DeviceState;                                                         // 0x0008 (size: 0x1)
    int32 FlowRateCurrent;                                                            // 0x000C (size: 0x4)
    int32 FlowRateMax;                                                                // 0x0010 (size: 0x4)
    int32 StorageValueCurrent;                                                        // 0x0014 (size: 0x4)
    int32 StorageValueMax;                                                            // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FConfirmationPopupDetails
{
    FText Description;                                                                // 0x0000 (size: 0x18)
    FText OptionA;                                                                    // 0x0018 (size: 0x18)
    FText OptionB;                                                                    // 0x0030 (size: 0x18)
    class UFMODEvent* OptionAAudioOverride;                                           // 0x0048 (size: 0x8)
    class UFMODEvent* OptionBAudioOverride;                                           // 0x0050 (size: 0x8)
    class UUserWidget* ContentWidget;                                                 // 0x0058 (size: 0x8)
    TSubclassOf<class UUserWidget> ContentWidgetClass;                                // 0x0060 (size: 0x8)
    class UTexture2D* OptionAIcon;                                                    // 0x0068 (size: 0x8)
    class UTexture2D* OptionBIcon;                                                    // 0x0070 (size: 0x8)
    FLinearColor OptionATint;                                                         // 0x0078 (size: 0x10)
    FLinearColor OptionBTint;                                                         // 0x0088 (size: 0x10)

}; // Size: 0x98

struct FConnectedNetworkData
{
    FIcarusResourcesEnum NetworkType;                                                 // 0x0000 (size: 0x10)
    int32 NetworkId;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FConnectedPlayer
{
    FPlayerCharacterID PlayerCharacterID;                                             // 0x0000 (size: 0x18)
    class AIcarusPlayerController* PlayerController;                                  // 0x0018 (size: 0x8)
    class AIcarusPlayerCharacter* PlayerCharacter;                                    // 0x0020 (size: 0x8)
    class AIcarusPlayerState* PlayerState;                                            // 0x0028 (size: 0x8)
    float ConnectionStartTime;                                                        // 0x0030 (size: 0x4)
    float ConnectionCompleteTime;                                                     // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FConsumableData : public FIcarusTableRowBase
{
    TMap<FStatsEnum, int32> Stats;                                                    // 0x0018 (size: 0x50)
    FModifier Modifier;                                                               // 0x0068 (size: 0x20)
    FName DescriptionText;                                                            // 0x0088 (size: 0x8)
    TArray<FItemTemplateRowHandle> Byproducts;                                        // 0x0090 (size: 0x10)

}; // Size: 0xA0

struct FConsumableEnum : public FRowEnum
{
}; // Size: 0x10

struct FConsumableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FContextMenuGroupType : public FIcarusTableRowBase
{
    FText GroupName;                                                                  // 0x0018 (size: 0x18)
    class UTexture2D* GroupIcon;                                                      // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FContextMenuGroupTypesEnum : public FRowEnum
{
}; // Size: 0x10

struct FContextMenuGroupTypesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FContextMenuItemData
{
    FName ItemIdentifier;                                                             // 0x0000 (size: 0x8)
    int32 ItemPayload;                                                                // 0x0008 (size: 0x4)
    FContextMenuGroupTypesRowHandle GroupType;                                        // 0x000C (size: 0x18)
    FText Label;                                                                      // 0x0028 (size: 0x18)
    int32 StackCount;                                                                 // 0x0040 (size: 0x4)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0048 (size: 0x28)
    bool bEnabled;                                                                    // 0x0070 (size: 0x1)
    FFeatureLevelsRowHandle FeatureLevel;                                             // 0x0074 (size: 0x18)
    FContextMenuItemDataItemClickedDelegate ItemClickedDelegate;                      // 0x008C (size: 0x10)
    void ContextMenuItemClickedDelegate(FName ItemIdentifier, int32 ItemPayload);
    TArray<class UWidget*> ContextWidgets;                                            // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FCraftingAudioData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFMODEvent> RecipeCraftedSound;                                    // 0x0018 (size: 0x28)
    TMap<class FProcessingRowHandle, class TSoftObjectPtr<UFMODEvent>> ProcessorOverrideSounds; // 0x0040 (size: 0x50)
    bool bOnlyPlayForLastItemInQueue;                                                 // 0x0090 (size: 0x1)

}; // Size: 0x98

struct FCraftingAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FCraftingAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCraftingInput
{
    FItemsStaticRowHandle Element;                                                    // 0x0000 (size: 0x18)
    int32 Count;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FCraftingModifications : public FIcarusTableRowBase
{
    FTagQueriesRowHandle Query;                                                       // 0x0018 (size: 0x18)
    FStatsEnum StatRequirement;                                                       // 0x0030 (size: 0x10)
    TArray<FAlterationsEnum> StatGrantedAlteration;                                   // 0x0040 (size: 0x10)
    FResourceRequirement ResourceRequirement;                                         // 0x0050 (size: 0x18)
    FAlterationsEnum ResourceGrantedAlteration;                                       // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FCraftingModificationsEnum : public FRowEnum
{
}; // Size: 0x10

struct FCraftingModificationsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCraftingOutput
{
    FItemTemplateRowHandle Element;                                                   // 0x0000 (size: 0x18)
    int32 Count;                                                                      // 0x0018 (size: 0x4)
    TArray<FItemDynamicData> DynamicProperties;                                       // 0x0020 (size: 0x10)
    TArray<FAlterationsRowHandle> Alterations;                                        // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FCraftingTag : public FIcarusTableRowBase
{
    FText TagName;                                                                    // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> TagIcon;                                               // 0x0030 (size: 0x28)
    FTagQueriesRowHandle Query;                                                       // 0x0058 (size: 0x18)

}; // Size: 0x70

struct FCraftingTagsEnum : public FRowEnum
{
}; // Size: 0x10

struct FCraftingTagsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCreatureAudioThreatData : public FIcarusTableRowBase
{
    TMap<class ECreatureAudioThreatTargetType, class FCreatureAudioThreatSetting> ThreatSettings; // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FCreatureAudioThreatDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FCreatureAudioThreatDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCreatureAudioThreatSetting
{
    class UCurveFloat* DistanceModifierCurve;                                         // 0x0000 (size: 0x8)
    float GracePeriod;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FCreatureGenetics
{
    FGeneticValuesRowHandle GeneticValue;                                             // 0x0000 (size: 0x18)
    int32 Value;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FCritialHitTarget
{
    float TimeScale;                                                                  // 0x0000 (size: 0x4)
    float TimeLength;                                                                 // 0x0004 (size: 0x4)
    float FOV;                                                                        // 0x0008 (size: 0x4)
    float RotationOffset;                                                             // 0x000C (size: 0x4)
    FVector PivotOffset;                                                              // 0x0010 (size: 0xC)
    FVector CameraOffset;                                                             // 0x001C (size: 0xC)
    FRotator CameraRotationOffset;                                                    // 0x0028 (size: 0xC)

}; // Size: 0x34

struct FCriticalHitArea : public FIcarusTableRowBase
{
    FStatsEnum DamageReductionStat;                                                   // 0x0018 (size: 0x10)
    FStatsEnum DamageReductionMitigatingStat;                                         // 0x0028 (size: 0x10)
    FStatsEnum DamageMultiplierStat;                                                  // 0x0038 (size: 0x10)
    float ReductionStatMultiplier;                                                    // 0x0048 (size: 0x4)
    float MultiplierStatMultiplier;                                                   // 0x004C (size: 0x4)
    TArray<EIcarusDamageType> WhitelistedDamageTypes;                                 // 0x0050 (size: 0x10)
    TArray<FModifierStatesRowHandle> ModifiersToApply;                                // 0x0060 (size: 0x10)
    int32 Priority;                                                                   // 0x0070 (size: 0x4)
    FCriticalHitAreaAudioDataRowHandle AudioData;                                     // 0x0074 (size: 0x18)

}; // Size: 0x90

struct FCriticalHitAreaAudioData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFMODEvent> PlayerFeedbackSound;                                   // 0x0018 (size: 0x28)
    bool bShouldCritZoneSuppressHitAudio;                                             // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FCriticalHitAreaAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FCriticalHitAreaAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCriticalHitAreasEnum : public FRowEnum
{
}; // Size: 0x10

struct FCriticalHitAreasRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCriticalHitLocation
{
    FName BoneName;                                                                   // 0x0000 (size: 0x8)
    bool AffectsChildren;                                                             // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FCriticalHitPlayer
{
    float TimeScale;                                                                  // 0x0000 (size: 0x4)
    float TimeLength;                                                                 // 0x0004 (size: 0x4)
    float FOV;                                                                        // 0x0008 (size: 0x4)
    float RotationOffset;                                                             // 0x000C (size: 0x4)
    FVector PivotOffset;                                                              // 0x0010 (size: 0xC)
    FVector CameraOffset;                                                             // 0x001C (size: 0xC)
    FRotator CameraRotationOffset;                                                    // 0x0028 (size: 0xC)

}; // Size: 0x34

struct FCriticalHitProjectile
{
    float TimeScale;                                                                  // 0x0000 (size: 0x4)
    FVector CameraOffset;                                                             // 0x0004 (size: 0xC)
    FRotator CameraRotationOffset;                                                    // 0x0010 (size: 0xC)
    float FOV;                                                                        // 0x001C (size: 0x4)
    TSubclassOf<class UMatineeCameraShake> CameraShake;                               // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FCriticalHitSetup : public FIcarusTableRowBase
{
    FCriticalHitPlayer PlayerConfig;                                                  // 0x0018 (size: 0x34)
    FCriticalHitProjectile ProjectileConfig;                                          // 0x0050 (size: 0x28)
    FCritialHitTarget TargetConfig;                                                   // 0x0078 (size: 0x34)
    float FinishTime;                                                                 // 0x00AC (size: 0x4)

}; // Size: 0xB0

struct FCriticalHitSetupEnum : public FRowEnum
{
}; // Size: 0x10

struct FCriticalHitSetupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCropRewards
{
    int32 Amount;                                                                     // 0x0000 (size: 0x4)
    FItemsStaticRowHandle ItemType;                                                   // 0x0004 (size: 0x18)

}; // Size: 0x1C

struct FCrudeOilData : public FResourceNetworkData
{
}; // Size: 0x60

struct FCrudeOilEnum : public FRowEnum
{
}; // Size: 0x10

struct FCrudeOilRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCultivationSaveData
{
    FName Seed;                                                                       // 0x0000 (size: 0x8)
    float GrowthTime;                                                                 // 0x0008 (size: 0x4)
    int32 GrowthState;                                                                // 0x000C (size: 0x4)
    bool bWasKilled;                                                                  // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FCurrencyConversion : public FIcarusTableRowBase
{
    FMetaCurrencyRowHandle StartingCurrency;                                          // 0x0018 (size: 0x18)
    int32 StartingAmount;                                                             // 0x0030 (size: 0x4)
    FMetaCurrencyRowHandle ConvertedCurrency;                                         // 0x0034 (size: 0x18)
    int32 ConvertedAmount;                                                            // 0x004C (size: 0x4)

}; // Size: 0x50

struct FCurrencyConversionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FCurrencyConversionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCustomGameStat : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)
    bool bHidden;                                                                     // 0x0048 (size: 0x1)
    ECustomGameStatCategory Category;                                                 // 0x0049 (size: 0x1)
    ECustomGameStatChangeability StatChangeability;                                   // 0x004A (size: 0x1)
    ECustomGameStatType StatType;                                                     // 0x004B (size: 0x1)
    int32 DefaultValue;                                                               // 0x004C (size: 0x4)
    FStatsRowHandle Stat;                                                             // 0x0050 (size: 0x18)
    int32 MinIntValue;                                                                // 0x0068 (size: 0x4)
    int32 MaxIntValue;                                                                // 0x006C (size: 0x4)
    TArray<FCustomGameStatDropDownOption> DropDownOptions;                            // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FCustomGameStatDropDownOption
{
    FText OptionName;                                                                 // 0x0000 (size: 0x18)
    TArray<FCustomGameStatDropDownValue> StatValues;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCustomGameStatDropDownValue
{
    FStatsRowHandle Stat;                                                             // 0x0000 (size: 0x18)
    int32 Value;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FCustomGameStatsEnum : public FRowEnum
{
}; // Size: 0x10

struct FCustomGameStatsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FCustomProperties
{
    TArray<FIcarusStatReplicated> StaticWorldStats;                                   // 0x0000 (size: 0x10)
    TArray<FIcarusStatReplicated> StaticWorldHeldStats;                               // 0x0010 (size: 0x10)
    TArray<FIcarusStatReplicated> Stats;                                              // 0x0020 (size: 0x10)
    TArray<FAlterationsEnum> Alterations;                                             // 0x0030 (size: 0x10)
    TArray<FLivingItemUpgradeSlot> LivingItemSlots;                                   // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FCustomScaledStat
{
    FBaseStatsEnum Stat;                                                              // 0x0000 (size: 0x10)
    class UCurveFloat* Curve;                                                         // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FDLCPackageData : public FIcarusTableRowBase
{
    int32 PackageID;                                                                  // 0x0018 (size: 0x4)
    FText DLCName;                                                                    // 0x0020 (size: 0x18)
    FString WebsiteAddress;                                                           // 0x0038 (size: 0x10)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0048 (size: 0x28)

}; // Size: 0x70

struct FDLCPackageDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FDLCPackageDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDamageNumberDetail
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    EIcarusDamageType DamageType;                                                     // 0x000C (size: 0x1)
    int32 DamageValue;                                                                // 0x0010 (size: 0x4)
    FCriticalHitAreasEnum CriticalHit;                                                // 0x0018 (size: 0x10)
    TWeakObjectPtr<class AController> Instigator;                                     // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FDamageTypeInfo : public FIcarusTableRowBase
{
    EIcarusDamageType DamageType;                                                     // 0x0018 (size: 0x1)
    FColor Color;                                                                     // 0x001C (size: 0x4)
    FTagQueriesRowHandle RequiredDefenderQuery;                                       // 0x0020 (size: 0x18)
    FStatsEnum DamageStat;                                                            // 0x0038 (size: 0x10)
    FStatsEnum DamageVariationStat;                                                   // 0x0048 (size: 0x10)
    FStatsEnum ResistanceStat;                                                        // 0x0058 (size: 0x10)
    TArray<FDamageTypeInfoModifier> ResistanceOverride;                               // 0x0068 (size: 0x10)
    TArray<FDamageTypeInfoModifier> DefenderMultipliers;                              // 0x0078 (size: 0x10)
    bool bAddStealthMultiplier;                                                       // 0x0088 (size: 0x1)

}; // Size: 0x90

struct FDamageTypeInfoEnum : public FRowEnum
{
}; // Size: 0x10

struct FDamageTypeInfoModifier
{
    FTagQueriesRowHandle Tag;                                                         // 0x0000 (size: 0x18)
    FStatsEnum Stat;                                                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDamageTypeInfoRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDatabaseBuildingData
{
    FName BuildableRowName;                                                           // 0x0000 (size: 0x8)
    FName BuildingItemStaticRowName;                                                  // 0x0008 (size: 0x8)
    TArray<FBuildingInfo> BuildingInstances;                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FDatabaseBuildingGrid
{
    FTransform GridTransform;                                                         // 0x0000 (size: 0x30)
    TArray<FDatabaseBuildingType> BuildingTypes;                                      // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FDatabaseBuildingType
{
    FName BuildableRowName;                                                           // 0x0000 (size: 0x8)
    FName BuildingItemStaticRowName;                                                  // 0x0008 (size: 0x8)
    TArray<FBuildingInstance> BuildingInstances;                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FDecayableData : public FIcarusTableRowBase
{
    int32 DecayTime;                                                                  // 0x0018 (size: 0x4)
    int32 SpoilTime;                                                                  // 0x001C (size: 0x4)
    FItemTemplateRowHandle SpoiledItem;                                               // 0x0020 (size: 0x18)
    int32 ResourceLeakage;                                                            // 0x0038 (size: 0x4)
    bool bEmptyContainer;                                                             // 0x003C (size: 0x1)

}; // Size: 0x40

struct FDecayableEnum : public FRowEnum
{
}; // Size: 0x10

struct FDecayableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDelayedTreeRestore
{
    class UObject* WorldContextObject;                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FDeltaTimeBuffer
{
}; // Size: 0x20

struct FDensityAudioRecordSet
{
    TArray<class UObject*> Records;                                                   // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FDeployableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UDeployableComponent> Behaviour;                                    // 0x0018 (size: 0x28)
    TMap<FStatsEnum, int32> Stats;                                                    // 0x0040 (size: 0x50)
    TArray<FDeployableSetupRowHandle> Variants;                                       // 0x0090 (size: 0x10)
    float AudioOcclusionAmount;                                                       // 0x00A0 (size: 0x4)
    bool EffectedByWeather;                                                           // 0x00A4 (size: 0x1)
    bool bForceShowShelterIcon;                                                       // 0x00A5 (size: 0x1)
    bool bMustBeOutside;                                                              // 0x00A6 (size: 0x1)

}; // Size: 0xA8

struct FDeployableEnum : public FRowEnum
{
}; // Size: 0x10

struct FDeployableRecord
{
    FString FoundationActorClassName;                                                 // 0x0008 (size: 0x10)
    int32 FoundationActorIcarusUID;                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FDeployableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDeployableSetup : public FIcarusTableRowBase
{
    TSoftClassPtr<AIcarusItem> DeployableBlueprint;                                   // 0x0018 (size: 0x28)
    TSoftObjectPtr<UTexture2D> DeployableIcon;                                        // 0x0040 (size: 0x28)
    FText DeployableName;                                                             // 0x0068 (size: 0x18)
    TSoftObjectPtr<UStaticMesh> PreviewStaticMesh;                                    // 0x0080 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> DeployedSound;                                         // 0x00A8 (size: 0x28)
    TMap<class FItemsStaticRowHandle, class TSoftObjectPtr<UFMODEvent>> ItemAddedSounds; // 0x00D0 (size: 0x50)
    float AudioOcclusionAmount;                                                       // 0x0120 (size: 0x4)
    bool SnapToSurfaceNormal;                                                         // 0x0124 (size: 0x1)
    float MaxSurfaceSnapAngle;                                                        // 0x0128 (size: 0x4)
    bool SupportsCustomRotation;                                                      // 0x012C (size: 0x1)
    EWorldPlacementType WorldPlacementType;                                           // 0x012D (size: 0x1)
    bool HideInvalidPlacementPreview;                                                 // 0x012E (size: 0x1)
    EDeployableSnapBehaviour SnapBehaviour;                                           // 0x012F (size: 0x1)
    TArray<FName> SnapActorTags;                                                      // 0x0130 (size: 0x10)
    TArray<FName> SnapSocketsOrTags;                                                  // 0x0140 (size: 0x10)
    bool IgnoreCollisionWhenSnapped;                                                  // 0x0150 (size: 0x1)
    bool UseSnapSocketRotation;                                                       // 0x0151 (size: 0x1)
    bool UseSnapSocketScale;                                                          // 0x0152 (size: 0x1)
    bool bCanAffectNavigation;                                                        // 0x0153 (size: 0x1)
    TSubclassOf<class UNavArea> NavAreaClass;                                         // 0x0158 (size: 0x8)
    FVector NavigationFallbackExtents;                                                // 0x0160 (size: 0xC)
    int32 MaxRestackingAmount;                                                        // 0x016C (size: 0x4)
    FVector DeployCollisionExtentOffset;                                              // 0x0170 (size: 0xC)
    FVector DeployCollisionLocationOffset;                                            // 0x017C (size: 0xC)
    FVector DeployPlacementOffset;                                                    // 0x0188 (size: 0xC)

}; // Size: 0x198

struct FDeployableSetupEnum : public FRowEnum
{
}; // Size: 0x10

struct FDeployableSetupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDeployableTypesEnum : public FRowEnum
{
}; // Size: 0x10

struct FDeployableTypesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDeviceDataRow
{
    int32 RowId;                                                                      // 0x0000 (size: 0x4)
    FText DeviceName;                                                                 // 0x0008 (size: 0x18)
    EDeviceState DeviceState;                                                         // 0x0020 (size: 0x1)
    FText FlowRateText;                                                               // 0x0028 (size: 0x18)
    bool bIsInRate;                                                                   // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FDeviceStorageDelta
{
}; // Size: 0x18

struct FDialogue : public FIcarusTableRowBase
{
    TMap<class EDialogueRedirectCondition, class FDialogueRowHandle> Redirects;       // 0x0018 (size: 0x50)
    TSoftObjectPtr<UFMODEvent> Audio;                                                 // 0x0068 (size: 0x28)
    float AudioLength;                                                                // 0x0090 (size: 0x4)
    float Delay;                                                                      // 0x0094 (size: 0x4)
    int32 Priority;                                                                   // 0x0098 (size: 0x4)
    FDialogueSpeakerRowHandle Speaker;                                                // 0x009C (size: 0x18)
    TArray<FText> Text;                                                               // 0x00B8 (size: 0x10)
    bool bUseSubtitleOverrides;                                                       // 0x00C8 (size: 0x1)
    TArray<FDialogueSubtitleOverride> SubtitleOverrides;                              // 0x00D0 (size: 0x10)

}; // Size: 0xE0

struct FDialogueEntry
{
    FSessionFlagsEnum Flag;                                                           // 0x0000 (size: 0x10)
    FDialogueRowHandle Dialogue;                                                      // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FDialogueEnum : public FRowEnum
{
}; // Size: 0x10

struct FDialoguePool : public FIcarusTableRowBase
{
    TArray<FDialogueRowHandle> Pool;                                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDialoguePoolEnum : public FRowEnum
{
}; // Size: 0x10

struct FDialoguePoolRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDialogueRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDialogueSpeaker : public FIcarusTableRowBase
{
    FText Speaker;                                                                    // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FDialogueSpeakerEnum : public FRowEnum
{
}; // Size: 0x10

struct FDialogueSpeakerRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDialogueSubtitleOverride
{
    FString ReferenceText;                                                            // 0x0000 (size: 0x10)
    float OverrideLength;                                                             // 0x0010 (size: 0x4)
    FDialogueSpeakerRowHandle SpeakerOverride;                                        // 0x0014 (size: 0x18)

}; // Size: 0x30

struct FDifficultySetup
{
    TArray<FProspectStatsRowHandle> DifficultyStats;                                  // 0x0000 (size: 0x10)
    FProspectForecastRowHandle Forecast;                                              // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FDirtMoundModification : public FIcarusTableRowBase
{
    int32 CropPlotTier;                                                               // 0x0018 (size: 0x4)
    FTagQueriesRowHandle MatchingItemTagQuery;                                        // 0x001C (size: 0x18)
    FModifierStatesRowHandle Modifier;                                                // 0x0034 (size: 0x18)
    int32 ModifierEffectiveness;                                                      // 0x004C (size: 0x4)

}; // Size: 0x50

struct FDirtMoundModificationsEnum : public FRowEnum
{
}; // Size: 0x10

struct FDirtMoundModificationsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDrillSaveData
{
    bool bDrillActive;                                                                // 0x0000 (size: 0x1)
    bool bDrillCanAutoRestart;                                                        // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FDropGroupAttribute
{
    FText AttributeTitle;                                                             // 0x0000 (size: 0x18)
    TSoftObjectPtr<UTexture2D> AttributeIcon;                                         // 0x0018 (size: 0x28)
    FText AttributeQuality;                                                           // 0x0040 (size: 0x18)

}; // Size: 0x58

struct FDropGroupCosmeticData : public FIcarusTableRowBase
{
    FText DropGroupName;                                                              // 0x0018 (size: 0x18)
    FText DropGroupDescription;                                                       // 0x0030 (size: 0x18)
    TSoftObjectPtr<UTexture2D> DropGroupIcon;                                         // 0x0048 (size: 0x28)
    TSoftObjectPtr<UTexture2D> DropGroupBackground;                                   // 0x0070 (size: 0x28)
    bool bVisibleInDropSelectionScreen;                                               // 0x0098 (size: 0x1)
    FTerrainsRowHandle AssociatedTerrain;                                             // 0x009C (size: 0x18)
    int32 DropGroupIndex;                                                             // 0x00B4 (size: 0x4)
    bool bIsRecommended;                                                              // 0x00B8 (size: 0x1)
    EDropTemperature Temperature;                                                     // 0x00B9 (size: 0x1)
    EDropAbundance Food;                                                              // 0x00BA (size: 0x1)
    EDropAbundance Water;                                                             // 0x00BB (size: 0x1)
    EDropAbundance Oxygen;                                                            // 0x00BC (size: 0x1)
    EDropAbundance Wood;                                                              // 0x00BD (size: 0x1)
    EDropAbundance Rock;                                                              // 0x00BE (size: 0x1)
    EDropAbundance Ore;                                                               // 0x00BF (size: 0x1)
    EDropAbundance AggressiveCreatures;                                               // 0x00C0 (size: 0x1)
    EDropAbundance PassiveCreatures;                                                  // 0x00C1 (size: 0x1)

}; // Size: 0xC8

struct FDropGroupData
{
    TArray<FVector> Locations;                                                        // 0x0000 (size: 0x10)
    FString GroupName;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FDropGroupsEnum : public FRowEnum
{
}; // Size: 0x10

struct FDropGroupsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDropShipAction : public FIcarusTableRowBase
{
}; // Size: 0x18

struct FDropShipActionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FDropShipActionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDropShipEvent : public FIcarusTableRowBase
{
    FDropShipActionsRowHandle Action;                                                 // 0x0018 (size: 0x18)
    float TriggerTime;                                                                // 0x0030 (size: 0x4)
    bool Complete;                                                                    // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FDropShipSequence : public FIcarusTableRowBase
{
    TArray<FDropShipEvent> Events;                                                    // 0x0018 (size: 0x10)
    class UCurveFloat* Trajectory;                                                    // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FDropShipSequencesEnum : public FRowEnum
{
}; // Size: 0x10

struct FDropShipSequencesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDurableData : public FIcarusTableRowBase
{
    int32 Max_Durability;                                                             // 0x0018 (size: 0x4)
    bool Destroyed_At_Zero;                                                           // 0x001C (size: 0x1)
    TArray<FRepairData> ItemsForRepair;                                               // 0x0020 (size: 0x10)
    TArray<FRecipeSetsRowHandle> NoRecipe_RequiredRecipeSet;                          // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FDurableEnum : public FRowEnum
{
}; // Size: 0x10

struct FDurableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDynamicQuest : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0048 (size: 0x28)
    FFactionMissionsRowHandle Quest;                                                  // 0x0070 (size: 0x18)
    int32 Weighting;                                                                  // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FDynamicQuestReward : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)
    TArray<FQuestRewardItemEntry> PotentialRewards;                                   // 0x0048 (size: 0x10)
    int32 Weighting;                                                                  // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FDynamicQuestRewardItem : public FIcarusTableRowBase
{
    TArray<FRewardItemEntry> Rewards;                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDynamicQuestRewardItemsEnum : public FRowEnum
{
}; // Size: 0x10

struct FDynamicQuestRewardItemsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDynamicQuestRewardsEnum : public FRowEnum
{
}; // Size: 0x10

struct FDynamicQuestRewardsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FDynamicQuestsEnum : public FRowEnum
{
}; // Size: 0x10

struct FDynamicQuestsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FEdInstancedLevelDetail
{
    FInstancedMapData Data;                                                           // 0x0000 (size: 0x80)
    FString ShortenedName;                                                            // 0x0080 (size: 0x10)
    bool bIsUpdate;                                                                   // 0x0090 (size: 0x1)
    FString LogDetail;                                                                // 0x0098 (size: 0x10)

}; // Size: 0xA8

struct FEnergyData : public FResourceNetworkData
{
}; // Size: 0x60

struct FEnergyEnum : public FRowEnum
{
}; // Size: 0x10

struct FEnergyRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FEnergyTraitRecord
{
    bool bActive;                                                                     // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FEpicCreatures : public FIcarusTableRowBase
{
    TArray<FText> CreatureNames;                                                      // 0x0018 (size: 0x10)
    FAISetupRowHandle AISetup;                                                        // 0x0028 (size: 0x18)
    TMap<FBaseStatsEnum, int32> AdditionalStats;                                      // 0x0040 (size: 0x50)

}; // Size: 0x90

struct FEpicCreaturesEnum : public FRowEnum
{
}; // Size: 0x10

struct FEpicCreaturesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FEquippableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UEquippableModifier> EquippableModifier;                            // 0x0018 (size: 0x28)
    TMap<FStatsEnum, int32> GrantedStats;                                             // 0x0040 (size: 0x50)
    bool bStackedModifiersGiveDiminishingReturns;                                     // 0x0090 (size: 0x1)
    TSoftClassPtr<AActor> GlobalStat_ActorClass;                                      // 0x0098 (size: 0x28)
    TMap<FStatsEnum, int32> GlobalStat_GrantedStats;                                  // 0x00C0 (size: 0x50)
    bool bAppliesInAllInventories;                                                    // 0x0110 (size: 0x1)
    bool bBindToAllInventoryUpdates;                                                  // 0x0111 (size: 0x1)
    bool bPreventReinitialisation;                                                    // 0x0112 (size: 0x1)

}; // Size: 0x118

struct FEquippableEnum : public FRowEnum
{
}; // Size: 0x10

struct FEquippableModifierList
{
    TArray<class UEquippableModifier*> Modifiers;                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FEquippableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FErrorCode : public FIcarusTableRowBase
{
    FText Code;                                                                       // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)
    bool bReportToSentry;                                                             // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FErrorCodesEnum : public FRowEnum
{
}; // Size: 0x10

struct FErrorCodesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FEventCooldownList
{
    TArray<float> Cooldowns;                                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FExistingOutpostData
{
    FString OutpostName;                                                              // 0x0000 (size: 0x10)
    EMissionDifficulty Difficulty;                                                    // 0x0010 (size: 0x1)
    int32 SelectedDropIndex;                                                          // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FExoticSpawn : public FIcarusTableRowBase
{
}; // Size: 0x18

struct FExoticSpawnEnum : public FRowEnum
{
}; // Size: 0x10

struct FExoticSpawnRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FExperienceData : public FIcarusTableRowBase
{
    TMap<class EExperienceSource, class FExperienceInfo> ExperienceEvents;            // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FExperienceEnum : public FRowEnum
{
}; // Size: 0x10

struct FExperienceEvent : public FIcarusTableRowBase
{
    FText EventDescription;                                                           // 0x0018 (size: 0x18)
    bool SharedExperience;                                                            // 0x0030 (size: 0x1)
    int32 ExperienceGranted;                                                          // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FExperienceEventsEnum : public FRowEnum
{
}; // Size: 0x10

struct FExperienceEventsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FExperienceInfo
{
    FExperienceEventsRowHandle ExperienceEvent;                                       // 0x0000 (size: 0x18)
    int32 GainedExperience;                                                           // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FExperienceRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FExportedCurrency
{
    FName CurrencyRewardRow;                                                          // 0x0000 (size: 0x8)
    int32 TotalCurrencyExported;                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FExtensionLimitLimbDefinition
{
    FBoneReference IKLimbBone;                                                        // 0x0000 (size: 0x10)
    FBoneReference FKLimbBone;                                                        // 0x0010 (size: 0x10)
    int32 NumBonesInLimb;                                                             // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FFIshSpawnZoneSetup
{
    FColor Color;                                                                     // 0x0000 (size: 0x4)
    FFishSpawnZonesRowHandle SpawnZone;                                               // 0x0004 (size: 0x18)

}; // Size: 0x1C

struct FFLODActorComponentSaveData
{
    FName TileName;                                                                   // 0x0000 (size: 0x8)
    int32 LevelIndex;                                                                 // 0x0008 (size: 0x4)
    int32 RecordIndex;                                                                // 0x000C (size: 0x4)
    int32 InstanceIndex;                                                              // 0x0010 (size: 0x4)
    bool bSpawnedFromPool;                                                            // 0x0014 (size: 0x1)
    bool bIsReservingInstance;                                                        // 0x0015 (size: 0x1)
    int32 CurrentFLODState;                                                           // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FFLODActorRecordInstance : public FFLODInstanceID
{
    int32 LevelIndex;                                                                 // 0x0010 (size: 0x4)
    FName TileName;                                                                   // 0x0014 (size: 0x8)

}; // Size: 0x1C

struct FFLODDescription : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFoliageType> FoliageType;                                         // 0x0018 (size: 0x28)
    FGameplayTagContainer FoliageTags;                                                // 0x0040 (size: 0x20)
    bool bDisabled;                                                                   // 0x0060 (size: 0x1)
    bool bUseViewTraceInfluence;                                                      // 0x0061 (size: 0x1)
    TSoftClassPtr<AActor> ViewTraceActor;                                             // 0x0068 (size: 0x28)
    FItemTemplateRowHandle ViewTraceActorItemTemplate;                                // 0x0090 (size: 0x18)
    FItemableRowHandle ViewTraceActorItemable;                                        // 0x00A8 (size: 0x18)
    FItemRewardsRowHandle ViewTraceActorItemRewards;                                  // 0x00C0 (size: 0x18)
    bool bViewTraceClientPredictive;                                                  // 0x00D8 (size: 0x1)
    bool bUseDistanceInfluence;                                                       // 0x00D9 (size: 0x1)
    TArray<FFLODDistanceLevelDescription> DistanceLevels;                             // 0x00E0 (size: 0x10)
    bool bIsFlammable;                                                                // 0x00F0 (size: 0x1)
    FFlammableRowHandle Flammable;                                                    // 0x00F4 (size: 0x18)
    FFLODDescriptionsRowHandle BurntFLODEntry;                                        // 0x010C (size: 0x18)
    int32 RecordIndex;                                                                // 0x0124 (size: 0x4)
    TArray<FFLODLevelDescription> Levels;                                             // 0x0128 (size: 0x10)

}; // Size: 0x138

struct FFLODDescriptionDVInfo
{
    TSubclassOf<class UFoliageInstancedStaticMeshComponent> FoliageClass;             // 0x0000 (size: 0x8)
    FName FoliageCollisionProfile;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FFLODDescriptionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FFLODDescriptionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFLODDistanceLevelDescription
{
    TSoftClassPtr<AActor> Actor;                                                      // 0x0000 (size: 0x28)
    float InfluenceDistance;                                                          // 0x0028 (size: 0x4)
    FItemTemplateRowHandle ActorItemTemplate;                                         // 0x002C (size: 0x18)
    FItemRewardsRowHandle ActorItemRewards;                                           // 0x0044 (size: 0x18)

}; // Size: 0x60

struct FFLODInstanceID
{
    TWeakObjectPtr<class AFLODTile> FLODTile;                                         // 0x0000 (size: 0x8)
    int32 RecordIndex;                                                                // 0x0008 (size: 0x4)
    int32 InstanceIndex;                                                              // 0x000C (size: 0x4)

}; // Size: 0x10

struct FFLODInstanceInfluence
{
    FFLODInstanceID InfluencedInstance;                                               // 0x0000 (size: 0x10)
    int32 InfluenceLevelIndex;                                                        // 0x0010 (size: 0x4)
    FTimerHandle TimeoutHandle;                                                       // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FFLODLevelDescription
{
    int32 LevelIndex;                                                                 // 0x0000 (size: 0x4)
    EFLODLevelInfluenceType InfluenceType;                                            // 0x0004 (size: 0x1)
    bool bClientPredictive;                                                           // 0x0005 (size: 0x1)
    float InfluenceDistance;                                                          // 0x0008 (size: 0x4)
    int32 ActorPoolBufferSize;                                                        // 0x000C (size: 0x4)
    TSubclassOf<class AActor> ActorReplacementClass;                                  // 0x0010 (size: 0x8)
    FItemTemplateRowHandle ItemTemplate;                                              // 0x0018 (size: 0x18)
    FItemRewardsRowHandle ItemRewards;                                                // 0x0030 (size: 0x18)

}; // Size: 0x50

struct FFLODRecordDynamicInstance : public FFastArraySerializerItem
{
    int32 InstanceIndex;                                                              // 0x000C (size: 0x4)
    FVector_NetQuantize100 WorldLocation;                                             // 0x0010 (size: 0xC)
    FVector_NetQuantize100 WorldRotation;                                             // 0x001C (size: 0xC)
    FVector_NetQuantize100 WorldScale;                                                // 0x0028 (size: 0xC)

}; // Size: 0x34

struct FFLODRecordDynamicInstanceArray : public FFastArraySerializer
{
    TArray<FFLODRecordDynamicInstance> Instances;                                     // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFLODRecordInstance : public FFastArraySerializerItem
{
    int32 InstanceIndex;                                                              // 0x000C (size: 0x4)
    int32 LevelIndex;                                                                 // 0x0010 (size: 0x4)
    TWeakObjectPtr<class AActor> Actor;                                               // 0x0014 (size: 0x8)
    uint32 AddedFrame;                                                                // 0x001C (size: 0x4)

}; // Size: 0x20

struct FFLODRecordInstanceArray : public FFastArraySerializer
{
    TArray<FFLODRecordInstance> Instances;                                            // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFLODRecordInstanceChange
{
    int32 InstanceIndex;                                                              // 0x0000 (size: 0x4)
    FFLODRecordInstanceChangeDetails From;                                            // 0x0004 (size: 0x10)
    FFLODRecordInstanceChangeDetails To;                                              // 0x0014 (size: 0x10)
    int32 TransitionFrame;                                                            // 0x0024 (size: 0x4)
    int32 TransitionFinishFrame;                                                      // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FFLODRecordInstanceChangeDetails
{
    int32 LevelIndex;                                                                 // 0x0000 (size: 0x4)
    TWeakObjectPtr<class AActor> Actor;                                               // 0x0004 (size: 0x8)
    uint32 AddedFrame;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FFLODRecordInstanceChangeSet
{
    TArray<int32> ConcealIndices;                                                     // 0x0000 (size: 0x10)
    TArray<int32> RevealIndices;                                                      // 0x0010 (size: 0x10)
    TArray<FFLODRecordInstanceChange> InstanceChanges;                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FFLODRecordInstanceIndices
{
    TSet<int32> InstanceIndices;                                                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FFLODRecordPendingInstanceChange
{
    int32 InstanceIndex;                                                              // 0x0000 (size: 0x4)
    int32 FromLevelIndex;                                                             // 0x0004 (size: 0x4)
    int32 ToLevelIndex;                                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFLODRecordStateView : public FFLODRecordInstanceIndices
{
    TArray<FFLODRecordInstance> Instances;                                            // 0x0050 (size: 0x10)
    TArray<FFLODRecordInstanceIndices> LevelStateViews;                               // 0x0060 (size: 0x10)
    TSet<int32> DestroyedIndices;                                                     // 0x0070 (size: 0x50)

}; // Size: 0xC0

struct FFLODRecorderRecord
{
    int32 NumTiles;                                                                   // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FFLODTileRecordRecord
{
    int32 RecordIndex;                                                                // 0x0000 (size: 0x4)
    FName RecorderName;                                                               // 0x0004 (size: 0x8)
    TArray<FFLODTileRecordRecordInstance> Instances;                                  // 0x0010 (size: 0x10)
    TArray<FFLODTileRecordRecordInstanceDynamic> DynamicInstances;                    // 0x0020 (size: 0x10)
    TArray<int32> DestroyedInstanceIndices;                                           // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FFLODTileRecordRecordInstance
{
    int32 InstanceIndex;                                                              // 0x0000 (size: 0x4)
    int32 LevelIndex;                                                                 // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FFLODTileRecordRecordInstanceDynamic
{
    int32 InstanceIndex;                                                              // 0x0000 (size: 0x4)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FFLODTileRecorderRecord
{
    FName TileName;                                                                   // 0x0000 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x30)
    float RelevancyRadius;                                                            // 0x0040 (size: 0x4)
    TArray<FFLODTileRecordRecord> Records;                                            // 0x0048 (size: 0x10)

}; // Size: 0x60

struct FFactionInfo : public FIcarusTableRowBase
{
    class UTexture2D* Icon;                                                           // 0x0018 (size: 0x8)
    FText FactionName;                                                                // 0x0020 (size: 0x18)
    FText Description;                                                                // 0x0038 (size: 0x18)
    FDialoguePoolRowHandle BriefingPool;                                              // 0x0050 (size: 0x18)
    FDialoguePoolRowHandle LandingPool;                                               // 0x0068 (size: 0x18)
    FDialoguePoolRowHandle MissionCompletePool;                                       // 0x0080 (size: 0x18)

}; // Size: 0x98

struct FFactionInfoEnum : public FRowEnum
{
}; // Size: 0x10

struct FFactionInfoRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFactionMission : public FIcarusTableRowBase
{
    TArray<FMissionObjectiveEntry> MissionObjectives;                                 // 0x0018 (size: 0x10)
    FFactionInfoRowHandle Faction;                                                    // 0x0028 (size: 0x18)
    TArray<FMissionTypesRowHandle> Types;                                             // 0x0040 (size: 0x10)
    TArray<FWorkshopCost> CurrencyCost;                                               // 0x0050 (size: 0x10)
    FQuestsRowHandle InitialQuest;                                                    // 0x0060 (size: 0x18)
    bool bUseOpenWorldRetryTimeout;                                                   // 0x0078 (size: 0x1)
    TArray<FRulesetsRowHandle> AdditionalRulesets;                                    // 0x0080 (size: 0x10)
    TArray<FItemTemplateRowHandle> ItemsRewarded;                                     // 0x0090 (size: 0x10)
    TArray<FAccountFlagsRowHandle> AccountFlagsRewarded;                              // 0x00A0 (size: 0x10)
    TArray<FCharacterFlagsRowHandle> CharacterFlagsRewarded;                          // 0x00B0 (size: 0x10)
    TArray<FTalentsRowHandle> TalentsRewarded;                                        // 0x00C0 (size: 0x10)
    TArray<FWorkshopCost> CurrencyRewarded;                                           // 0x00D0 (size: 0x10)
    TArray<FTalentsRowHandle> GreatHuntReward;                                        // 0x00E0 (size: 0x10)
    int32 AccountExperience;                                                          // 0x00F0 (size: 0x4)
    int32 FactionExperience;                                                          // 0x00F4 (size: 0x4)

}; // Size: 0xF8

struct FFactionMissionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FFactionMissionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFarmableData : public FIcarusTableRowBase
{
    TArray<FFarmingSeedsRowHandle> AllowedSeeds;                                      // 0x0018 (size: 0x10)
    int32 NumberOfCultivations;                                                       // 0x0028 (size: 0x4)
    bool bReseedsAfterHarvest;                                                        // 0x002C (size: 0x1)

}; // Size: 0x30

struct FFarmableEnum : public FRowEnum
{
}; // Size: 0x10

struct FFarmableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFarmingGrowthState : public FIcarusTableRowBase
{
    float TimeToNextState;                                                            // 0x0018 (size: 0x4)
    TSoftObjectPtr<UStaticMesh> StageMesh;                                            // 0x0020 (size: 0x28)
    FVector MeshScale;                                                                // 0x0048 (size: 0xC)

}; // Size: 0x58

struct FFarmingGrowthStatesEnum : public FRowEnum
{
}; // Size: 0x10

struct FFarmingGrowthStatesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFarmingSeedAudioData
{
    TSoftObjectPtr<UFMODEvent> PlantedSound;                                          // 0x0000 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> HarvestedSound;                                        // 0x0028 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> ClearedSound;                                          // 0x0050 (size: 0x28)

}; // Size: 0x78

struct FFarmingSeedData : public FIcarusTableRowBase
{
    FItemRewardsRowHandle CropRewards;                                                // 0x0018 (size: 0x18)
    FItemRewardsRowHandle DecayedRewards;                                             // 0x0030 (size: 0x18)
    FFarmingSeedAudioData Audio;                                                      // 0x0048 (size: 0x78)
    TArray<FAtmospheresRowHandle> OptimalBiomes;                                      // 0x00C0 (size: 0x10)
    FFarmingGrowthStatesRowHandle Stage1;                                             // 0x00D0 (size: 0x18)
    FFarmingGrowthStatesRowHandle Stage2;                                             // 0x00E8 (size: 0x18)
    FFarmingGrowthStatesRowHandle Stage3;                                             // 0x0100 (size: 0x18)
    FFarmingGrowthStatesRowHandle Stage4;                                             // 0x0118 (size: 0x18)
    FFarmingGrowthStatesRowHandle Mature;                                             // 0x0130 (size: 0x18)
    FFarmingGrowthStatesRowHandle Decayed;                                            // 0x0148 (size: 0x18)
    FItemableRowHandle Itemable;                                                      // 0x0160 (size: 0x18)
    FDeployableRowHandle Deployable;                                                  // 0x0178 (size: 0x18)
    ECropMeshRotationType RotationType;                                               // 0x0190 (size: 0x1)
    FModifierStatesRowHandle FatigueModifier;                                         // 0x0194 (size: 0x18)
    int32 FatigueIncreaseEachHarvest;                                                 // 0x01AC (size: 0x4)

}; // Size: 0x1B0

struct FFarmingSeedsEnum : public FRowEnum
{
}; // Size: 0x10

struct FFarmingSeedsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFavoriteEntry
{
}; // Size: 0x8

struct FFieldGuideBackButtonItem
{
    FFieldGuideCategoriesRowHandle CategoryRow;                                       // 0x0000 (size: 0x18)
    FItemsStaticRowHandle ItemRow;                                                    // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FFieldGuideCategories : public FIcarusTableRowBase
{
    TSubclassOf<class UFieldGuidePageWidgetBase> IndexView;                           // 0x0018 (size: 0x8)
    TSubclassOf<class UFieldGuidePageWidgetBase> DetailView;                          // 0x0020 (size: 0x8)
    int32 DisplayOrder;                                                               // 0x0028 (size: 0x4)
    FText DisplayName;                                                                // 0x0030 (size: 0x18)
    TSoftObjectPtr<UTexture2D> DisplayIcon;                                           // 0x0048 (size: 0x28)
    FTagQueriesRowHandle TagQuery;                                                    // 0x0070 (size: 0x18)

}; // Size: 0x88

struct FFieldGuideCategoriesEnum : public FRowEnum
{
}; // Size: 0x10

struct FFieldGuideCategoriesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFieldGuideMetaData : public FIcarusTableRowBase
{
    FItemsStaticRowHandle Item;                                                       // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Image1;                                                // 0x0030 (size: 0x28)
    FText Description1;                                                               // 0x0058 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Image2;                                                // 0x0070 (size: 0x28)
    FText Description2;                                                               // 0x0098 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Image3;                                                // 0x00B0 (size: 0x28)
    FText Description3;                                                               // 0x00D8 (size: 0x18)

}; // Size: 0xF0

struct FFieldGuideMetaDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FFieldGuideMetaDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFieldGuideRecipeInfo
{
    TArray<FCraftingInput> CraftingInputsOut;                                         // 0x0000 (size: 0x10)
    TArray<FQueryInput> QueryInputsOut;                                               // 0x0010 (size: 0x10)
    TArray<FItemsStaticRowHandle> CraftedAtOut;                                       // 0x0020 (size: 0x10)
    int32 OutputCount;                                                                // 0x0030 (size: 0x4)
    TArray<FResourceItem> CraftingResourcesRequired;                                  // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FFieldGuideRedirectData : public FIcarusTableRowBase
{
    FItemsStaticRowHandle DisplayItem;                                                // 0x0018 (size: 0x18)
    TArray<FItemsStaticRowHandle> HiddenItems;                                        // 0x0030 (size: 0x10)
    FTagQueriesRowHandle QueryMatchHiddenItem;                                        // 0x0040 (size: 0x18)

}; // Size: 0x58

struct FFieldGuideRedirectEnum : public FRowEnum
{
}; // Size: 0x10

struct FFieldGuideRedirectRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFieldGuideSets : public FIcarusTableRowBase
{
    TArray<FItemsStaticRowHandle> SetItems;                                           // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FFieldGuideSetsEnum : public FRowEnum
{
}; // Size: 0x10

struct FFieldGuideSetsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFillableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UFillableComponent> Behaviour;                                      // 0x0018 (size: 0x28)
    TArray<FIcarusResourcesEnum> ResourceTypes;                                       // 0x0040 (size: 0x10)
    int32 MaximumStoredUnits;                                                         // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FFillableEnum : public FRowEnum
{
}; // Size: 0x10

struct FFillableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFindAllStacksResult
{
    class UInventory* Inventory;                                                      // 0x0000 (size: 0x8)
    int32 InventorySlotIndex;                                                         // 0x0008 (size: 0x4)
    FItemData ItemTypeInstance;                                                       // 0x0010 (size: 0x1F0)
    int32 TotalStacksCount;                                                           // 0x0200 (size: 0x4)

}; // Size: 0x208

struct FFindAuraResult
{
    FModifierStatesRowHandle AuraType;                                                // 0x0000 (size: 0x18)
    class UModifierStateComponent* Component;                                         // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FFindItemSlotInfo
{
    class UInventory* Inventory;                                                      // 0x0000 (size: 0x8)
    int32 Slot;                                                                       // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FFindItemSlotInfoInvType
{
    FInventoryIDEnum InventoryID;                                                     // 0x0000 (size: 0x10)
    int32 Slot;                                                                       // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FFireData
{
    FVector Impulse;                                                                  // 0x0000 (size: 0xC)
    FVector InstigatorVelocity;                                                       // 0x000C (size: 0xC)
    FProjectileFireParams AdvancedParameters;                                         // 0x0018 (size: 0xC)
    class AActor* Instigator;                                                         // 0x0028 (size: 0x8)
    bool bIsDataValid;                                                                // 0x0030 (size: 0x1)
    int32 TimeFired;                                                                  // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FFirearm3PAnimData
{
    TSoftObjectPtr<UAnimSequence> Idle;                                               // 0x0000 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Charge;                                             // 0x0028 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Aim;                                                // 0x0050 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> AimCharge;                                          // 0x0078 (size: 0x28)
    TSoftObjectPtr<UBlendSpace1D> Fire;                                               // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UBlendSpace1D> AimFire;                                            // 0x00C8 (size: 0x28)
    TSoftObjectPtr<UBlendSpace1D> Reload;                                             // 0x00F0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ReloadMontage;                                       // 0x0118 (size: 0x28)

}; // Size: 0x140

struct FFirearm3PNewAnimData
{
    TSoftObjectPtr<UAnimSequence> Poses;                                              // 0x0000 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Run;                                                // 0x0028 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Sprint;                                             // 0x0050 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Impulse;                                            // 0x0078 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Aim_Sweep;                                          // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Crouch_Aim_Sweep;                                   // 0x00C8 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> Reload;                                              // 0x00F0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> Fire;                                                // 0x0118 (size: 0x28)

}; // Size: 0x140

struct FFirearmAnimData
{
    TSoftObjectPtr<UAnimSequence> Idle;                                               // 0x0000 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Charge;                                             // 0x0028 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> Aim;                                                // 0x0050 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> AimCharge;                                          // 0x0078 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> Fire;                                                // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> AimFire;                                             // 0x00C8 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> Reload;                                              // 0x00F0 (size: 0x28)

}; // Size: 0x118

struct FFirearmAudioData : public FIcarusTableRowBase
{
    TArray<FFirearmSoundData> FireSounds;                                             // 0x0018 (size: 0x10)
    TArray<FFirearmSoundData> PersistentSounds;                                       // 0x0028 (size: 0x10)
    TArray<FFirearmSoundData> NoFireSounds;                                           // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FFirearmAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FFirearmAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFirearmChargeData
{
    bool bCanCharge;                                                                  // 0x0000 (size: 0x1)
    float ChargeSpeed;                                                                // 0x0004 (size: 0x4)
    float UnchargeSpeed;                                                              // 0x0008 (size: 0x4)
    float MinimumChargeRequired;                                                      // 0x000C (size: 0x4)
    bool bFireCanCharge;                                                              // 0x0010 (size: 0x1)
    bool bAimCanCharge;                                                               // 0x0011 (size: 0x1)
    bool bReloadCanCancel;                                                            // 0x0012 (size: 0x1)
    class UCurveFloat* LaunchForceMultiplier;                                         // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FFirearmData : public FIcarusTableRowBase
{
    FVector2D HipAccuracy;                                                            // 0x0018 (size: 0x8)
    FVector2D AimAccuracy;                                                            // 0x0020 (size: 0x8)
    int32 LaunchForce;                                                                // 0x0028 (size: 0x4)
    FFirearmChargeData ChargeData;                                                    // 0x0030 (size: 0x20)
    FFirearmVisualData VisualData;                                                    // 0x0050 (size: 0x538)
    FFirearmStaminaData StaminaData;                                                  // 0x0588 (size: 0x8)
    FVector2D RecoilAmount;                                                           // 0x0590 (size: 0x8)
    float DamageMultiplier;                                                           // 0x0598 (size: 0x4)
    TArray<EFireMode> FireModes;                                                      // 0x05A0 (size: 0x10)
    EReloadType ReloadType;                                                           // 0x05B0 (size: 0x1)
    FValidAmmoTypesRowHandle ValidAmmoTypes;                                          // 0x05B4 (size: 0x18)
    bool bUnlimitedAmmo;                                                              // 0x05CC (size: 0x1)
    int32 AmmoCapacity;                                                               // 0x05D0 (size: 0x4)
    int32 RoundsPerMinute;                                                            // 0x05D4 (size: 0x4)
    float ReloadTime;                                                                 // 0x05D8 (size: 0x4)
    TMap<FStatsEnum, int32> Stats;                                                    // 0x05E0 (size: 0x50)
    FFirearmAudioDataRowHandle AudioData;                                             // 0x0630 (size: 0x18)
    float WeaponLoudness;                                                             // 0x0648 (size: 0x4)
    FFirearmScopeDataRowHandle ScopeRow;                                              // 0x064C (size: 0x18)

}; // Size: 0x668

struct FFirearmDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FFirearmDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFirearmScopeData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UTexture> ScopeTexture;                                            // 0x0018 (size: 0x28)
    int32 TargetFOV;                                                                  // 0x0040 (size: 0x4)
    float ScopeTime;                                                                  // 0x0044 (size: 0x4)
    FVector FirstPersonADSOffset;                                                     // 0x0048 (size: 0xC)

}; // Size: 0x58

struct FFirearmScopeDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FFirearmScopeDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFirearmSoundData
{
    TSoftObjectPtr<UFMODEvent> Event;                                                 // 0x0000 (size: 0x28)
    FName AttachPoint;                                                                // 0x0028 (size: 0x8)
    bool bUseChargeParameter;                                                         // 0x0030 (size: 0x1)
    bool bUseChargingParameter;                                                       // 0x0031 (size: 0x1)
    bool bUseAmmoCountParameter;                                                      // 0x0032 (size: 0x1)
    bool bUseReloadingParameter;                                                      // 0x0033 (size: 0x1)
    bool bUseAimingParameter;                                                         // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FFirearmStaminaData
{
    int32 StaminaChargeCost;                                                          // 0x0000 (size: 0x4)
    int32 StaminaChargeHoldCost;                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FFirearmVisualData
{
    bool bUsesPreviewItem;                                                            // 0x0000 (size: 0x1)
    EFirearmAttachType PreviewItemAttachType;                                         // 0x0001 (size: 0x1)
    FName PreviewItemAttachSocket1P;                                                  // 0x0004 (size: 0x8)
    FName PreviewItemAttachSocket3P;                                                  // 0x000C (size: 0x8)
    TSubclassOf<class UMatineeCameraShake> FireShake;                                 // 0x0018 (size: 0x8)
    bool bFireShakeHold;                                                              // 0x0020 (size: 0x1)
    float FireShakeScale;                                                             // 0x0024 (size: 0x4)
    float FireShakeAimScale;                                                          // 0x0028 (size: 0x4)
    float FireShakeCrouchScale;                                                       // 0x002C (size: 0x4)
    TSubclassOf<class UMatineeCameraShake> ChargeShake;                               // 0x0030 (size: 0x8)
    float ChargeShakeScale;                                                           // 0x0038 (size: 0x4)
    float ChargeShakeAimScale;                                                        // 0x003C (size: 0x4)
    float ChargeShakeCrouchScale;                                                     // 0x0040 (size: 0x4)
    float ChargeShakeStartDelay;                                                      // 0x0044 (size: 0x4)
    float ChargeShakeApplyDelay;                                                      // 0x0048 (size: 0x4)
    float ChargeShakeAccuracyMultiplier;                                              // 0x004C (size: 0x4)
    TSoftObjectPtr<UFXSystemAsset> FireParticle;                                      // 0x0050 (size: 0x28)
    float VisualRecoil;                                                               // 0x0078 (size: 0x4)
    float IdleFOVMultiplier;                                                          // 0x007C (size: 0x4)
    float AimFOVMultiplier;                                                           // 0x0080 (size: 0x4)
    float ChargeFOVMultiplier;                                                        // 0x0084 (size: 0x4)
    FFirearmAnimData SkeletalItemAnimData;                                            // 0x0088 (size: 0x118)
    FFirearmAnimData FirstPersonAnimData;                                             // 0x01A0 (size: 0x118)
    FFirearm3PAnimData ThirdPersonAnimData;                                           // 0x02B8 (size: 0x140)
    FFirearm3PNewAnimData NewThirdPersonAnimData;                                     // 0x03F8 (size: 0x140)

}; // Size: 0x538

struct FFiredProjectileInfo
{
    FTransform SpawnTransform;                                                        // 0x0000 (size: 0x30)
    float SpawnTimeInGameSeconds;                                                     // 0x0030 (size: 0x4)
    TWeakObjectPtr<class AIcarusItem> Projectile;                                     // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FFishBoardRecord
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    FString Fish;                                                                     // 0x0020 (size: 0x10)
    int32 Value;                                                                      // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FFishCategory
{
    TMap<class EFishRarity, class FFishRarity> Rarity;                                // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FFishData : public FIcarusTableRowBase
{
    FItemTemplateRowHandle Fish;                                                      // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Image;                                                 // 0x0030 (size: 0x28)
    FText Lore;                                                                       // 0x0058 (size: 0x18)
    EFishRarity Rarity;                                                               // 0x0070 (size: 0x1)
    EFishType Type;                                                                   // 0x0071 (size: 0x1)
    TArray<FTerrainsRowHandle> Maps;                                                  // 0x0078 (size: 0x10)
    TArray<FBiomesEnum> Biomes;                                                       // 0x0088 (size: 0x10)
    int32 MinWeight;                                                                  // 0x0098 (size: 0x4)
    int32 MaxWeight;                                                                  // 0x009C (size: 0x4)
    int32 MinLength;                                                                  // 0x00A0 (size: 0x4)
    int32 MaxLength;                                                                  // 0x00A4 (size: 0x4)
    TArray<FItemsStaticRowHandle> Lures;                                              // 0x00A8 (size: 0x10)
    FStatsEnum CaptureStat;                                                           // 0x00B8 (size: 0x10)

}; // Size: 0xC8

struct FFishDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FFishDataFastArray : public FFastArraySerializer
{
    TArray<FFishDataFastArrayItem> FishEntries;                                       // 0x0108 (size: 0x10)

}; // Size: 0x158

struct FFishDataFastArrayItem : public FFastArraySerializerItem
{
    FFishDataRowHandle FishRow;                                                       // 0x000C (size: 0x18)
    int32 MaxQuality;                                                                 // 0x0024 (size: 0x4)
    int32 MaxWeight;                                                                  // 0x0028 (size: 0x4)
    int32 MaxLength;                                                                  // 0x002C (size: 0x4)
    int32 CaughtCount;                                                                // 0x0030 (size: 0x4)

}; // Size: 0x34

struct FFishDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFishRarity
{
    TArray<FFishDataRowHandle> Fish;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFishSetup : public FIcarusTableRowBase
{
    TSoftClassPtr<AFishActor> FishActor;                                              // 0x0018 (size: 0x28)
    float MovementSpeed;                                                              // 0x0040 (size: 0x4)
    FVector2D SizeRange;                                                              // 0x0044 (size: 0x8)
    FItemRewardsRowHandle ItemReward;                                                 // 0x004C (size: 0x18)
    bool bAwarenessEnabled;                                                           // 0x0064 (size: 0x1)
    float AwarenessMovementSpeed;                                                     // 0x0068 (size: 0x4)
    float MaxAwarenessDistance;                                                       // 0x006C (size: 0x4)
    bool bAggressive;                                                                 // 0x0070 (size: 0x1)
    float AttackDamage;                                                               // 0x0074 (size: 0x4)
    TSoftObjectPtr<UFMODEvent> MovementSound;                                         // 0x0078 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> AttackSound;                                           // 0x00A0 (size: 0x28)

}; // Size: 0xC8

struct FFishSetupEnum : public FRowEnum
{
}; // Size: 0x10

struct FFishSetupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFishSpawnConfig : public FIcarusTableRowBase
{
    TSoftObjectPtr<UGameplayTexture> SpawnMap;                                        // 0x0018 (size: 0x28)
    TArray<FFIshSpawnZoneSetup> SpawnZones;                                           // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FFishSpawnConfigEnum : public FRowEnum
{
}; // Size: 0x10

struct FFishSpawnConfigRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFishSpawnZones : public FIcarusTableRowBase
{
    TMap<FFishDataEnum, int32> SpawnList;                                             // 0x0018 (size: 0x50)
    float ZoneFishQuality;                                                            // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FFishSpawnZonesEnum : public FRowEnum
{
}; // Size: 0x10

struct FFishSpawnZonesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFishTypeTracking
{
    FFishDataRowHandle FishRow;                                                       // 0x0000 (size: 0x18)
    int32 MaxQuality;                                                                 // 0x0018 (size: 0x4)
    int32 MaxWeight;                                                                  // 0x001C (size: 0x4)
    int32 MaxLength;                                                                  // 0x0020 (size: 0x4)
    int32 CaughtCount;                                                                // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FFlagsMultiRowHandle : public FMultiRowHandle
{
    EFlagsTableType DataTableName;                                                    // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FFlammableAudioData
{
    float Weighting;                                                                  // 0x0000 (size: 0x4)
    EFlammableAudioLocationType LocationType;                                         // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FFlammableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UFlammableComponent> Behaviour;                                     // 0x0018 (size: 0x28)
    FFlammableAudioData AudioData;                                                    // 0x0040 (size: 0x8)
    float CombustionFuelDensity;                                                      // 0x0048 (size: 0x4)
    float CombustionFuelDensityVariance;                                              // 0x004C (size: 0x4)
    bool bInfiniteCombustionFuel;                                                     // 0x0050 (size: 0x1)
    float ThermalConductivity;                                                        // 0x0054 (size: 0x4)
    float HeatCapacity;                                                               // 0x0058 (size: 0x4)
    float SurfaceAreaMultiplier;                                                      // 0x005C (size: 0x4)
    FVector CombustingBoundsScale;                                                    // 0x0060 (size: 0xC)
    float HeatOfCombustion;                                                           // 0x006C (size: 0x4)
    float HeatReleaseRate;                                                            // 0x0070 (size: 0x4)
    bool bDetachAfterCombusted;                                                       // 0x0074 (size: 0x1)
    float MinCombustionTemperature;                                                   // 0x0078 (size: 0x4)
    float MaxCombustionTemperature;                                                   // 0x007C (size: 0x4)
    bool bAffectsTemperature;                                                         // 0x0080 (size: 0x1)
    float TemperatureFalloffStrength;                                                 // 0x0084 (size: 0x4)

}; // Size: 0x88

struct FFlammableEnum : public FRowEnum
{
}; // Size: 0x10

struct FFlammableFISMVQueuedVisualData
{
    bool bFISMDirty;                                                                  // 0x0000 (size: 0x1)
    bool bEffectsMeshDirty;                                                           // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FFlammableFISMVisualData
{
    float MainFireSpread;                                                             // 0x0000 (size: 0x4)
    float MainFireTemperature;                                                        // 0x0004 (size: 0x4)
    float EffectsMeshFireSpread;                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFlammableRepState : public FFastArraySerializerItem
{
    EFlammableState FlammableState;                                                   // 0x000C (size: 0x1)
    float DesiredTemperature;                                                         // 0x0010 (size: 0x4)
    int32 InstanceIndex;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FFlammableRepStateArray : public FFastArraySerializer
{
    TArray<FFlammableRepState> States;                                                // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFlammableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFlammableTarget
{
    class AActor* Actor;                                                              // 0x0000 (size: 0x8)
    class UFLODFISMComponent* FISM;                                                   // 0x0008 (size: 0x8)
    int32 FISMInstanceIndex;                                                          // 0x0010 (size: 0x4)
    class AActor* Causer;                                                             // 0x0018 (size: 0x8)

}; // Size: 0x28

struct FFlammableTargetExtinguish : public FFlammableTarget
{
    float ExtinguishRampTime;                                                         // 0x0028 (size: 0x4)
    float ExtinguishTime;                                                             // 0x002C (size: 0x4)
    bool bStopCombustionImmediately;                                                  // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FFlammableTargetIgnite : public FFlammableTarget
{
    float DesiredTemperatureValue;                                                    // 0x0028 (size: 0x4)
    bool bFromPropagation;                                                            // 0x002C (size: 0x1)

}; // Size: 0x30

struct FFloatableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UFloatableComponent> Behaviour;                                     // 0x0018 (size: 0x28)
    float MeshDensity;                                                                // 0x0040 (size: 0x4)
    float FluidDensity;                                                               // 0x0044 (size: 0x4)
    float FluidLinearDamping;                                                         // 0x0048 (size: 0x4)
    float FluidAngularDamping;                                                        // 0x004C (size: 0x4)
    bool bClampMaxVelocity;                                                           // 0x0050 (size: 0x1)
    float MaxUnderwaterVelocity;                                                      // 0x0054 (size: 0x4)

}; // Size: 0x58

struct FFloatableEnum : public FRowEnum
{
}; // Size: 0x10

struct FFloatableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFocusableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UFocusableComponent> Behaviour;                                     // 0x0018 (size: 0x28)
    FItemAttachmentRowHandle AttachmentData;                                          // 0x0040 (size: 0x18)
    FTransform AttachmentOffset;                                                      // 0x0060 (size: 0x30)
    EAnimOverlayState AnimOverlayType;                                                // 0x0090 (size: 0x1)
    FItemAnimationsRowHandle AnimationData;                                           // 0x0094 (size: 0x18)
    bool bApplyAutomaticSpineBend;                                                    // 0x00AC (size: 0x1)
    TSoftObjectPtr<UAnimMontage> FPFocusedMontage;                                    // 0x00B0 (size: 0x28)
    TSoftObjectPtr<UBlendSpace1D> FPLocoBlendSpaceOverride;                           // 0x00D8 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPIdleAnim;                                         // 0x0100 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> TPFocusedMontage;                                    // 0x0128 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> TPUprightIdle;                                      // 0x0150 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> TPCrouchedIdle;                                     // 0x0178 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> TPPoses;                                            // 0x01A0 (size: 0x28)
    TSoftObjectPtr<UAnimMontage> ItemFocusedMontage;                                  // 0x01C8 (size: 0x28)

}; // Size: 0x1F0

struct FFocusableEnum : public FRowEnum
{
}; // Size: 0x10

struct FFocusableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFocusedItemData
{
    class UInventory* FocusedItemInventory;                                           // 0x0000 (size: 0x8)
    int32 FocusedItemSlot;                                                            // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FFoodTypesEnum : public FRowEnum
{
}; // Size: 0x10

struct FFoodTypesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FForecastPattern
{
    int32 Tier;                                                                       // 0x0000 (size: 0x4)
    int32 DurationMinutes;                                                            // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FFoundItemEntry
{
}; // Size: 0x10

struct FFuelData : public FResourceNetworkData
{
}; // Size: 0x60

struct FFuelEnum : public FRowEnum
{
}; // Size: 0x10

struct FFuelRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FFunctionContext
{
    UClass* ContextClass;                                                             // 0x0000 (size: 0x8)
    FString FunctionToExecute;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGOAPAction : public FIcarusTableRowBase
{
    FName Description;                                                                // 0x0018 (size: 0x8)
    TArray<FGOAPProperty> Preconditions;                                              // 0x0020 (size: 0x10)
    TArray<FGOAPProperty> Effects;                                                    // 0x0030 (size: 0x10)
    int32 Cost;                                                                       // 0x0040 (size: 0x4)
    float Timeout;                                                                    // 0x0044 (size: 0x4)
    float TickRate;                                                                   // 0x0048 (size: 0x4)
    TSubclassOf<class UNavigationQueryFilter> DefaultNavFilterOverride;               // 0x0050 (size: 0x8)
    EMovementState AssociatedMovementState;                                           // 0x0058 (size: 0x1)
    EActionRangeCheckBehaviour RangeCheckBehaviour;                                   // 0x0059 (size: 0x1)
    TSoftClassPtr<UIcarusGOAPAction> ActionBP;                                        // 0x0060 (size: 0x28)
    TSoftObjectPtr<UBehaviorTree> BehaviourTree;                                      // 0x0088 (size: 0x28)
    EAIAudioState AudioState;                                                         // 0x00B0 (size: 0x1)
    TMap<FBaseStatsEnum, int32> ActionStats;                                          // 0x00B8 (size: 0x50)

}; // Size: 0x108

struct FGOAPActionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FGOAPActionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGOAPGoal : public FIcarusTableRowBase
{
    FName Description;                                                                // 0x0018 (size: 0x8)
    FGOAPState State;                                                                 // 0x0020 (size: 0x10)
    int32 Priority;                                                                   // 0x0030 (size: 0x4)
    bool bIsRepeatable;                                                               // 0x0034 (size: 0x1)
    bool bRepeatOnlyOnSuccess;                                                        // 0x0035 (size: 0x1)
    float CooldownTime;                                                               // 0x0038 (size: 0x4)
    TSoftClassPtr<UIcarusGOAPGoal> GoalBP;                                            // 0x0040 (size: 0x28)

}; // Size: 0x68

struct FGOAPGoalsEnum : public FRowEnum
{
}; // Size: 0x10

struct FGOAPGoalsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGOAPMotivation : public FIcarusTableRowBase
{
    FName Description;                                                                // 0x0018 (size: 0x8)
    float UpdateTick;                                                                 // 0x0020 (size: 0x4)
    int32 MinValue;                                                                   // 0x0024 (size: 0x4)
    int32 MaxValue;                                                                   // 0x0028 (size: 0x4)
    int32 StartingValue;                                                              // 0x002C (size: 0x4)
    int32 StartingValueDeviation;                                                     // 0x0030 (size: 0x4)
    TArray<FGOAPMotivationTrigger> MotivationTriggers;                                // 0x0038 (size: 0x10)
    TSoftClassPtr<UIcarusGOAPMotivation> MotivationBP;                                // 0x0048 (size: 0x28)

}; // Size: 0x70

struct FGOAPMotivationTrigger
{
    int32 TriggerThreshold;                                                           // 0x0000 (size: 0x4)
    FGOAPState ThresholdOutcome;                                                      // 0x0008 (size: 0x10)
    TMap<FStatsEnum, int32> ThresholdStats;                                           // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FGOAPMotivationsEnum : public FRowEnum
{
}; // Size: 0x10

struct FGOAPMotivationsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGOAPProperties : public FIcarusTableRowBase
{
    FName Description;                                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FGOAPPropertiesEnum : public FRowEnum
{
}; // Size: 0x10

struct FGOAPPropertiesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGOAPProperty
{
    FGOAPPropertiesRowHandle Property;                                                // 0x0000 (size: 0x18)
    bool Value;                                                                       // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FGOAPSetup : public FIcarusTableRowBase
{
    TArray<FGOAPMotivationsRowHandle> Motivations;                                    // 0x0018 (size: 0x10)
    TArray<FGOAPActionsRowHandle> Actions;                                            // 0x0028 (size: 0x10)
    TArray<FGOAPGoalsRowHandle> Goals;                                                // 0x0038 (size: 0x10)
    FGOAPGoalsRowHandle DefaultGoal;                                                  // 0x0048 (size: 0x18)
    FGOAPState DefaultState;                                                          // 0x0060 (size: 0x10)
    TMap<class FGameplayTag, class UBehaviorTree*> DynamicSubtreeOverrides;           // 0x0070 (size: 0x50)

}; // Size: 0xC0

struct FGOAPSetupEnum : public FRowEnum
{
}; // Size: 0x10

struct FGOAPSetupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGOAPState
{
    TArray<FGOAPProperty> Properties;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameModeRecord
{
    int32 GameStateSeed;                                                              // 0x0000 (size: 0x4)
    float TimeOfDay;                                                                  // 0x0004 (size: 0x4)
    float ProspectGameTime;                                                           // 0x0008 (size: 0x4)
    int32 SecondsPerGameDay;                                                          // 0x000C (size: 0x4)
    TArray<FString> ApprovedPlayerIDs;                                                // 0x0010 (size: 0x10)
    TArray<FName> SessionFlagRecords;                                                 // 0x0020 (size: 0x10)
    int32 LevelTimeElapsedSec;                                                        // 0x0030 (size: 0x4)
    int32 TotalExoticsExported;                                                       // 0x0034 (size: 0x4)
    int32 TotalRedExoticsExported;                                                    // 0x0038 (size: 0x4)
    TArray<FExportedCurrency> ExportedCurrencies;                                     // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FGameplayConfig : public FIcarusTableRowBase
{
    float FloatValue;                                                                 // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FGameplayConfigEnum : public FRowEnum
{
}; // Size: 0x10

struct FGameplayConfigRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGeneratorData : public FIcarusTableRowBase
{
    FIcarusResourcesEnum Resource;                                                    // 0x0018 (size: 0x10)
    int32 GenerationRate;                                                             // 0x0028 (size: 0x4)
    float GenerationRatio;                                                            // 0x002C (size: 0x4)
    float ResourceUnitsRequired;                                                      // 0x0030 (size: 0x4)
    TArray<FItemsStaticRowHandle> TransmutableItems;                                  // 0x0038 (size: 0x10)
    TArray<FIcarusResourcesEnum> TransmutableResources;                               // 0x0048 (size: 0x10)
    bool RequiresManualActivation;                                                    // 0x0058 (size: 0x1)
    float OutOfFuelThresholdPercent;                                                  // 0x005C (size: 0x4)

}; // Size: 0x60

struct FGeneratorEnum : public FRowEnum
{
}; // Size: 0x10

struct FGeneratorRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGeneratorTraitRecord
{
    bool bActive;                                                                     // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGeneticLineage : public FIcarusTableRowBase
{
    FText Title;                                                                      // 0x0018 (size: 0x18)
    int32 Weighting;                                                                  // 0x0030 (size: 0x4)
    TMap<class FBaseStatsEnum, class UCurveFloat*> Growth;                            // 0x0038 (size: 0x50)
    TMap<FBaseStatsEnum, int32> Stats;                                                // 0x0088 (size: 0x50)

}; // Size: 0xD8

struct FGeneticLineagesEnum : public FRowEnum
{
}; // Size: 0x10

struct FGeneticLineagesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGeneticValue : public FIcarusTableRowBase
{
    FText Title;                                                                      // 0x0018 (size: 0x18)
    FText Short;                                                                      // 0x0030 (size: 0x18)
    TMap<class FBaseStatsEnum, class UCurveFloat*> Base;                              // 0x0048 (size: 0x50)

}; // Size: 0x98

struct FGeneticValuesEnum : public FRowEnum
{
}; // Size: 0x10

struct FGeneticValuesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGetIcarusPlayerPersonaResult
{
    FIcarusPlayerPersona Persona;                                                     // 0x0000 (size: 0x30)
    ERequestPlayerPersonaErrorCode ErrorCode;                                         // 0x0030 (size: 0x1)
    bool bSuccess;                                                                    // 0x0031 (size: 0x1)

}; // Size: 0x38

struct FGlobalCheatData
{
    bool bBuildingIntegrityDisabled;                                                  // 0x0000 (size: 0x1)
    bool bShelteredRequiredDisabled;                                                  // 0x0001 (size: 0x1)
    bool bLandMinesDontExplode;                                                       // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FGrantedAurasEnum : public FRowEnum
{
}; // Size: 0x10

struct FGrantedAurasRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGraphicsTierDescription : public FIcarusTableRowBase
{
    EGraphicsCardVendor CardVendor;                                                   // 0x0018 (size: 0x1)
    FString CardDescriptionProbe;                                                     // 0x0020 (size: 0x10)
    int32 CardPercent;                                                                // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FGraphicsTierDescriptionEnum : public FRowEnum
{
}; // Size: 0x10

struct FGraphicsTierDescriptionMods : public FIcarusTableRowBase
{
    EGraphicsCardVendor CardVendor;                                                   // 0x0018 (size: 0x1)
    FString CardDescriptionModProbe;                                                  // 0x0020 (size: 0x10)
    int32 CardModPercent;                                                             // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FGraphicsTierDescriptionModsEnum : public FRowEnum
{
}; // Size: 0x10

struct FGraphicsTierDescriptionModsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGraphicsTierDescriptionRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGravestoneData
{
    FPoseSnapshot DeathPose;                                                          // 0x0000 (size: 0x38)
    FVector DeathVelocity;                                                            // 0x0038 (size: 0xC)
    FCharacterCosmetics PlayerCosmetics;                                              // 0x0044 (size: 0x34)
    FName UserID;                                                                     // 0x0078 (size: 0x8)
    bool bHasSettled;                                                                 // 0x0080 (size: 0x1)
    bool bIsDataValid;                                                                // 0x0081 (size: 0x1)
    FVector LootBagPosition;                                                          // 0x0084 (size: 0xC)

}; // Size: 0x90

struct FGravestoneDataRecord
{
    FPoseSnapshotRecorder DeathPose;                                                  // 0x0000 (size: 0x38)
    FVector DeathVelocity;                                                            // 0x0038 (size: 0xC)
    FCharacterCosmeticsRecorder PlayerCosmetics;                                      // 0x0048 (size: 0xC8)
    FName UserID;                                                                     // 0x0110 (size: 0x8)
    bool bHasSettled;                                                                 // 0x0118 (size: 0x1)
    FVector LootBagPosition;                                                          // 0x011C (size: 0xC)

}; // Size: 0x128

struct FGreatHunt : public FIcarusTableRowBase
{
    FTalentArchetypesRowHandle Hunt;                                                  // 0x0018 (size: 0x18)
    FProspectListRowHandle Prospect;                                                  // 0x0030 (size: 0x18)
    TArray<FTalentsRowHandle> ForbiddenTalent;                                        // 0x0048 (size: 0x10)
    EGreatHuntMissionType Type;                                                       // 0x0058 (size: 0x1)
    TMap<FWorldStatsEnum, int32> WorldStats;                                          // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FGreatHuntCreatureInfo : public FIcarusTableRowBase
{
    FAISetupRowHandle AISetup;                                                        // 0x0018 (size: 0x18)
    class UTexture2D* WeaponImage;                                                    // 0x0030 (size: 0x8)
    class UTexture2D* BackgroundImage;                                                // 0x0038 (size: 0x8)
    class UTexture2D* BackgroundVerticalImage;                                        // 0x0040 (size: 0x8)
    class UTexture2D* BossImage;                                                      // 0x0048 (size: 0x8)
    FTalentTreesRowHandle GreatHunt;                                                  // 0x0050 (size: 0x18)
    FWorldBossesRowHandle WorldBoss;                                                  // 0x0068 (size: 0x18)
    FLivingItemShopItemsRowHandle LegendaryWeapon;                                    // 0x0080 (size: 0x18)
    FDLCPackageDataRowHandle DLCData;                                                 // 0x0098 (size: 0x18)
    FTerrainsRowHandle Terrain;                                                       // 0x00B0 (size: 0x18)
    TArray<FGreatHuntItemDisplay> ItemDisplays;                                       // 0x00C8 (size: 0x10)
    bool isComingSoon;                                                                // 0x00D8 (size: 0x1)

}; // Size: 0xE0

struct FGreatHuntCreatureInfoEnum : public FRowEnum
{
}; // Size: 0x10

struct FGreatHuntCreatureInfoRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGreatHuntItemDisplay
{
    class UTexture2D* IconOverride;                                                   // 0x0000 (size: 0x8)
    FItemsStaticRowHandle ItemReward;                                                 // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FGreatHuntsEnum : public FRowEnum
{
}; // Size: 0x10

struct FGreatHuntsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FGridPoint
{
    TArray<class ABuildingBase*> Buildings;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGroupedInstancedMapData : public FIcarusTableRowBase
{
    TArray<FInstancedMapDataRowHandle> InstancedMaps;                                 // 0x0018 (size: 0x10)
    EInstancedLevelPickType PickType;                                                 // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FGroupedInstancedMapDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FGroupedInstancedMapDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FHeatmapAISpawnData
{
    TSoftObjectPtr<UGameplayTexture> HeatmapTexture;                                  // 0x0000 (size: 0x28)
    EHeatmapColorChannel HeatmapTextureChannel;                                       // 0x0028 (size: 0x1)
    int32 HeatmapSpawnWeight;                                                         // 0x002C (size: 0x4)

}; // Size: 0x30

struct FHighScoreRecord
{
    FString PlayerID;                                                                 // 0x0000 (size: 0x10)
    int32 Score;                                                                      // 0x0010 (size: 0x4)
    FString PlayerName;                                                               // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FHighlightableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UHighlightableComponent> Behaviour;                                 // 0x0018 (size: 0x28)
    FText DisplayName;                                                                // 0x0040 (size: 0x18)
    FText Description;                                                                // 0x0058 (size: 0x18)
    bool bDisableMeshOutline;                                                         // 0x0070 (size: 0x1)
    bool bDisableTooltip;                                                             // 0x0071 (size: 0x1)

}; // Size: 0x78

struct FHighlightableEnum : public FRowEnum
{
}; // Size: 0x10

struct FHighlightableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FHintsData : public FIcarusTableRowBase
{
    FText Text;                                                                       // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FHintsEnum : public FRowEnum
{
}; // Size: 0x10

struct FHintsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FHitableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UHitableComponent> Behaviour;                                       // 0x0018 (size: 0x28)

}; // Size: 0x40

struct FHitableEnum : public FRowEnum
{
}; // Size: 0x10

struct FHitableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FHorde : public FIcarusTableRowBase
{
    TArray<FHordeWaveRowHandle> Waves;                                                // 0x0018 (size: 0x10)
    FExperienceEventsRowHandle ExperienceEvent;                                       // 0x0028 (size: 0x18)
    int32 CompletionsBeforeInert;                                                     // 0x0040 (size: 0x4)
    TArray<FItemRewardsRowHandle> ItemReward;                                         // 0x0048 (size: 0x10)
    TArray<FItemRewardsRowHandle> InertItemReward;                                    // 0x0058 (size: 0x10)
    TArray<FQuestQueriesRowHandle> LocationQueries;                                   // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FHordeCreatureSetup
{
    FAISetupRowHandle Creature;                                                       // 0x0000 (size: 0x18)
    FEpicCreaturesRowHandle Epic;                                                     // 0x0018 (size: 0x18)
    TMap<FBaseStatsEnum, int32> AdditionalStats;                                      // 0x0030 (size: 0x50)
    int32 LevelOverride;                                                              // 0x0080 (size: 0x4)
    FVector2D NumberToSpawnAtATime;                                                   // 0x0084 (size: 0x8)
    int32 TotalToSpawn;                                                               // 0x008C (size: 0x4)
    int32 ExtraSpawnCountPerAdditionalNearbyPlayer;                                   // 0x0090 (size: 0x4)
    float InitialSpawnDelay;                                                          // 0x0094 (size: 0x4)
    FVector2D TimeBetweenSpawns;                                                      // 0x0098 (size: 0x8)

}; // Size: 0xA0

struct FHordeEnum : public FRowEnum
{
}; // Size: 0x10

struct FHordeRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FHordeWave : public FIcarusTableRowBase
{
    TArray<FHordeCreatureSetup> Creatures;                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FHordeWaveEnum : public FRowEnum
{
}; // Size: 0x10

struct FHordeWaveRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FHuntingClueSetup : public FIcarusTableRowBase
{
    EHuntingClueType ClueType;                                                        // 0x0018 (size: 0x1)
    float ClueLifespan;                                                               // 0x001C (size: 0x4)
    float MaxClueDistance;                                                            // 0x0020 (size: 0x4)
    float MinDistanceBetweenClues;                                                    // 0x0024 (size: 0x4)
    float MaxDistanceBetweenClues;                                                    // 0x0028 (size: 0x4)
    float MinTimeBetweenClues;                                                        // 0x002C (size: 0x4)
    float MaxTimeBetweenClues;                                                        // 0x0030 (size: 0x4)
    TSoftClassPtr<AHuntingClue> HuntingClue;                                          // 0x0038 (size: 0x28)
    TSoftClassPtr<UHuntingWidget> HuntingWidget;                                      // 0x0060 (size: 0x28)
    bool HasTrail;                                                                    // 0x0088 (size: 0x1)
    float TrailSegmentLength;                                                         // 0x008C (size: 0x4)

}; // Size: 0x90

struct FHuntingClueSetupEnum : public FRowEnum
{
}; // Size: 0x10

struct FHuntingClueSetupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FHuntingSetup : public FIcarusTableRowBase
{
    TArray<FHuntingClueSetupRowHandle> HuntingClues;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FHuntingSetupEnum : public FRowEnum
{
}; // Size: 0x10

struct FHuntingSetupRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FIcarusAtmosphere : public FIcarusTableRowBase
{
    FText AtmosphereName;                                                             // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Image_Small;                                           // 0x0030 (size: 0x28)
    TSoftObjectPtr<UTexture2D> Image_Medium;                                          // 0x0058 (size: 0x28)
    TSoftObjectPtr<UTexture2D> Image_Large;                                           // 0x0080 (size: 0x28)
    class UCurveLinearColor* FogColour;                                               // 0x00A8 (size: 0x8)
    class UCurveLinearColor* SunColour;                                               // 0x00B0 (size: 0x8)
    class UCurveLinearColor* RayleighScatteringColour;                                // 0x00B8 (size: 0x8)
    class UCurveFloat* SunIntensity;                                                  // 0x00C0 (size: 0x8)
    class UCurveFloat* MoonIntensity;                                                 // 0x00C8 (size: 0x8)
    class UCurveFloat* SkyLightIntensity;                                             // 0x00D0 (size: 0x8)
    class UCurveFloat* OvercastScattering;                                            // 0x00D8 (size: 0x8)
    class UCurveVector* Bloom;                                                        // 0x00E0 (size: 0x8)
    float DistFogScale;                                                               // 0x00E8 (size: 0x4)
    FName MaterialParameterName;                                                      // 0x00EC (size: 0x8)
    TSoftObjectPtr<UTextureCube> Cubemap;                                             // 0x00F8 (size: 0x28)

}; // Size: 0x120

struct FIcarusAttachment : public FIcarusTableRowBase
{
    FAlterationsRowHandle GrantedAlteration;                                          // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FIcarusAttachmentsEnum : public FRowEnum
{
}; // Size: 0x10

struct FIcarusAttachmentsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FIcarusBackendVersion
{
}; // Size: 0xC

struct FIcarusBiome : public FIcarusTableRowBase
{
    FName BiomeName;                                                                  // 0x0018 (size: 0x8)
    FText DisplayName;                                                                // 0x0020 (size: 0x18)
    FColor Color;                                                                     // 0x0038 (size: 0x4)
    class UCurveFloat* BiomeTemperatureCurve;                                         // 0x0040 (size: 0x8)
    int32 WeatherFrequency;                                                           // 0x0048 (size: 0x4)
    FAtmospheresRowHandle AtmosphereType;                                             // 0x004C (size: 0x18)
    FBiomeAudioDataRowHandle Audio;                                                   // 0x0064 (size: 0x18)
    bool bOrbitalCommunicationBlocked;                                                // 0x007C (size: 0x1)
    FModifierStatesRowHandle BiomeModifier;                                           // 0x0080 (size: 0x18)

}; // Size: 0x98

struct FIcarusBuildingType : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)
    TMap<FStatsEnum, int32> Stats;                                                    // 0x0030 (size: 0x50)

}; // Size: 0x80

struct FIcarusCharacterRecord
{
    int32 CurrentHealth;                                                              // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FIcarusDamagePacket
{
    FDamageEvent DamageEvent;                                                         // 0x0000 (size: 0x10)
    int32 TotalDamage;                                                                // 0x0010 (size: 0x4)
    int32 AppliedDamage;                                                              // 0x0014 (size: 0x4)
    bool bSuppressDamageNumbers;                                                      // 0x0018 (size: 0x1)
    class AController* EventInstigator;                                               // 0x0020 (size: 0x8)
    class AActor* DamageCauser;                                                       // 0x0028 (size: 0x8)
    FHitResult HitResult;                                                             // 0x0030 (size: 0x88)
    float Timestamp;                                                                  // 0x00B8 (size: 0x4)
    bool bWasRadialDamage;                                                            // 0x00BC (size: 0x1)
    bool bIsKillCam;                                                                  // 0x00BD (size: 0x1)
    FCriticalHitAreasEnum CriticalHitArea;                                            // 0x00C0 (size: 0x10)
    bool bIsStealthHit;                                                               // 0x00D0 (size: 0x1)

}; // Size: 0xD8

struct FIcarusDeployableType : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FIcarusFoodType : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FIcarusGOAPAIFact
{
    class AActor* Target;                                                             // 0x0008 (size: 0x8)
    FVector Location;                                                                 // 0x0010 (size: 0xC)
    EGOAPObjectType ObjectType;                                                       // 0x001C (size: 0x1)
    FAIStimulus LastAIStimulus;                                                       // 0x0020 (size: 0x3C)
    EGOAPFactSource FactSource;                                                       // 0x005C (size: 0x1)

}; // Size: 0x60

struct FIcarusGOAPProperty
{
    EGOAPProperty Key;                                                                // 0x0000 (size: 0x1)
    bool bValue;                                                                      // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FIcarusGOAPSearchNode
{
}; // Size: 0x30

struct FIcarusGOAPState
{
    TArray<FIcarusGOAPProperty> Properties;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FIcarusGameVersion
{
}; // Size: 0x30

struct FIcarusGraphicsExtraInfo
{
    FString GPUDeviceName;                                                            // 0x0000 (size: 0x10)
    int32 GPUDedicatedMemoryGb;                                                       // 0x0010 (size: 0x4)
    int32 GPUDedicatedSystemMemoryGb;                                                 // 0x0014 (size: 0x4)
    int32 GPUSharedSystemMemoryGb;                                                    // 0x0018 (size: 0x4)
    FString CPUVendorName;                                                            // 0x0020 (size: 0x10)
    FString CPUDeviceName;                                                            // 0x0030 (size: 0x10)
    int32 CPUCoreCount;                                                               // 0x0040 (size: 0x4)
    int32 CPUPhysicalMemoryGb;                                                        // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FIcarusIntRange
{
    int32 Min;                                                                        // 0x0000 (size: 0x4)
    int32 Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FIcarusItemConstructionParameters
{
    bool bSimulatePhysics;                                                            // 0x0000 (size: 0x1)
    FString MeshAssetPath;                                                            // 0x0008 (size: 0x10)
    FName CollisionProfile;                                                           // 0x0018 (size: 0x8)
    TEnumAsByte<EComponentMobility::Type> Mobility;                                   // 0x0020 (size: 0x1)
    bool bHiddenInGame;                                                               // 0x0021 (size: 0x1)
    bool bDisableItemStaticDataTraits;                                                // 0x0022 (size: 0x1)
    bool bReplicateStatArray;                                                         // 0x0023 (size: 0x1)
    bool bForceNoReplication;                                                         // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FIcarusItemSpawnParameters
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    class AActor* Template;                                                           // 0x0008 (size: 0x8)
    class AActor* Owner;                                                              // 0x0010 (size: 0x8)
    class APawn* Instigator;                                                          // 0x0018 (size: 0x8)
    ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingOverride;                // 0x0020 (size: 0x1)
    FIcarusItemConstructionParameters ConstructionParameters;                         // 0x0028 (size: 0x28)
    int32 ForcedUID;                                                                  // 0x0050 (size: 0x4)
    FIcarusItemSpawnParametersAdvanced Advanced;                                      // 0x0058 (size: 0x38)

}; // Size: 0x90

struct FIcarusItemSpawnParametersAdvanced
{
    TSubclassOf<class AIcarusItem> OverrideActorClass;                                // 0x0000 (size: 0x8)
    TSoftObjectPtr<UStreamableRenderAsset> OverrideMeshPtr;                           // 0x0008 (size: 0x28)
    bool bDisableActorRecording;                                                      // 0x0030 (size: 0x1)
    bool bNoFail;                                                                     // 0x0031 (size: 0x1)
    bool bDeferConstruction;                                                          // 0x0032 (size: 0x1)
    bool bAllowDuringConstructionScript;                                              // 0x0033 (size: 0x1)

}; // Size: 0x38

struct FIcarusLogCategory : public FIcarusTableRowBase
{
    FText Name;                                                                       // 0x0018 (size: 0x18)
    FText Description;                                                                // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FIcarusLogEntry
{
    FLogCategoriesEnum OutputCategory;                                                // 0x0000 (size: 0x10)
    ELevel LogLevel;                                                                  // 0x0010 (size: 0x1)
    FString LogMessage;                                                               // 0x0018 (size: 0x10)
    FDateTime Timestamp;                                                              // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FIcarusMount : public FIcarusTableRowBase
{
    FAISetupRowHandle AISetup;                                                        // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)
    TArray<FMountVariation> Variations;                                               // 0x0058 (size: 0x10)
    FTagQueriesRowHandle RelevantSaddleQuery;                                         // 0x0068 (size: 0x18)
    TArray<EMountCombatBehaviourState> SupportedCombatStates;                         // 0x0080 (size: 0x10)
    TArray<EMountMovementBehaviourState> SupportedMovementStates;                     // 0x0090 (size: 0x10)
    TArray<EMountConsumptionBehaviourState> SupportedConsumptionStates;               // 0x00A0 (size: 0x10)
    TArray<EMountGrazingBehaviourState> SupportedGrazingStates;                       // 0x00B0 (size: 0x10)
    TMap<class FGameplayTag, class TSoftObjectPtr<UAnimMontage>> Animations;          // 0x00C0 (size: 0x50)
    FPreviewCameraSettingsRowHandle InventoryPreviewCameraSettings;                   // 0x0110 (size: 0x18)
    TArray<FText> DefaultNames;                                                       // 0x0128 (size: 0x10)
    FMapIconsRowHandle MapIcon;                                                       // 0x0138 (size: 0x18)
    FVector RelativeFeetOffset;                                                       // 0x0150 (size: 0xC)
    FVector RelativeHandsOffset;                                                      // 0x015C (size: 0xC)
    FVector RelativeLightOffset;                                                      // 0x0168 (size: 0xC)
    float SpringArmTargetDistance;                                                    // 0x0174 (size: 0x4)
    FTalentArchetypesRowHandle MountTalentArchetype;                                  // 0x0178 (size: 0x18)
    FCharacterGrowthRowHandle GrowthCurve;                                            // 0x0190 (size: 0x18)
    bool bUseTemperature;                                                             // 0x01A8 (size: 0x1)
    FVector2D ComfortableTemperatureRange;                                            // 0x01AC (size: 0x8)
    int32 ColdTemperatureResistance;                                                  // 0x01B4 (size: 0x4)
    int32 HotTemperatureResistance;                                                   // 0x01B8 (size: 0x4)

}; // Size: 0x1C0

struct FIcarusPlayerChatMessage
{
    FString PlayerID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    class UTexture2D* PlayerIcon;                                                     // 0x0020 (size: 0x8)
    FColor PlayerColour;                                                              // 0x0028 (size: 0x4)
    FString Message;                                                                  // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FIcarusPlayerPersona
{
    FString PlayerID;                                                                 // 0x0000 (size: 0x10)
    FText Name;                                                                       // 0x0010 (size: 0x18)
    class UTexture2D* Avatar;                                                         // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FIcarusProjectileType : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FIcarusProspect : public FIcarusTableRowBase
{
    FText DropName;                                                                   // 0x0018 (size: 0x18)
    FString DesignNotes;                                                              // 0x0030 (size: 0x10)
    FText Description;                                                                // 0x0040 (size: 0x18)
    FText FlavourText;                                                                // 0x0058 (size: 0x18)
    class UTexture2D* ProspectImage;                                                  // 0x0070 (size: 0x8)
    TMap<class EMissionDifficulty, class FDifficultySetup> DifficultySetup;           // 0x0078 (size: 0x50)
    EIcarusProspectDifficulty Difficulty;                                             // 0x00C8 (size: 0x1)
    FDialogueRowHandle BriefingDialogue;                                              // 0x00CC (size: 0x18)
    FDialogueRowHandle LandingDialogue;                                               // 0x00E4 (size: 0x18)
    FDialogueRowHandle MissionCompleteDialogue;                                       // 0x00FC (size: 0x18)
    int32 RequiredLevel;                                                              // 0x0114 (size: 0x4)
    EProspectRequiredTech RequiredTech;                                               // 0x0118 (size: 0x1)
    TArray<FCharacterFlagsEnum> RequiredCharacterFlags;                               // 0x0120 (size: 0x10)
    TArray<FCharacterFlagsEnum> ForbiddenCharacterFlags;                              // 0x0130 (size: 0x10)
    TArray<FFlagsMultiRowHandle> RequiredFlags;                                       // 0x0140 (size: 0x10)
    bool bDisableWorldBosses;                                                         // 0x0150 (size: 0x1)
    TMap<class FWorldBossesRowHandle, class FVector2D> WorldBosses;                   // 0x0158 (size: 0x50)
    FProspectForecastRowHandle InitialForecast;                                       // 0x01A8 (size: 0x18)
    FProspectForecastRowHandle Forecast;                                              // 0x01C0 (size: 0x18)
    bool bDisabled;                                                                   // 0x01D8 (size: 0x1)
    FTerrainsRowHandle Terrain;                                                       // 0x01DC (size: 0x18)
    FFactionMissionsRowHandle FactionMission;                                         // 0x01F4 (size: 0x18)
    bool bIsPersistent;                                                               // 0x020C (size: 0x1)
    bool bIsOpenWorld;                                                                // 0x020D (size: 0x1)
    FIcarusTimeSpan TimeDuration;                                                     // 0x0210 (size: 0x20)
    int32 StartingTime;                                                               // 0x0230 (size: 0x4)
    class UCurveFloat* TimeScaleCurve;                                                // 0x0238 (size: 0x8)
    TArray<FRulesetsRowHandle> AdditionalRulesets;                                    // 0x0240 (size: 0x10)
    int32 PlayerSpawnGroupIndex;                                                      // 0x0250 (size: 0x4)
    TArray<FMetaSpawn> MetaDepositSpawns;                                             // 0x0258 (size: 0x10)
    FVector2D DefaultMetaResourceAmount;                                              // 0x0268 (size: 0x8)
    int32 NumMetaSpawnsMin;                                                           // 0x0270 (size: 0x4)
    int32 NumMetaSpawnsMax;                                                           // 0x0274 (size: 0x4)
    TArray<FProspectStatsRowHandle> WorldStatList;                                    // 0x0278 (size: 0x10)
    TSoftObjectPtr<UGameplayTexture> BoundsOverride;                                  // 0x0288 (size: 0x28)
    FAISpawnConfigRowHandle AISpawnConfigOverride;                                    // 0x02B0 (size: 0x18)
    bool bAbandonOnProspectExpiry;                                                    // 0x02C8 (size: 0x1)
    EOnProspectAvailability OnProspectAvailability;                                   // 0x02C9 (size: 0x1)

}; // Size: 0x2D0

struct FIcarusResource : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    FText Units;                                                                      // 0x0030 (size: 0x18)
    FColor Color;                                                                     // 0x0048 (size: 0x4)
    TSoftObjectPtr<UTexture2D> Resource_Icon;                                         // 0x0050 (size: 0x28)
    TSoftObjectPtr<UTexture2D> Recipe_Icon;                                           // 0x0078 (size: 0x28)
    TSoftObjectPtr<UMaterialInstance> Container_Icon;                                 // 0x00A0 (size: 0x28)

}; // Size: 0xC8

struct FIcarusResourcesEnum : public FRowEnum
{
}; // Size: 0x10

struct FIcarusResourcesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FIcarusSession
{
    FProspectInfo ProspectInfo;                                                       // 0x0000 (size: 0xA0)
    FBlueprintSessionResult Session;                                                  // 0x00A0 (size: 0x108)
    bool FromServer;                                                                  // 0x01A8 (size: 0x1)
    bool Locked;                                                                      // 0x01A9 (size: 0x1)
    bool DedicatedServer;                                                             // 0x01AA (size: 0x1)
    FString GameVersion;                                                              // 0x01B0 (size: 0x10)

}; // Size: 0x1C0

struct FIcarusSortTypePriority : public FIcarusTableRowBase
{
    TArray<FTagQueriesRowHandle> TagPriority;                                         // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FIcarusStat
{
    FStatsRowHandle Stat;                                                             // 0x0000 (size: 0x18)
    int32 Value;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FIcarusStatDescription : public FIcarusTableRowBase
{
    FText Title;                                                                      // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)
    FText PositiveTitleFormat;                                                        // 0x0058 (size: 0x18)
    FText NegativeTitleFormat;                                                        // 0x0070 (size: 0x18)
    FText PositiveDescription;                                                        // 0x0088 (size: 0x18)
    FText NegativeDescription;                                                        // 0x00A0 (size: 0x18)
    bool bIsReplicated;                                                               // 0x00B8 (size: 0x1)
    TArray<FStatDisplayCalculation> DisplayOperations;                                // 0x00C0 (size: 0x10)
    bool bIsWorldStat;                                                                // 0x00D0 (size: 0x1)
    FStatCategoriesRowHandle StatCategory;                                            // 0x00D4 (size: 0x18)
    bool bHideStatInUserInterface;                                                    // 0x00EC (size: 0x1)
    bool bShowStatOnModifiers;                                                        // 0x00ED (size: 0x1)

}; // Size: 0xF0

struct FIcarusStatReplicated
{
    FStatsEnum Stat;                                                                  // 0x0000 (size: 0x10)
    int32 Value;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FIcarusTamingData : public FIcarusTableRowBase
{
    TSoftClassPtr<UIcarusTamingComponent> Behaviour;                                  // 0x0018 (size: 0x28)
    int32 TameDurationInSeconds;                                                      // 0x0040 (size: 0x4)
    FVector2D DesiredTemperatureRange;                                                // 0x0044 (size: 0x8)
    int32 DesiredShelterPercentage;                                                   // 0x004C (size: 0x4)
    int32 DesiredNutritionPercentage;                                                 // 0x0050 (size: 0x4)
    TArray<FModifierStatesRowHandle> RequiredTamingModifiers;                         // 0x0058 (size: 0x10)
    TArray<FModifierStatesRowHandle> ProhibitedTamingModifiers;                       // 0x0068 (size: 0x10)
    FAISetupRowHandle TamedAI;                                                        // 0x0078 (size: 0x18)
    TMap<class FAISetupRowHandle, class FIcarusStatReplicated> TamedAIOverride;       // 0x0090 (size: 0x50)
    FAISetupRowHandle MatureCreatureType;                                             // 0x00E0 (size: 0x18)
    FAISetupRowHandle JuvenileCreatureType;                                           // 0x00F8 (size: 0x18)
    bool bAutomaticallySpawnJuvenileWithParent;                                       // 0x0110 (size: 0x1)
    int32 PercentChanceToSpawnJuvenile;                                               // 0x0114 (size: 0x4)
    int32 MaxNearbyAutoSpawnedJuveniles;                                              // 0x0118 (size: 0x4)
    int32 TimeToSpawnDynamicCharacter;                                                // 0x011C (size: 0x4)
    int32 TimeToSpawnDynamicCharacterRandomDeviation;                                 // 0x0120 (size: 0x4)
    TArray<FAtmospheresEnum> TrappingSupportedAtmospheres;                            // 0x0128 (size: 0x10)
    int32 GestationPeriodSeconds;                                                     // 0x0138 (size: 0x4)

}; // Size: 0x140

struct FIcarusTerrain : public FIcarusTableRowBase
{
    FText TerrainName;                                                                // 0x0018 (size: 0x18)
    TSoftObjectPtr<UWorld> Level;                                                     // 0x0030 (size: 0x28)
    TSoftObjectPtr<UGameplayTexture> TemperatureMap;                                  // 0x0058 (size: 0x28)
    FVector2D TemperatureMapRange;                                                    // 0x0080 (size: 0x8)
    TSoftObjectPtr<UGameplayTexture> BiomeMap;                                        // 0x0088 (size: 0x28)
    TSoftObjectPtr<UGameplayTexture> Bounds;                                          // 0x00B0 (size: 0x28)
    FAISpawnConfigRowHandle SpawnConfig;                                              // 0x00D8 (size: 0x18)
    FFishSpawnConfigRowHandle FishConfig;                                             // 0x00F0 (size: 0x18)
    TMap<class FWorldBossesRowHandle, class FVector2D> WorldBosses;                   // 0x0108 (size: 0x50)
    TSoftObjectPtr<UGameplayTexture> AudioZoneMap;                                    // 0x0158 (size: 0x28)

}; // Size: 0x180

struct FIcarusTimeSpan
{
    FIcarusIntRange Days;                                                             // 0x0000 (size: 0x8)
    FIcarusIntRange Hours;                                                            // 0x0008 (size: 0x8)
    FIcarusIntRange Mins;                                                             // 0x0010 (size: 0x8)
    FIcarusIntRange Seconds;                                                          // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FIcarusToolType : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FIcarusWeatherActionData : public FIcarusTableRowBase
{
    TSoftClassPtr<UIcarusWeatherAction> WeatherActionComponent;                       // 0x0018 (size: 0x28)
    bool bIsRampingUp;                                                                // 0x0040 (size: 0x1)
    TSoftObjectPtr<UTexture2D> TimelineIcon;                                          // 0x0048 (size: 0x28)
    FSlateColor TimelineTailBrush;                                                    // 0x0070 (size: 0x28)
    float ExposureMultiplier;                                                         // 0x0098 (size: 0x4)
    TMap<float, FModifier> ExposureModifiers;                                         // 0x00A0 (size: 0x50)
    bool bEnableVisuals_Rain;                                                         // 0x00F0 (size: 0x1)
    float Severity_RainStart;                                                         // 0x00F4 (size: 0x4)
    float Severity_RainEnd;                                                           // 0x00F8 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Rain;                                           // 0x0100 (size: 0x28)
    bool bEnableFillable_Rain;                                                        // 0x0128 (size: 0x1)
    float Rainfall_Millilitre_Start;                                                  // 0x012C (size: 0x4)
    float Rainfall_Millilitre_End;                                                    // 0x0130 (size: 0x4)
    bool bEnableVisuals_Clouds;                                                       // 0x0134 (size: 0x1)
    float Severity_CloudsStart;                                                       // 0x0138 (size: 0x4)
    float Severity_CloudsEnd;                                                         // 0x013C (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Clouds;                                         // 0x0140 (size: 0x28)
    bool bGeneratesLightning;                                                         // 0x0168 (size: 0x1)
    float MinLightningInterval;                                                       // 0x016C (size: 0x4)
    float MaxLightningInterval;                                                       // 0x0170 (size: 0x4)
    bool bGeneratesThunder;                                                           // 0x0174 (size: 0x1)
    float ThunderIntensity;                                                           // 0x0178 (size: 0x4)
    bool bEnableVisuals_Debris;                                                       // 0x017C (size: 0x1)
    float Severity_DebrisStart;                                                       // 0x0180 (size: 0x4)
    float Severity_DebrisEnd;                                                         // 0x0184 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Debris;                                         // 0x0188 (size: 0x28)
    bool bEnableAction_Temperature;                                                   // 0x01B0 (size: 0x1)
    float Temperature_Start;                                                          // 0x01B4 (size: 0x4)
    float Temperature_End;                                                            // 0x01B8 (size: 0x4)
    int32 Perception_Percentage;                                                      // 0x01BC (size: 0x4)
    bool bEnableVisuals_Wind;                                                         // 0x01C0 (size: 0x1)
    bool bEnableAction_Wind;                                                          // 0x01C1 (size: 0x1)
    float Severity_WindStart;                                                         // 0x01C4 (size: 0x4)
    float Severity_WindEnd;                                                           // 0x01C8 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Wind;                                           // 0x01D0 (size: 0x28)
    float StormTier;                                                                  // 0x01F8 (size: 0x4)
    float StormWindDamagePeriod;                                                      // 0x01FC (size: 0x4)
    float UnzipChance;                                                                // 0x0200 (size: 0x4)
    float UnzipbuildingCountMultiplier;                                               // 0x0204 (size: 0x4)
    float UnzipbuildingDamageMultiplier;                                              // 0x0208 (size: 0x4)
    bool bEnableEndAllWindDamageTrigger;                                              // 0x020C (size: 0x1)
    TSoftObjectPtr<UCurveFloat> Curve_EndAllWindDamageTrigger;                        // 0x0210 (size: 0x28)
    bool bWindTopplesTrees;                                                           // 0x0238 (size: 0x1)
    float TreeToppleMinInterval;                                                      // 0x023C (size: 0x4)
    float TreeToppleMaxInterval;                                                      // 0x0240 (size: 0x4)
    float TreeToppleStrengthThreshold;                                                // 0x0244 (size: 0x4)
    bool bEnableDamage_Deployables;                                                   // 0x0248 (size: 0x1)
    float Damage_Deployables_MinInterval;                                             // 0x024C (size: 0x4)
    float Damage_Deployables_MaxInterval;                                             // 0x0250 (size: 0x4)
    float Damage_Deployables_Intensity;                                               // 0x0254 (size: 0x4)
    bool bEnableDamage_Players;                                                       // 0x0258 (size: 0x1)
    float Damage_Players_MinInterval;                                                 // 0x025C (size: 0x4)
    float Damage_Players_MaxInterval;                                                 // 0x0260 (size: 0x4)
    float Damage_Players_Intensity;                                                   // 0x0264 (size: 0x4)
    bool bEnableFireExtinguish;                                                       // 0x0268 (size: 0x1)
    float FireExtinguish_RollChanceMulti;                                             // 0x026C (size: 0x4)
    float FireExtinguish_MinInterval;                                                 // 0x0270 (size: 0x4)
    float FireExtinguish_MaxInterval;                                                 // 0x0274 (size: 0x4)
    bool bEnableVisuals_Sand;                                                         // 0x0278 (size: 0x1)
    float Severity_SandStart;                                                         // 0x027C (size: 0x4)
    float Severity_SandEnd;                                                           // 0x0280 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Sand;                                           // 0x0288 (size: 0x28)
    bool bEnableVisuals_Sand_Buildup;                                                 // 0x02B0 (size: 0x1)
    float Severity_Sand_BuildupStart;                                                 // 0x02B4 (size: 0x4)
    float Severity_Sand_BuildupEnd;                                                   // 0x02B8 (size: 0x4)
    bool bEnableVisuals_Snow;                                                         // 0x02BC (size: 0x1)
    float Severity_SnowStart;                                                         // 0x02C0 (size: 0x4)
    float Severity_SnowEnd;                                                           // 0x02C4 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Snow;                                           // 0x02C8 (size: 0x28)
    bool bEnableVisuals_Snow_Buildup;                                                 // 0x02F0 (size: 0x1)
    float Severity_Snow_BuildupStart;                                                 // 0x02F4 (size: 0x4)
    float Severity_Snow_BuildupEnd;                                                   // 0x02F8 (size: 0x4)
    bool bEnableVisuals_Snow_Storm;                                                   // 0x02FC (size: 0x1)
    float Severity_Snow_StormStart;                                                   // 0x0300 (size: 0x4)
    float Severity_Snow_StormEnd;                                                     // 0x0304 (size: 0x4)
    bool bEnableVisuals_Ash;                                                          // 0x0308 (size: 0x1)
    float Severity_AshStart;                                                          // 0x030C (size: 0x4)
    float Severity_AshEnd;                                                            // 0x0310 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Ash;                                            // 0x0318 (size: 0x28)
    bool bEnableVisuals_Ash_Buildup;                                                  // 0x0340 (size: 0x1)
    float Severity_Ash_BuildupStart;                                                  // 0x0344 (size: 0x4)
    float Severity_Ash_BuildupEnd;                                                    // 0x0348 (size: 0x4)
    bool bEnableVisuals_Embers;                                                       // 0x034C (size: 0x1)
    float Severity_EmbersStart;                                                       // 0x0350 (size: 0x4)
    float Severity_EmbersEnd;                                                         // 0x0354 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Embers;                                         // 0x0358 (size: 0x28)
    bool bEnableVisuals_Smoke;                                                        // 0x0380 (size: 0x1)
    float Severity_SmokeStart;                                                        // 0x0384 (size: 0x4)
    float Severity_SmokeEnd;                                                          // 0x0388 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Smoke;                                          // 0x0390 (size: 0x28)
    bool bEnableVisuals_AcidRain;                                                     // 0x03B8 (size: 0x1)
    float Severity_AcidRainStart;                                                     // 0x03BC (size: 0x4)
    float Severity_AcidRainEnd;                                                       // 0x03C0 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_AcidRain;                                       // 0x03C8 (size: 0x28)
    bool bEnableVisuals_Hail;                                                         // 0x03F0 (size: 0x1)
    float Severity_HailStart;                                                         // 0x03F4 (size: 0x4)
    float Severity_HailEnd;                                                           // 0x03F8 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_HailRain;                                       // 0x0400 (size: 0x28)
    bool bEnableVisuals_Radiation;                                                    // 0x0428 (size: 0x1)
    float Severity_RadiationStart;                                                    // 0x042C (size: 0x4)
    float Severity_RadiationEnd;                                                      // 0x0430 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Radiation;                                      // 0x0438 (size: 0x28)
    bool bEnableVisuals_FogColor;                                                     // 0x0460 (size: 0x1)
    float Severity_FogColorStart;                                                     // 0x0464 (size: 0x4)
    float Severity_FogColorEnd;                                                       // 0x0468 (size: 0x4)
    FLinearColor FogColorLinear;                                                      // 0x046C (size: 0x10)
    bool bEnableVisuals_FogDensity;                                                   // 0x047C (size: 0x1)
    float Severity_FogDensityStart;                                                   // 0x0480 (size: 0x4)
    float Severity_FogDensityEnd;                                                     // 0x0484 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_FogDensity;                                     // 0x0488 (size: 0x28)
    bool bEnableVisuals_FogExtinction;                                                // 0x04B0 (size: 0x1)
    float Severity_FogExtinctionStart;                                                // 0x04B4 (size: 0x4)
    float Severity_FogExtinctionEnd;                                                  // 0x04B8 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_FogExtinction;                                  // 0x04C0 (size: 0x28)
    bool bEnableVisuals_Whiteout;                                                     // 0x04E8 (size: 0x1)
    float Severity_WhiteoutStart;                                                     // 0x04EC (size: 0x4)
    float Severity_WhiteoutEnd;                                                       // 0x04F0 (size: 0x4)
    TSoftObjectPtr<UCurveFloat> Curve_Whiteout;                                       // 0x04F8 (size: 0x28)
    bool bEnableDamageTag;                                                            // 0x0520 (size: 0x1)
    TSoftObjectPtr<UCurveFloat> Curve_DamageTag;                                      // 0x0528 (size: 0x28)
    float DamageTag_Intensity;                                                        // 0x0550 (size: 0x4)
    float DamageTag_DutyCycle;                                                        // 0x0554 (size: 0x4)
    FTagQueriesRowHandle DamageTag_Query;                                             // 0x0558 (size: 0x18)
    EIcarusDamageType DamageTag_DamageType;                                           // 0x0570 (size: 0x1)
    bool bEnableProcessorClog;                                                        // 0x0571 (size: 0x1)
    TSoftObjectPtr<UCurveFloat> Curve_ProcessorClog;                                  // 0x0578 (size: 0x28)
    bool bEnablePlayerItemDamageTag;                                                  // 0x05A0 (size: 0x1)
    bool bDamageFocusedItem;                                                          // 0x05A1 (size: 0x1)
    TSoftObjectPtr<UCurveFloat> Curve_PlayerItemDamageTag;                            // 0x05A8 (size: 0x28)
    float PlayerItemDamageTag_Intensity;                                              // 0x05D0 (size: 0x4)
    float PlayerItemDamageTag_DutyCycle;                                              // 0x05D4 (size: 0x4)
    FTagQueriesRowHandle PlayerItemDamageTag_Query;                                   // 0x05D8 (size: 0x18)
    FInventoryIDEnum InventoryID;                                                     // 0x05F0 (size: 0x10)
    EIcarusDamageType PlayerItemDamageTag_DamageType;                                 // 0x0600 (size: 0x1)

}; // Size: 0x608

struct FIcarusWeatherBiomeGroup : public FIcarusTableRowBase
{
    TArray<FBiomesRowHandle> AvaliableBiomes;                                         // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FIcarusWeatherEvent : public FIcarusTableRowBase
{
    EIcarusWeatherDifficulty Difficulty;                                              // 0x0018 (size: 0x1)
    int32 Tier;                                                                       // 0x001C (size: 0x4)
    int32 DurationSeconds;                                                            // 0x0020 (size: 0x4)
    int32 DurationMinutes;                                                            // 0x0024 (size: 0x4)
    TArray<FWeatherBiomeGroupsRowHandle> BiomeGroups;                                 // 0x0028 (size: 0x10)
    class UTexture2D* WeatherImage;                                                   // 0x0038 (size: 0x8)
    FText WeatherName;                                                                // 0x0040 (size: 0x18)
    FText WeatherDescription;                                                         // 0x0058 (size: 0x18)
    TArray<FWeatherAction> WeatherActions;                                            // 0x0070 (size: 0x10)
    TArray<FWeatherMusicCue> MusicCues;                                               // 0x0080 (size: 0x10)
    TArray<FScriptedEventSetup> ScriptedEventConfig;                                  // 0x0090 (size: 0x10)
    float ChanceToActivateScriptedEvent;                                              // 0x00A0 (size: 0x4)

}; // Size: 0xA8

struct FIcarusWeatherPoolData : public FIcarusTableRowBase
{
    TArray<FWeatherPoolEntry> WeatherEvents;                                          // 0x0018 (size: 0x10)
    TArray<FWeatherPoolEntryMeta> ContainedTiers;                                     // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FInitialQuestRecord
{
    FString QuestActorName;                                                           // 0x0000 (size: 0x10)
    int32 RelevantActorIcarusUID;                                                     // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FInstancedBlobSave
{
    FString Key;                                                                      // 0x0000 (size: 0x10)
    FString Hash;                                                                     // 0x0010 (size: 0x10)
    int32 TotalLength;                                                                // 0x0020 (size: 0x4)
    int32 DataLength;                                                                 // 0x0024 (size: 0x4)
    int32 UncompressedLength;                                                         // 0x0028 (size: 0x4)
    FString BinaryBlob;                                                               // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FInstancedLevelData
{
}; // Size: 0x70

struct FInstancedLevelSaveDataRecord
{
    int32 SelectedSlot;                                                               // 0x0000 (size: 0x4)
    FVector LoadedLocation;                                                           // 0x0004 (size: 0xC)
    FString UniqueLevelName;                                                          // 0x0010 (size: 0x10)
    FInstancedBlobSave InstancedSave;                                                 // 0x0020 (size: 0x40)
    TArray<int32> InstancedInventories;                                               // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FInstancedMapData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UWorld> MapAsset;                                                  // 0x0018 (size: 0x28)
    FBox MapBounds;                                                                   // 0x0040 (size: 0x1C)
    int32 CaveID;                                                                     // 0x005C (size: 0x4)
    int32 NumEntrances;                                                               // 0x0060 (size: 0x4)
    FBox RVTBounds;                                                                   // 0x0064 (size: 0x1C)

}; // Size: 0x80

struct FInstancedMapDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FInstancedMapDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FInstancedSaveStateHeader
{
    int32 Version;                                                                    // 0x0008 (size: 0x4)
    FString UniqueLevelName;                                                          // 0x0010 (size: 0x10)
    int32 SubCaveID;                                                                  // 0x0020 (size: 0x4)
    FDateTime LastSavedDateTime;                                                      // 0x0028 (size: 0x8)
    TArray<FStateRecorderBlob> StateRecorderBlobs;                                    // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FInteractData : public FIcarusTableRowBase
{
    TSoftClassPtr<UInteractableBehaviour> Behaviour;                                  // 0x0018 (size: 0x28)
    EAuthorityType AuthorityType;                                                     // 0x0040 (size: 0x1)
    float InteractCooldown;                                                           // 0x0044 (size: 0x4)
    FText InteractionText;                                                            // 0x0048 (size: 0x18)
    FStaminaActionCostsRowHandle InteractStaminaCost;                                 // 0x0060 (size: 0x18)
    bool bShowInteractionWhenUnavailable;                                             // 0x0078 (size: 0x1)
    bool bCanPerformInteractionWhileSeated;                                           // 0x0079 (size: 0x1)

}; // Size: 0x80

struct FInteractStack
{
    TArray<class UInteractableBehaviour*> Stack;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FInteractableData : public FIcarusTableRowBase
{
    TArray<FInteractionHandleWithRequiredTag> WorldPressInteracts;                    // 0x0018 (size: 0x10)
    TArray<FInteractionHandleWithRequiredTag> WorldHoldInteracts;                     // 0x0028 (size: 0x10)
    TArray<FInteractionHandleWithRequiredTag> WorldAltPressInteracts;                 // 0x0038 (size: 0x10)
    TArray<FInteractionHandleWithRequiredTag> WorldAltHoldInteracts;                  // 0x0048 (size: 0x10)
    TArray<FRowHandle> GenericData;                                                   // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FInteractableEnum : public FRowEnum
{
}; // Size: 0x10

struct FInteractableHitLookup
{
    EInteractableHitLookupType Type;                                                  // 0x0000 (size: 0x1)
    FReplicatedHitResult Hit;                                                         // 0x0004 (size: 0x2C)
    class AFLODTile* Tile;                                                            // 0x0030 (size: 0x8)
    int32 RecordIndex;                                                                // 0x0038 (size: 0x4)
    int32 InstanceIndex;                                                              // 0x003C (size: 0x4)

}; // Size: 0x40

struct FInteractableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FInteractionHandleWithRequiredTag
{
    FInteractionsRowHandle InteractionRow;                                            // 0x0000 (size: 0x18)
    FString Tag;                                                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FInteractionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FInteractionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FInventoryBag
{
    TWeakObjectPtr<class UInventory> Inventory;                                       // 0x0000 (size: 0x8)
    int32 CurrentSlotIndex;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FInventoryContainerData : public FIcarusTableRowBase
{
    FInventoryInfoRowHandle InventoryInfo;                                            // 0x0018 (size: 0x18)
    int32 AttachmentSlot;                                                             // 0x0030 (size: 0x4)
    bool bCanInventoryTick;                                                           // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FInventoryContainerEnum : public FRowEnum
{
}; // Size: 0x10

struct FInventoryContainerRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FInventoryData : public FIcarusTableRowBase
{
    TArray<FInventoryInfoRowHandle> Inventories;                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FInventoryEnum : public FRowEnum
{
}; // Size: 0x10

struct FInventoryID : public FIcarusTableRowBase
{
    bool PlayerInventory;                                                             // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FInventoryIDEnum : public FRowEnum
{
}; // Size: 0x10

struct FInventoryIDRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FInventoryIdentification
{
    FInventoryIDEnum ID;                                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FInventoryInfo : public FIcarusTableRowBase
{
    FInventoryIDEnum InventoryID;                                                     // 0x0018 (size: 0x10)
    FTagQueriesRowHandle SlotTemplate;                                                // 0x0028 (size: 0x18)
    int32 StartingSlots;                                                              // 0x0040 (size: 0x4)
    TArray<FInventorySlotOverride> SlotOverrides;                                     // 0x0048 (size: 0x10)
    bool RemoveOnly;                                                                  // 0x0058 (size: 0x1)
    bool bIsClientSideOnly;                                                           // 0x0059 (size: 0x1)
    TMap<FStatsEnum, int32> Stats;                                                    // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FInventoryInfoEnum : public FRowEnum
{
}; // Size: 0x10

struct FInventoryInfoRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FInventoryRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FInventorySaveData
{
    TArray<FInventorySlotSaveData> Slots;                                             // 0x0000 (size: 0x10)
    int32 InventoryID;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FInventorySlot : public FFastArraySerializerItem
{
    FItemData ItemData;                                                               // 0x0010 (size: 0x1F0)
    FTagQueriesRowHandle Query;                                                       // 0x0200 (size: 0x18)
    bool Locked;                                                                      // 0x0218 (size: 0x1)
    FItemsStaticRowHandle LastItem;                                                   // 0x021C (size: 0x18)
    bool Slotable;                                                                    // 0x0234 (size: 0x1)
    int32 Index;                                                                      // 0x0238 (size: 0x4)

}; // Size: 0x240

struct FInventorySlotAlterationData
{
    FString Name;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FInventorySlotDynamicData
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    int32 Value;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FInventorySlotOverride : public FIcarusTableRowBase
{
    FTagQueriesRowHandle Query;                                                       // 0x0018 (size: 0x18)
    int32 Location;                                                                   // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FInventorySlotSaveData
{
    int32 Location;                                                                   // 0x0000 (size: 0x4)
    FName ItemStaticData;                                                             // 0x0004 (size: 0x8)
    FString ItemGuid;                                                                 // 0x0010 (size: 0x10)
    int32 ItemOwnerLookupId;                                                          // 0x0020 (size: 0x4)
    TArray<FInventorySlotDynamicData> DynamicData;                                    // 0x0028 (size: 0x10)
    TArray<FInventorySlotStatData> AdditionalStats;                                   // 0x0038 (size: 0x10)
    TArray<FInventorySlotAlterationData> Alterations;                                 // 0x0048 (size: 0x10)
    TArray<FLivingItemSlotSaveData> LivingItemSlots;                                  // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FInventorySlotStatData
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FString Name;                                                                     // 0x0008 (size: 0x10)
    int32 Value;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FInventorySlotsFastArray : public FFastArraySerializer
{
    TArray<FInventorySlot> Slots;                                                     // 0x0108 (size: 0x10)

}; // Size: 0x158

struct FItemAnimationData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UAnimSequence> FPJumpStart;                                        // 0x0018 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPJumpLoop;                                         // 0x0040 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> FPJumpEnd;                                          // 0x0068 (size: 0x28)
    TSoftObjectPtr<UBlendSpace1D> FPLocoBlendSpace;                                   // 0x0090 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> TPJumpStart;                                        // 0x00B8 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> TPJumpLoop;                                         // 0x00E0 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> TPJumpEnd;                                          // 0x0108 (size: 0x28)
    FLocomotionAnims TPLocomotionAnims;                                               // 0x0130 (size: 0x208)
    TSoftObjectPtr<UBlendSpace1D> UpToDownBlendSpace;                                 // 0x0338 (size: 0x28)

}; // Size: 0x360

struct FItemAnimationsEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemAnimationsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemAttachmentData : public FIcarusTableRowBase
{
    FName TPAttachmentSocketName;                                                     // 0x0018 (size: 0x8)
    FName FPAttachmentSocketName;                                                     // 0x0020 (size: 0x8)
    FName BackAttachmentSocketName;                                                   // 0x0028 (size: 0x8)
    EHandedness EquippableHandedness;                                                 // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FItemAttachmentEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemAttachmentRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemAudioAnimData
{
    TArray<TSoftObjectPtr<UFMODEvent>> FMODEvents;                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FItemAudioData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFMODEvent> PickUpSound;                                           // 0x0018 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> DropSound;                                             // 0x0040 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> HitSound;                                              // 0x0068 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> DamagedSound;                                          // 0x0090 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BrokenSound;                                           // 0x00B8 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> UseWhenBrokenSound;                                    // 0x00E0 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> RepairedSound;                                         // 0x0108 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> DestroyedSound;                                        // 0x0130 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> SlottedSound;                                          // 0x0158 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> ConsumedSound;                                         // 0x0180 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> ConsumeFailedSound;                                    // 0x01A8 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> ConsumableExpiredSound;                                // 0x01D0 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BackpackSound;                                         // 0x01F8 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> BackpackFootstepSound;                                 // 0x0220 (size: 0x28)
    TSoftObjectPtr<UFMODEvent> WeatherSound;                                          // 0x0248 (size: 0x28)
    TMap<class FName, class FItemAudioAnimData> AnimSounds;                           // 0x0270 (size: 0x50)

}; // Size: 0x2C0

struct FItemAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemClassificationsIconsData : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)
    class UTexture2D* Icon;                                                           // 0x0030 (size: 0x8)
    FText Tooltip;                                                                    // 0x0038 (size: 0x18)

}; // Size: 0x50

struct FItemClassificationsIconsEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemClassificationsIconsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemConstructionData
{
    FItemsStaticRowHandle ItemStatic;                                                 // 0x0000 (size: 0x18)
    TArray<FItemDynamicContainer> ItemDynamic;                                        // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FItemDLCData
{
    FItemsStaticRowHandle RowHandle;                                                  // 0x0000 (size: 0x18)
    FDLCPackageDataRowHandle DLC;                                                     // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FItemData : public FIcarusTableRowBase
{
    FItemsStaticRowHandle ItemStaticData;                                             // 0x0018 (size: 0x18)
    TArray<FItemDynamicData> ItemDynamicData;                                         // 0x0030 (size: 0x10)
    TArray<FIcarusStatReplicated> ItemCustomStats;                                    // 0x0040 (size: 0x10)
    FCustomProperties CustomProperties;                                               // 0x0050 (size: 0x50)
    FCachedItemStatContainer CachedStats;                                             // 0x00A0 (size: 0x110)
    bool bIsItemInstance;                                                             // 0x01B0 (size: 0x1)
    FString DatabaseGUID;                                                             // 0x01B8 (size: 0x10)
    int32 ItemOwnerLookupId;                                                          // 0x01C8 (size: 0x4)
    FGameplayTagContainer RuntimeTags;                                                // 0x01D0 (size: 0x20)

}; // Size: 0x1F0

struct FItemDynamicContainer
{
    TSubclassOf<class UTraitComponent> Component;                                     // 0x0000 (size: 0x8)
    TArray<FItemDynamicData> Properties;                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FItemDynamicData
{
    EDynamicItemProperties PropertyType;                                              // 0x0000 (size: 0x1)
    int32 Value;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FItemPriority
{
    FTagQueriesRowHandle QueryRow;                                                    // 0x0000 (size: 0x18)
    FInventoryIDEnum InventoryID;                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FItemRank : public FIcarusTableRowBase
{
    FTagQueriesRowHandle TagQuery;                                                    // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FItemRanksEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemRanksRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemRecordAlterationData
{
    FName Alteration;                                                                 // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FItemRecordDynamicData
{
    int32 Type;                                                                       // 0x0000 (size: 0x4)
    int32 Value;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FItemRecordStatData
{
    FName Stat;                                                                       // 0x0000 (size: 0x8)
    int32 Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FItemResourceGeneratedAlterationResult
{
    FItemData Item;                                                                   // 0x0000 (size: 0x1F0)
    TArray<FAlterationsEnum> ResourceGeneratedAlterations;                            // 0x01F0 (size: 0x10)

}; // Size: 0x200

struct FItemReward
{
    FItemTemplateRowHandle ItemTemplate;                                              // 0x0000 (size: 0x18)
    bool bUseRandomStackCount;                                                        // 0x0018 (size: 0x1)
    int32 MinRandomStackCount;                                                        // 0x001C (size: 0x4)
    int32 MaxRandomStackCount;                                                        // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FItemRewardEntry
{
    FItemTemplateRowHandle Item;                                                      // 0x0000 (size: 0x18)
    float DropChance;                                                                 // 0x0018 (size: 0x4)
    FStatsRowHandle DropChanceAdditiveStat;                                           // 0x001C (size: 0x18)
    FStatsRowHandle RequiredStatToDrop;                                               // 0x0034 (size: 0x18)
    int32 MinRandomStackCount;                                                        // 0x004C (size: 0x4)
    int32 MaxRandomStackCount;                                                        // 0x0050 (size: 0x4)
    bool bRewardsScale;                                                               // 0x0054 (size: 0x1)
    FStatsRowHandle StackAdditiveStat;                                                // 0x0058 (size: 0x18)
    FStatsRowHandle StackMultiplicativeStat;                                          // 0x0070 (size: 0x18)

}; // Size: 0x88

struct FItemRewards : public FIcarusTableRowBase
{
    TArray<FItemRewardEntry> Rewards;                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FItemRewardsEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemRewardsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemStack
{
    FItemsStaticRowHandle Item;                                                       // 0x0000 (size: 0x18)
    int32 Count;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FItemStaticData : public FIcarusTableRowBase
{
    FMeshableRowHandle Meshable;                                                      // 0x0018 (size: 0x18)
    FItemableRowHandle Itemable;                                                      // 0x0030 (size: 0x18)
    FInteractableRowHandle Interactable;                                              // 0x0048 (size: 0x18)
    FHitableRowHandle Hitable;                                                        // 0x0060 (size: 0x18)
    FEquippableRowHandle Equippable;                                                  // 0x0078 (size: 0x18)
    FFocusableRowHandle Focusable;                                                    // 0x0090 (size: 0x18)
    FHighlightableRowHandle Highlightable;                                            // 0x00A8 (size: 0x18)
    FActionableRowHandle Actionable;                                                  // 0x00C0 (size: 0x18)
    FBuildableRowHandle Buildable;                                                    // 0x00D8 (size: 0x18)
    FConsumableRowHandle Consumable;                                                  // 0x00F0 (size: 0x18)
    FUsableRowHandle Usable;                                                          // 0x0108 (size: 0x18)
    FCombustibleRowHandle Combustible;                                                // 0x0120 (size: 0x18)
    FDeployableRowHandle Deployable;                                                  // 0x0138 (size: 0x18)
    FArmourRowHandle Armour;                                                          // 0x0150 (size: 0x18)
    FBallisticRowHandle Ballistic;                                                    // 0x0168 (size: 0x18)
    FFillableRowHandle Fillable;                                                      // 0x0180 (size: 0x18)
    FDurableRowHandle Durable;                                                        // 0x0198 (size: 0x18)
    FFloatableRowHandle Floatable;                                                    // 0x01B0 (size: 0x18)
    FRocketableRowHandle Rocketable;                                                  // 0x01C8 (size: 0x18)
    FInventoryRowHandle Inventory;                                                    // 0x01E0 (size: 0x18)
    FProcessingRowHandle Processing;                                                  // 0x01F8 (size: 0x18)
    FThermalRowHandle Thermal;                                                        // 0x0210 (size: 0x18)
    FExperienceRowHandle Experience;                                                  // 0x0228 (size: 0x18)
    FSlotableRowHandle Slotable;                                                      // 0x0240 (size: 0x18)
    FDecayableRowHandle Decayable;                                                    // 0x0258 (size: 0x18)
    FFlammableRowHandle Flammable;                                                    // 0x0270 (size: 0x18)
    FTransmutableRowHandle Transmutable;                                              // 0x0288 (size: 0x18)
    FGeneratorRowHandle Generator;                                                    // 0x02A0 (size: 0x18)
    FWeightRowHandle Weight;                                                          // 0x02B8 (size: 0x18)
    FFarmableRowHandle Farmable;                                                      // 0x02D0 (size: 0x18)
    FInventoryContainerRowHandle InventoryContainer;                                  // 0x02E8 (size: 0x18)
    FLivingItemRowHandle LivingItem;                                                  // 0x0300 (size: 0x18)
    FResourceRowHandle Resource;                                                      // 0x0318 (size: 0x18)
    FToolDamageRowHandle ToolDamage;                                                  // 0x0330 (size: 0x18)
    FAmmoTypesRowHandle AmmoType;                                                     // 0x0348 (size: 0x18)
    FItemAudioDataRowHandle Audio;                                                    // 0x0360 (size: 0x18)
    FRangedWeaponDataRowHandle RangedWeaponData;                                      // 0x0378 (size: 0x18)
    FFirearmDataRowHandle FirearmData;                                                // 0x0390 (size: 0x18)
    FFLODDescriptionsRowHandle FLODData;                                              // 0x03A8 (size: 0x18)
    FTurretRowHandle TurretData;                                                      // 0x03C0 (size: 0x18)
    TMap<FBaseStatsEnum, int32> AdditionalStats;                                      // 0x03D8 (size: 0x50)
    FIcarusAttachmentsRowHandle Attachments;                                          // 0x0428 (size: 0x18)
    int32 CraftingExperience;                                                         // 0x0440 (size: 0x4)
    FGameplayTagContainer Manual_Tags;                                                // 0x0448 (size: 0x20)
    FGameplayTagContainer Generated_Tags;                                             // 0x0468 (size: 0x20)

}; // Size: 0x488

struct FItemTemplateEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemTemplateRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemTraitMask : public FIcarusTableRowBase
{
    bool bMeshable;                                                                   // 0x0018 (size: 0x1)
    bool bItemable;                                                                   // 0x0019 (size: 0x1)
    bool bInteractable;                                                               // 0x001A (size: 0x1)
    bool bHitable;                                                                    // 0x001B (size: 0x1)
    bool bEquippable;                                                                 // 0x001C (size: 0x1)
    bool bFocusable;                                                                  // 0x001D (size: 0x1)
    bool bHighlightable;                                                              // 0x001E (size: 0x1)
    bool bActionable;                                                                 // 0x001F (size: 0x1)
    bool bBuildable;                                                                  // 0x0020 (size: 0x1)
    bool bConsumable;                                                                 // 0x0021 (size: 0x1)
    bool bUsable;                                                                     // 0x0022 (size: 0x1)
    bool bCombustible;                                                                // 0x0023 (size: 0x1)
    bool bDeployable;                                                                 // 0x0024 (size: 0x1)
    bool bArmour;                                                                     // 0x0025 (size: 0x1)
    bool bBallistic;                                                                  // 0x0026 (size: 0x1)
    bool bFillable;                                                                   // 0x0027 (size: 0x1)
    bool bDurable;                                                                    // 0x0028 (size: 0x1)
    bool bFloatable;                                                                  // 0x0029 (size: 0x1)
    bool bRocketable;                                                                 // 0x002A (size: 0x1)
    bool bInventory;                                                                  // 0x002B (size: 0x1)
    bool bProcessing;                                                                 // 0x002C (size: 0x1)
    bool bResource;                                                                   // 0x002D (size: 0x1)
    bool bThermal;                                                                    // 0x002E (size: 0x1)
    bool bExperience;                                                                 // 0x002F (size: 0x1)
    bool bSlotable;                                                                   // 0x0030 (size: 0x1)
    bool bDecayable;                                                                  // 0x0031 (size: 0x1)
    bool bFlammable;                                                                  // 0x0032 (size: 0x1)
    bool bTransmutable;                                                               // 0x0033 (size: 0x1)
    bool bGenerator;                                                                  // 0x0034 (size: 0x1)
    bool bWeight;                                                                     // 0x0035 (size: 0x1)
    bool bFarmable;                                                                   // 0x0036 (size: 0x1)
    bool bInventoryContainer;                                                         // 0x0037 (size: 0x1)
    bool bLivingItem;                                                                 // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FItemTraitMasksEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemTraitMasksRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemWeightStatQueries : public FIcarusTableRowBase
{
    FStatsEnum WeightStatToApply;                                                     // 0x0018 (size: 0x10)
    FTagQueriesRowHandle ItemTagQuery;                                                // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FItemWeightStatQueriesEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemWeightStatQueriesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemableData : public FIcarusTableRowBase
{
    TSoftClassPtr<UItemableComponent> Behaviour;                                      // 0x0018 (size: 0x28)
    FText DisplayName;                                                                // 0x0040 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0058 (size: 0x28)
    TSoftObjectPtr<UTexture2D> Override_Glow_Icon;                                    // 0x0080 (size: 0x28)
    FText Description;                                                                // 0x00A8 (size: 0x18)
    FText FlavorText;                                                                 // 0x00C0 (size: 0x18)
    TArray<FText> FieldGuideKeywords;                                                 // 0x00D8 (size: 0x10)
    int32 Weight;                                                                     // 0x00E8 (size: 0x4)
    bool bAllowZeroWeight;                                                            // 0x00EC (size: 0x1)
    int32 MaxStack;                                                                   // 0x00F0 (size: 0x4)

}; // Size: 0xF8

struct FItemableEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FItemsStaticEnum : public FRowEnum
{
}; // Size: 0x10

struct FItemsStaticRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FKeyData : public FIcarusTableRowBase
{
    FKey Key;                                                                         // 0x0018 (size: 0x18)
    FText DisplayNameOverride;                                                        // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FKeyIconData : public FIcarusTableRowBase
{
    TArray<FKey> Keys;                                                                // 0x0018 (size: 0x10)
    bool bHideText;                                                                   // 0x0028 (size: 0x1)
    EControllerIconSet IconSet;                                                       // 0x0029 (size: 0x1)
    class UTexture2D* IconPress;                                                      // 0x0030 (size: 0x8)
    class UTexture2D* IconHold;                                                       // 0x0038 (size: 0x8)
    FLinearColor IconTint;                                                            // 0x0040 (size: 0x10)
    FLinearColor TextColor;                                                           // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FKeyIconsEnum : public FRowEnum
{
}; // Size: 0x10

struct FKeyIconsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FKeybindContext : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    TArray<FKeybindContextsRowHandle> SharedWithContexts;                             // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FKeybindContextsEnum : public FRowEnum
{
}; // Size: 0x10

struct FKeybindContextsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FKeybindData : public FIcarusTableRowBase
{
    FName ActionName;                                                                 // 0x0018 (size: 0x8)
    bool bOverrideActionName;                                                         // 0x0020 (size: 0x1)
    FName ActionNameOverride;                                                         // 0x0024 (size: 0x8)
    FText DisplayName;                                                                // 0x0030 (size: 0x18)
    FKeybindContextsRowHandle BindContext;                                            // 0x0048 (size: 0x18)
    EInputContext InputContext;                                                       // 0x0060 (size: 0x1)
    bool bIsAxis;                                                                     // 0x0061 (size: 0x1)
    EKeybindVisibility Visibility;                                                    // 0x0062 (size: 0x1)
    FInputActionKeyMapping KeyboardActionMapping;                                     // 0x0068 (size: 0x28)
    FInputAxisKeyMapping KeyboardAxisMapping;                                         // 0x0090 (size: 0x28)
    FInputActionKeyMapping GamepadActionMapping;                                      // 0x00B8 (size: 0x28)
    FInputAxisKeyMapping GamepadAxisMapping;                                          // 0x00E0 (size: 0x28)

}; // Size: 0x108

struct FKeybindingsEnum : public FRowEnum
{
}; // Size: 0x10

struct FKeybindingsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FKeysEnum : public FRowEnum
{
}; // Size: 0x10

struct FKeysRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FLandingPadRecord
{
    int32 LeveTimeBuilt;                                                              // 0x0000 (size: 0x4)
    FPlayerCharacterID PlayerID;                                                      // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FLanguagesData : public FIcarusTableRowBase
{
    bool bEnabled;                                                                    // 0x0018 (size: 0x1)
    int32 Coverage;                                                                   // 0x001C (size: 0x4)

}; // Size: 0x20

struct FLanguagesEnum : public FRowEnum
{
}; // Size: 0x10

struct FLanguagesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FLargeScaleDestroyParams
{
    EIcarusDamageType DamageType;                                                     // 0x0000 (size: 0x1)
    EDestroyPattern Pattern;                                                          // 0x0001 (size: 0x1)
    int32 DamageToDestroyRatio;                                                       // 0x0004 (size: 0x4)
    int32 StructuresDamageAmount;                                                     // 0x0008 (size: 0x4)
    int32 NPCDamageAmount;                                                            // 0x000C (size: 0x4)
    int32 PlayerDamageAmount;                                                         // 0x0010 (size: 0x4)
    FVector Location;                                                                 // 0x0014 (size: 0xC)
    int32 DamageRadiusCm;                                                             // 0x0020 (size: 0x4)
    int32 PlayerDamageRadiusCm;                                                       // 0x0024 (size: 0x4)
    float DamageDurationSec;                                                          // 0x0028 (size: 0x4)
    float CleanupAfterDelay;                                                          // 0x002C (size: 0x4)
    TArray<class AActor*> IgnoreActors;                                               // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FLastProspectHostInfo
{
    ELastProspectHostType LastHostType;                                               // 0x0000 (size: 0x1)
    FString SteamP2PHostId;                                                           // 0x0008 (size: 0x10)
    FString DedicatedServerIP;                                                        // 0x0018 (size: 0x10)
    FString CachedServerName;                                                         // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FLaunchItemReturnInfo
{
    FString OwningPlayerID;                                                           // 0x0000 (size: 0x10)
    TArray<FItemData> Items;                                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FLavaRiverFlowPointData
{
    FVector2D Location;                                                               // 0x0000 (size: 0x8)
    FVector2D Extent;                                                                 // 0x0008 (size: 0x8)
    float FlowSpeed;                                                                  // 0x0010 (size: 0x4)
    float BaseToFlowing;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FLevelArray : public FIcarusTableRowBase
{
    TArray<TSoftObjectPtr<UWorld>> Levels;                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FLevelSequencesData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UWorld> Level;                                                     // 0x0018 (size: 0x28)
    TMap<class FName, class ULevelSequence*> LevelSequences;                          // 0x0040 (size: 0x50)

}; // Size: 0x90

struct FLevelSequencesEnum : public FRowEnum
{
}; // Size: 0x10

struct FLevelSequencesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FLinearColorVariableRecord
{
    FName VariableName;                                                               // 0x0000 (size: 0x8)
    FLinearColor Variable;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FLivingItemData : public FIcarusTableRowBase
{
    TArray<FLivingItemUpgradeSlotData> UpgradeSlots;                                  // 0x0018 (size: 0x10)
    FVector ItemPreviewOffset;                                                        // 0x0028 (size: 0xC)
    FRotator ItemPreviewRotation;                                                     // 0x0034 (size: 0xC)
    TSoftObjectPtr<USkeletalMesh> PreviewMeshOverride;                                // 0x0040 (size: 0x28)
    TSoftClassPtr<ULivingItemComponent> BehaviourOverride;                            // 0x0068 (size: 0x28)

}; // Size: 0x90

struct FLivingItemEnum : public FRowEnum
{
}; // Size: 0x10

struct FLivingItemRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FLivingItemShopItemData : public FIcarusTableRowBase
{
    FItemTemplateRowHandle ItemTemplate;                                              // 0x0018 (size: 0x18)
    TArray<FWorkshopCost> Cost;                                                       // 0x0030 (size: 0x10)
    TSoftObjectPtr<UTexture2D> ItemImage;                                             // 0x0040 (size: 0x28)
    TSoftObjectPtr<UTexture2D> ItemBackground;                                        // 0x0068 (size: 0x28)
    TSoftObjectPtr<UTexture2D> ShopBackground;                                        // 0x0090 (size: 0x28)
    TSoftObjectPtr<UTexture2D> BossIcon;                                              // 0x00B8 (size: 0x28)
    FItemsStaticRowHandle Biomass;                                                    // 0x00E0 (size: 0x18)
    FDLCPackageDataRowHandle RequiredPackageToPurchase;                               // 0x00F8 (size: 0x18)
    FAccountFlagsRowHandle RequiredAccountFlag;                                       // 0x0110 (size: 0x18)

}; // Size: 0x128

struct FLivingItemShopItemsEnum : public FRowEnum
{
}; // Size: 0x10

struct FLivingItemShopItemsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FLivingItemSlotSaveData
{
    int32 CurrentProgress;                                                            // 0x0000 (size: 0x4)
    FString CurrentUpgrade;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FLivingItemSlotState
{
    int32 SlotIndex;                                                                  // 0x0000 (size: 0x4)
    int32 ChallengeProgress;                                                          // 0x0004 (size: 0x4)
    bool bIsActiveChallenge;                                                          // 0x0008 (size: 0x1)
    bool bSlotUnlocked;                                                               // 0x0009 (size: 0x1)
    FLivingItemUpgradeSlotData SlotData;                                              // 0x0010 (size: 0x50)
    FLivingItemUpgradesRowHandle CurrentUpgrade;                                      // 0x0060 (size: 0x18)

}; // Size: 0x78

struct FLivingItemUpgradeData : public FIcarusTableRowBase
{
    FAlterationsRowHandle AlterationToApply;                                          // 0x0018 (size: 0x18)
    TArray<FWorkshopCost> UpgradeCost;                                                // 0x0030 (size: 0x10)
    TArray<FMeshCustomisationData> MeshCustomisations;                                // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FLivingItemUpgradeSlot
{
    FLivingItemUpgradesEnum UpgradeSelection;                                         // 0x0000 (size: 0x10)
    int32 UnlockProgress;                                                             // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FLivingItemUpgradeSlotData
{
    FVector2D SlotPosition2D;                                                         // 0x0000 (size: 0x8)
    FVector2D PinPosition2D;                                                          // 0x0008 (size: 0x8)
    FVector2D PinBendPosition2D;                                                      // 0x0010 (size: 0x8)
    TArray<FLivingItemUpgradesRowHandle> AvailableUpgrades;                           // 0x0018 (size: 0x10)
    FChallengesRowHandle ChallengeToUnlock;                                           // 0x0028 (size: 0x18)
    TArray<FMeshCustomisationData> DefaultSlotMeshes;                                 // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FLivingItemUpgradesEnum : public FRowEnum
{
}; // Size: 0x10

struct FLivingItemUpgradesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FLoadedLevelInfo
{
    class ULevelStreamingDynamic* LoadedDynamicLevel;                                 // 0x0000 (size: 0x8)
    TArray<class AIcarusPlayerCharacter*> Players;                                    // 0x0008 (size: 0x10)
    TWeakObjectPtr<class UTeleportComponent> Requestor;                               // 0x0018 (size: 0x8)
    int32 PickedSlot;                                                                 // 0x0020 (size: 0x4)
    FVector LocationToLoadLevel;                                                      // 0x0024 (size: 0xC)

}; // Size: 0x30

struct FLoadoutRecords
{
    TArray<FPlayerLoadoutData> Loadouts;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLocomotionAnims
{
    TSoftObjectPtr<UAnimSequence> WalkF;                                              // 0x0000 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> WalkR;                                              // 0x0028 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> WalkB;                                              // 0x0050 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> WalkL;                                              // 0x0078 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> RunF;                                               // 0x00A0 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> RunR;                                               // 0x00C8 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> RunB;                                               // 0x00F0 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> RunL;                                               // 0x0118 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> SprintF;                                            // 0x0140 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> CrouchWalkF;                                        // 0x0168 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> CrouchWalkR;                                        // 0x0190 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> CrouchWalkB;                                        // 0x01B8 (size: 0x28)
    TSoftObjectPtr<UAnimSequence> CrouchWalkL;                                        // 0x01E0 (size: 0x28)

}; // Size: 0x208

struct FLogCategoriesEnum : public FRowEnum
{
}; // Size: 0x10

struct FLogCategoriesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FManuallyAddedInventoryItems
{
    TArray<FItemRewardEntry> ItemRewards;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMapIconsData : public FIcarusTableRowBase
{
    TSoftClassPtr<UUserWidget> WidgetClass;                                           // 0x0018 (size: 0x28)
    class UTexture2D* MapIcon;                                                        // 0x0040 (size: 0x8)
    FColor Color;                                                                     // 0x0048 (size: 0x4)
    FStatsEnum RequiredPlayerStatToShow;                                              // 0x0050 (size: 0x10)
    FStatsEnum RequiredActorStatToShow;                                               // 0x0060 (size: 0x10)
    bool RequireOwnershipToShow;                                                      // 0x0070 (size: 0x1)
    float ZOrder;                                                                     // 0x0074 (size: 0x4)
    float ScaleFactor;                                                                // 0x0078 (size: 0x4)
    bool GetsRotation;                                                                // 0x007C (size: 0x1)
    FVector2D BrushSize;                                                              // 0x0080 (size: 0x8)
    bool UpdateOnTick;                                                                // 0x0088 (size: 0x1)
    bool bShowNameOnHover;                                                            // 0x0089 (size: 0x1)
    FText HoverName;                                                                  // 0x0090 (size: 0x18)
    bool bDisplayOnCompass;                                                           // 0x00A8 (size: 0x1)
    int32 MaxCompassDisplayDistance;                                                  // 0x00AC (size: 0x4)
    TSubclassOf<class UUserWidget> CompassWidgetClass;                                // 0x00B0 (size: 0x8)

}; // Size: 0xB8

struct FMapIconsEnum : public FRowEnum
{
}; // Size: 0x10

struct FMapIconsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMapManagerRecord
{
    TMap<FIntPoint, int32> TileFlags;                                                 // 0x0000 (size: 0x50)
    TArray<FRadarV3ScanData> RadarV3Scans;                                            // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FMapRow
{
    TArray<EMapTileRadarFlag> ColumnTiles;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMapSearchArea : public FIcarusTableRowBase
{
    TSoftObjectPtr<UTexture2D> Image;                                                 // 0x0018 (size: 0x28)
    FLinearColor Color;                                                               // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FMapSearchAreaEnum : public FRowEnum
{
}; // Size: 0x10

struct FMapSearchAreaRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMeshCustomisationData
{
    FName SocketName;                                                                 // 0x0000 (size: 0x8)
    TSoftObjectPtr<UStaticMesh> StaticMeshToSocket;                                   // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FMeshableData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UStreamableRenderAsset> ItemMesh;                                  // 0x0018 (size: 0x28)
    TSoftClassPtr<AIcarusItem> ItemActor;                                             // 0x0040 (size: 0x28)
    TSoftObjectPtr<UStreamableRenderAsset> EquipHandMesh;                             // 0x0068 (size: 0x28)
    TSoftClassPtr<AIcarusItem> EquipHandActor;                                        // 0x0090 (size: 0x28)
    TSoftObjectPtr<UStreamableRenderAsset> EquipBackMesh;                             // 0x00B8 (size: 0x28)
    TSoftClassPtr<AIcarusItem> EquipBackActor;                                        // 0x00E0 (size: 0x28)
    TSoftObjectPtr<UStreamableRenderAsset> VehicleMesh;                               // 0x0108 (size: 0x28)
    TSoftClassPtr<AIcarusItem> VehicleActor;                                          // 0x0130 (size: 0x28)
    TSoftClassPtr<AIcarusItem> DeployableActor;                                       // 0x0158 (size: 0x28)
    TSoftObjectPtr<UStreamableRenderAsset> ExtraMesh;                                 // 0x0180 (size: 0x28)
    TSoftClassPtr<AIcarusItem> ExtraActor;                                            // 0x01A8 (size: 0x28)

}; // Size: 0x1D0

struct FMeshableEnum : public FRowEnum
{
}; // Size: 0x10

struct FMeshableRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMetaCurrency : public FIcarusTableRowBase
{
    FText DisplayName;                                                                // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)
    FColor Color;                                                                     // 0x0058 (size: 0x4)
    FText Description;                                                                // 0x0060 (size: 0x18)
    FItemsStaticRowHandle ItemStaticData;                                             // 0x0078 (size: 0x18)
    FString DecoratorText;                                                            // 0x0090 (size: 0x10)
    FString DecoratorImage;                                                           // 0x00A0 (size: 0x10)
    bool bDisplayOnMainScreen;                                                        // 0x00B0 (size: 0x1)

}; // Size: 0xB8

struct FMetaCurrencyEnum : public FRowEnum
{
}; // Size: 0x10

struct FMetaCurrencyRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMetaInventory
{
    EMetaInventoryID InventoryID;                                                     // 0x0000 (size: 0x1)
    TArray<FItemData> Items;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMetaResourceNodeInfo : public FIcarusTableRowBase
{
    TSoftClassPtr<AResourceDeposit> ResourceBP;                                       // 0x0018 (size: 0x28)
    FOreDepositRowHandle Resource;                                                    // 0x0040 (size: 0x18)

}; // Size: 0x58

struct FMetaResourceNodesEnum : public FRowEnum
{
}; // Size: 0x10

struct FMetaResourceNodesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMetaSpawn
{
    FExoticSpawnEnum SpawnLocation;                                                   // 0x0000 (size: 0x10)
    int32 MinMetaAmount;                                                              // 0x0010 (size: 0x4)
    int32 MaxMetaAmount;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FMinedSphere
{
    FVector Center;                                                                   // 0x0000 (size: 0xC)
    float Radius;                                                                     // 0x000C (size: 0x4)

}; // Size: 0x14

struct FMinimapData
{
    TArray<TSoftObjectPtr<UTexture2D>> MapTextures;                                   // 0x0000 (size: 0x10)
    TArray<TSoftObjectPtr<UTexture2D>> HeightMapTextures;                             // 0x0010 (size: 0x10)
    FVector WorldBoundaryMin;                                                         // 0x0020 (size: 0xC)
    FVector WorldBoundaryMax;                                                         // 0x002C (size: 0xC)

}; // Size: 0x38

struct FMissionHistoryRecord
{
    FString Mission;                                                                  // 0x0000 (size: 0x10)
    int32 Status;                                                                     // 0x0010 (size: 0x4)
    int32 MissionEndTime;                                                             // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FMissionNPCData : public FIcarusTableRowBase
{
    FHighlightableRowHandle Highlightable;                                            // 0x0018 (size: 0x18)
    FDialogueSpeakerRowHandle Speaker;                                                // 0x0030 (size: 0x18)
    TArray<FDialogueEntry> Dialogue;                                                  // 0x0048 (size: 0x10)
    FDialoguePoolRowHandle Fallback;                                                  // 0x0058 (size: 0x18)

}; // Size: 0x70

struct FMissionNPCEnum : public FRowEnum
{
}; // Size: 0x10

struct FMissionNPCHeldItem
{
    TSoftObjectPtr<UStreamableRenderAsset> HeldItemMesh;                              // 0x0000 (size: 0x28)
    FName AttachSocketName;                                                           // 0x0028 (size: 0x8)
    FTransform RelativeTransformOffset;                                               // 0x0030 (size: 0x30)

}; // Size: 0x60

struct FMissionNPCRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMissionObjectiveEntry
{
    FQuestsRowHandle QuestRow;                                                        // 0x0000 (size: 0x18)
    int32 Depth;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FMissionReport
{
    FProspectInfo ProspectInfo;                                                       // 0x0000 (size: 0xA0)
    TArray<FMissionReportCurrency> Currency;                                          // 0x00A0 (size: 0x10)
    TArray<FFactionMissionsRowHandle> CompletedMissions;                              // 0x00B0 (size: 0x10)

}; // Size: 0xC0

struct FMissionReportCurrency
{
    FMetaCurrencyEnum Currency;                                                       // 0x0000 (size: 0x10)
    int32 Total;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FMissionStatus
{
    FFactionMissionsRowHandle Mission;                                                // 0x0000 (size: 0x18)
    EMissionState MissionState;                                                       // 0x0018 (size: 0x1)
    int32 MissionEndTime;                                                             // 0x001C (size: 0x4)

}; // Size: 0x20

struct FMissionType : public FIcarusTableRowBase
{
    FText DisplayText;                                                                // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FMissionTypesEnum : public FRowEnum
{
}; // Size: 0x10

struct FMissionTypesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FModifier
{
    FModifierStatesRowHandle Modifier;                                                // 0x0000 (size: 0x18)
    float ModifierLifetime;                                                           // 0x0018 (size: 0x4)
    int32 ModifierEffectiveness;                                                      // 0x001C (size: 0x4)

}; // Size: 0x20

struct FModifierStateAudioData : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFMODEvent> PlayerModifierAddedSound;                              // 0x0018 (size: 0x28)
    bool bReplayOnStack;                                                              // 0x0040 (size: 0x1)
    float CooldownTime;                                                               // 0x0044 (size: 0x4)
    TSoftObjectPtr<UFMODEvent> PlayerModifierLoopSound;                               // 0x0048 (size: 0x28)
    bool bApplyStackCountParameterToLoop;                                             // 0x0070 (size: 0x1)
    TSoftObjectPtr<UFMODEvent> PlayerModifierRemovedSound;                            // 0x0078 (size: 0x28)
    bool bApplyExposedVocalisation;                                                   // 0x00A0 (size: 0x1)
    int32 ExposedVocalisationMinEffectiveness;                                        // 0x00A4 (size: 0x4)
    bool bApplyEffectivenessParameter;                                                // 0x00A8 (size: 0x1)

}; // Size: 0xB0

struct FModifierStateAudioDataEnum : public FRowEnum
{
}; // Size: 0x10

struct FModifierStateAudioDataRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FModifierStateData : public FIcarusTableRowBase
{
    class UTexture2D* ModifierIcon;                                                   // 0x0018 (size: 0x8)
    EModifierType Type;                                                               // 0x0020 (size: 0x1)
    FText ModifierName;                                                               // 0x0028 (size: 0x18)
    FText ModifierDescription;                                                        // 0x0040 (size: 0x18)
    bool VisibleToPlayer;                                                             // 0x0058 (size: 0x1)
    TSoftClassPtr<USceneComponent> CosmeticAttachComponent;                           // 0x0060 (size: 0x28)
    FModifierStateAudioDataRowHandle AudioData;                                       // 0x0088 (size: 0x18)
    TMap<FStatsEnum, int32> GrantedStats;                                             // 0x00A0 (size: 0x50)
    TArray<FStatsEnum> ModifierEffectivenessAffectors;                                // 0x00F0 (size: 0x10)
    bool bAura;                                                                       // 0x0100 (size: 0x1)
    int32 AuraRange;                                                                  // 0x0104 (size: 0x4)
    FAuraFlags AuraFlags;                                                             // 0x0108 (size: 0x4)
    FModifierStatesRowHandle ModifierGrantedByAura;                                   // 0x010C (size: 0x18)
    bool bEscalates;                                                                  // 0x0124 (size: 0x1)
    FAfflictionChanceRowHandle Escalation;                                            // 0x0128 (size: 0x18)
    float EscalationTime;                                                             // 0x0140 (size: 0x4)
    bool bRemovedOnEscalation;                                                        // 0x0144 (size: 0x1)
    TSoftClassPtr<UModifierStateComponent> Behaviour;                                 // 0x0148 (size: 0x28)
    TMap<class FString, class FRandomRangeValue> ModifierVariables;                   // 0x0170 (size: 0x50)
    bool ShouldTick;                                                                  // 0x01C0 (size: 0x1)
    bool TickOnApply;                                                                 // 0x01C1 (size: 0x1)
    float ModifierTickRate;                                                           // 0x01C4 (size: 0x4)
    TArray<FStatsEnum> ModifierLifetimeAffectors;                                     // 0x01C8 (size: 0x10)
    bool RemovedOnDeath;                                                              // 0x01D8 (size: 0x1)
    EModifierMergeType MergeType;                                                     // 0x01D9 (size: 0x1)
    int32 MaxStackNum;                                                                // 0x01DC (size: 0x4)
    FGameplayTagContainer ModifierTags;                                               // 0x01E0 (size: 0x20)
    FGameplayTagQuery ModifierAllowedQuery;                                           // 0x0200 (size: 0x48)
    FTagQueriesRowHandle EffectsCustomActor;                                          // 0x0248 (size: 0x18)
    bool bEffectsObjects;                                                             // 0x0260 (size: 0x1)
    bool bEffectsNPCs;                                                                // 0x0261 (size: 0x1)
    bool bEffectsPlayers;                                                             // 0x0262 (size: 0x1)
    bool SaveToDatabase;                                                              // 0x0263 (size: 0x1)
    bool RemovedOnClick;                                                              // 0x0264 (size: 0x1)

}; // Size: 0x268

struct FModifierStateSaveData
{
    FName RowName;                                                                    // 0x0000 (size: 0x8)
    float TimeRemaining;                                                              // 0x0008 (size: 0x4)
    float InitialModifierLifeTime;                                                    // 0x000C (size: 0x4)
    float DurationBuffModifier;                                                       // 0x0010 (size: 0x4)
    int32 ModifierEffectiveness;                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FModifierStatesEnum : public FRowEnum
{
}; // Size: 0x10

struct FModifierStatesRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FModifierTrigger
{
    FModifierStatesRowHandle Modifier;                                                // 0x0000 (size: 0x18)
    float PercentTrigger;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FMountGeneticsSaveData
{
    FName GeneticValueName;                                                           // 0x0000 (size: 0x8)
    int32 Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMountSaveData
{
    FString DatabaseGUID;                                                             // 0x0000 (size: 0x10)
    FStateRecorderBlob RecorderBlob;                                                  // 0x0010 (size: 0x20)
    FString MountName;                                                                // 0x0030 (size: 0x10)
    int32 MountLevel;                                                                 // 0x0040 (size: 0x4)
    FString MountType;                                                                // 0x0048 (size: 0x10)
    FString MountIconName;                                                            // 0x0058 (size: 0x10)
    class AActor* ActorRepresentation;                                                // 0x0068 (size: 0x8)

}; // Size: 0x70

struct FMountTalentSaveData
{
    FString TalentRowName;                                                            // 0x0000 (size: 0x10)
    int32 TalentRank;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FMountVariation
{
    TMap<int32, TSoftObjectPtr<UMaterialInstance>> MeshMaterials;                     // 0x0000 (size: 0x50)
    TMap<int32, TSoftObjectPtr<UMaterialInstance>> GFurMaterials;                     // 0x0050 (size: 0x50)
    TMap<int32, TSoftObjectPtr<UMaterialInstance>> CarcassMeshMaterials;              // 0x00A0 (size: 0x50)
    TMap<int32, TSoftObjectPtr<UMaterialInstance>> CarcassGFurMaterials;              // 0x00F0 (size: 0x50)
    int32 Weighting;                                                                  // 0x0140 (size: 0x4)

}; // Size: 0x148

struct FMountsEnum : public FRowEnum
{
}; // Size: 0x10

struct FMountsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMovementStateData
{
    float MaxWalkSpeed;                                                               // 0x0000 (size: 0x4)
    float GroundFriction;                                                             // 0x0004 (size: 0x4)
    float BrakingFriction;                                                            // 0x0008 (size: 0x4)
    float MaxAcceleration;                                                            // 0x000C (size: 0x4)
    float BrakingDeceleration;                                                        // 0x0010 (size: 0x4)
    float RotationRate;                                                               // 0x0014 (size: 0x4)
    float MaxSwimSpeed;                                                               // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FMultiPointAudioNode
{
    class UObject* TargetObject;                                                      // 0x0000 (size: 0x8)

}; // Size: 0x28

struct FMultiPointAudioNodeArray
{
    TArray<FMultiPointAudioNode> Nodes;                                               // 0x0010 (size: 0x10)
    TArray<FMultiPointAudioNode> PendingNodes;                                        // 0x0020 (size: 0x10)

}; // Size: 0x88

struct FMusicLocationCondition : public FIcarusTableRowBase
{
}; // Size: 0x18

struct FMusicLocationConditionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FMusicLocationConditionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMusicQuestCondition : public FIcarusTableRowBase
{
}; // Size: 0x18

struct FMusicQuestConditionsEnum : public FRowEnum
{
}; // Size: 0x10

struct FMusicQuestConditionsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMusicSubsystemConfig
{
    float MinWaitTimeBetweenTracks;                                                   // 0x0000 (size: 0x4)
    float MaxWaitTimeBetweenTracks;                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FMusicTrack : public FIcarusTableRowBase
{
    TSoftObjectPtr<UFMODEvent> Event;                                                 // 0x0018 (size: 0x28)
    class UCurveFloat* FadeInCurve;                                                   // 0x0040 (size: 0x8)
    class UCurveFloat* FadeOutCurve;                                                  // 0x0048 (size: 0x8)
    class UCurveFloat* PrevTrackOverrideFadeOutCurve;                                 // 0x0050 (size: 0x8)
    bool bTrackCanBePaused;                                                           // 0x0058 (size: 0x1)
    uint8 PlayerStateFlags;                                                           // 0x0059 (size: 0x1)
    TSet<FMusicLocationConditionsRowHandle> Locations;                                // 0x0060 (size: 0x50)
    uint8 CombatFlags;                                                                // 0x00B0 (size: 0x1)
    uint8 TimeOfDayFlags;                                                             // 0x00B1 (size: 0x1)
    uint8 WeatherFlags;                                                               // 0x00B2 (size: 0x1)
    uint8 DropTimeFlags;                                                              // 0x00B3 (size: 0x1)
    uint8 DropStateFlags;                                                             // 0x00B4 (size: 0x1)
    uint8 GameplayEventFlags;                                                         // 0x00B5 (size: 0x1)
    uint8 DisasterFlags;                                                              // 0x00B6 (size: 0x1)
    TSet<FMusicQuestConditionsRowHandle> Quests;                                      // 0x00B8 (size: 0x50)
    FMusicTrackStateGroupsRowHandle StateGroup;                                       // 0x0108 (size: 0x18)
    float Tempo;                                                                      // 0x0120 (size: 0x4)
    FName Key;                                                                        // 0x0124 (size: 0x8)
    FName TimeSignature;                                                              // 0x012C (size: 0x8)

}; // Size: 0x138

struct FMusicTrackStateGroup : public FIcarusTableRowBase
{
}; // Size: 0x18

struct FMusicTrackStateGroupsEnum : public FRowEnum
{
}; // Size: 0x10

struct FMusicTrackStateGroupsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FMusicTracksEnum : public FRowEnum
{
}; // Size: 0x10

struct FMusicTracksRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FNationalFlag : public FIcarusTableRowBase
{
    FItemableRowHandle Item;                                                          // 0x0018 (size: 0x18)
    TSoftObjectPtr<UTexture2D> FlagTexture;                                           // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FNationalFlagsEnum : public FRowEnum
{
}; // Size: 0x10

struct FNationalFlagsRowHandle : public FRowHandle
{
}; // Size: 0x18

struct FNetworkDeviceInstanceData
{
    class AIcarusActor* DeviceActor;                                                  // 0x0000 (size: 0x8)
    EDeviceState State;                                                               // 0x0008 (size: 0x1)
    bool bHasPriority;                                                                // 0x0009 (size: 0x1)
    int32 CurrentFlow;                                                                // 0x000C (size: 0x4)
